--======================================================================--
--	☆ 作者：飞蛾扑火 QQ：1415559882
--======================================================================--
local 场景类_创建 = class()

local tp
local mouseb = 引擎.鼠标按下
local qtx = 引擎.取头像
local qmx = 引擎.取模型
local qzd = 引擎.取战斗模型
local qbb = 引擎.取宝宝
local random = 引擎.取随机整数
local txs = {飞燕女=65,骨精灵=66,狐美人=67,虎头怪=68,巨魔王=69,剑侠客=70,龙太子=71,鬼潇潇=72,偃无师=73,杀破狼=74,神天兵=75,巫蛮儿=76,舞天姬=77,玄彩娥=78,桃夭夭=79,逍遥生=80,羽灵神=81,英女侠=82}

local 旋转x, 旋转y, 旋转r = 73, 73, 52
local ptx, pty = 46,0
local 进度 = 0

function 场景类_创建:初始化(根)
	tp = 根
	local require = require
	self.选中人物 = 0
	self.选择人物 = false
	self.说明框状态 = "人物介绍"
	self.动作 = "静立"
	self.方向 = 4
	self.染色ID = 0
	self.介绍文本 = 根._丰富文本(250,81)
	local 资源 = 根.资源
	self.介绍文本:置行度(-1)
	self.文字创建角色 = 资源:载入('wzife.wdf',"网易WDF动画",0xB3E8376C)
	self.背景图片 = pwd("57")
	self.背景图片魔 = pwd("56")
	self.背景图片仙 = pwd("58")
	-- self.人物姓名框 = 资源:载入('wzife.wdf',"网易WDF动画",0x1BA268A5)
	self.旋转背景 = pwd("55")
	-- self.测试人物 = 资源:载入('gsbu.dll',"网易WDF动画",0x10000000)

	local 按钮 = tp._按钮
	self.影子 = 资源:载入('shape.wdf',"网易WDF动画",0xDCE4B562)
	self.选择框 = 资源:载入('wzife.wdf',"网易WDF动画",0x37DD63ED)
	self.一号染色 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0xE328CB14),0,0,3,true,true)
	self.二号染色 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x57DAD188),0,0,3,true,true)
	self.三号染色 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x185D8D97),0,0,3,true,true)
	self.人物站立 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x74706375),0,0,3,true,true)
	self.人物奔跑 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x5CB66E72),0,0,3,true,true)
	self.人物攻击 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0xD27DAAD2),0,0,3,true,true)
	self.人物施法 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0xB8EBD1E5),0,0,3,true,true)
	self.后退一个方向 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x15B09F21),0,0,3,true,true)
	self.前进一个方向 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x2AF9D941),0,0,3,true,true)
	self.人物介绍 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x9EBCAA98),0,0,3,true,true)
	self.可用兵器 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x1559A775),0,0,3,true,true)
	self.可选门派 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0xF0B715C0),0,0,3,true,true)
	self.人物说明框 = 资源:载入('wzife.wdf',"网易WDF动画",0x9DCA2A15)
	self.人物说明框上翻 =  按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0xFD3D61F2),0,0,3,true,true)
	self.人物说明框下翻 = 按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x09217E13),0,0,3,true,true)
	self.人物随机名字 = 按钮.创建(资源:载入('wzife.wdf',"网易WDF动画",0x92ABEFD3),0,0,3,true,true)
	-- 公用
	self.上一步 =  按钮.创建(资源:载入('wzife.wd5',"网易WDF动画",0x00010009),0,0,3,true,true)
	self.下一步 =  按钮.创建(资源:载入('wzife.wd5',"网易WDF动画",0x00010003),0,0,3,true,true)

	self.魔小 = 按钮.创建(pwd("59"),0,0,3,true,true)
	self.仙中 = 按钮.创建(pwd("60"),0,0,3,true,true)
	self.仙小 = 按钮.创建(pwd("61"),0,0,3,true,true)
	self.人中 = 按钮.创建(pwd("62"),0,0,3,true,true)
	self.人小 = 按钮.创建(pwd("63"),0,0,3,true,true)
	self.魔中 = 按钮.创建(pwd("64"),0,0,3,true,true)

	self.分类 = "人"
	self.开始 = 1
	self.结束 = 6
	self.旋转 = false
	self.旋转坐标 = {}
	local x, y, r = 73, 73, 52
	for i = 1, 360 do
	  local angle = i * math.pi / 180
	  local ptx, pty = x + r * math.cos( angle )-38, y + r * math.sin( angle )-38
	  local 坐标 = {x=ptx,y=pty}
	  table.insert(self.旋转坐标,坐标)
	end
	self.人开始 = 1
	self.仙开始 = 120
	self.魔开始 = 240
end

function 场景类_创建:置方向(方向,n)
	self.创建人物精灵[n]["静立"]:置方向(方向)
	self.创建人物精灵[n]["行走"]:置方向(方向)
	self.创建人物精灵[n]["攻击"]:置方向(取四至八方向(方向))
	self.创建人物精灵[n]["施法"]:置方向(取四至八方向(方向))
end

function 场景类_创建:刷新位置()
	local 资源 = tp.资源
	self.局部游戏高度 = 全局游戏高度/2
	self.局部游戏宽度 = 全局游戏宽度/2
	self.人物列表 = {}
	self.人物列表[1] = {模型="飞燕女",x=263,y=40,染色方案=3,介绍="深山有佳人,灼灼芙蓉姿,飞燕女轻盈飘逸,灵慧动人,自幼怜爱弱小,嫉恶如仇,一生自由自在,是大自然骄纵的宠儿\n#Z/擅使兵器：双剑、环圈",兵器="双剑\n环圈",门派="大唐官府\n方寸山\n女儿村\n神木林"}
	self.人物列表[2] = {模型="英女侠",x=353,y=40,染色方案=4,介绍="兰心惠质出名门,英姿飒爽自芳华,英女侠天资聪颖,精通琴棋书画,心怀仁爱,行善不落人后,是位侠骨柔情的奇女子\n#Z/擅使兵器：双剑、鞭",兵器="双剑\n长鞭",门派="大唐官府\n方寸山\n女儿村\n神木林"}
	self.人物列表[3] = {模型="巫蛮儿",x=443,y=40,染色方案=1,介绍="嫣然巧笑踏绿萝,一路银铃一路歌,巫蛮儿质朴单纯,灵动可人,生性善良,活泼可爱,花盈翠影出神木,环佩婉转披香来\n#Z/擅使兵器：宝珠、法杖",兵器="宝珠\n法杖",门派="大唐官府\n方寸山\n女儿村\n神木"}
	self.人物列表[4] = {模型="逍遥生",x=623,y=40,染色方案=1,介绍="快意恩仇事,把酒踏歌行,一袭白衫,一纸折扇,逍遥生风流倜傥,潇洒自如,行事光明磊落,是世人乐于结交的谦谦君子\n#Z/擅使兵器：剑、扇",兵器="剑\n扇",门派="大唐官府\n化生寺\n方寸山\n神木林"}
	self.人物列表[5] = {模型="剑侠客",x=713,y=40,染色方案=2,介绍="霜刃露锋芒,飒沓如流星,剑侠客率情任性,狂放不羁,一生淡泊名利,嗜武如痴,英雄意,儿女情,独闯江湖半生醉,举杯邀月最销魂\n#Z/擅使兵器：刀、剑",兵器="刀\n剑",门派="大唐官府\n化生寺\n方寸山\n神木林"}
	self.人物列表[6] = {模型="偃无师",x=533,y=40,染色方案=1,介绍="铁手隐机枢，巧夺天工，猛力执巨剑，志敌万均。偃无师性情冷厉，疏狂不羁，亦有奇谋满腹，铮铮傲骨。\n#Z/擅使兵器：剑、巨剑",兵器="巨剑\n剑",门派="大唐官府\n化生寺\n方寸山\n神木林"}
	self.人物列表[7] = {模型="狐美人",x=263,y=40,染色方案=7,介绍="修眉连娟,斜挑入眉,媚眼如丝,含娇含笑,狐美人柔情绰态,胜似海棠醉日,风情万种,颠倒众生\n#Z/擅使兵器：爪刺、鞭",兵器="爪刺\n鞭",门派="盘丝洞\n阴曹地府\n魔王寨\n无底洞"}
	self.人物列表[8] = {模型="骨精灵",x=353,y=40,染色方案=8,介绍="眉黛春山秀,横波剪秋水,骨精灵娇妍俏皮,顾盼神飞,机敏聪慧,好打不平,对世间万物充满好奇\n#Z/擅使兵器：爪刺、魔棒",兵器="爪刺\n魔棒",门派="盘丝洞\n阴曹地府\n魔王寨\n无底洞"}
	self.人物列表[9] = {模型="杀破狼",x=443,y=40,染色方案=1,介绍="一啸生风雪,长歌动寒霜,杀破狼飘逸潇洒,气宇轩昂,能文能武,卓尔不群,身具的神秘天狼血统,纵横骄天下,傲立三界间.\n#Z/擅使兵器：弓弩、宝珠",兵器="弓弩\n宝珠",门派="狮驼岭\n魔王寨\n阴曹地府\n无底洞"}
	self.人物列表[10] = {模型="巨魔王",x=623,y=40,染色方案=5,介绍="一怒震乾坤,杀气凝如山,巨魔王力拔山气兮盖世,肩负魔族神秘使命,叱咤风云,威风凛凛\n#Z/擅使兵器：斧钺、刀",兵器="斧钺\n刀",门派="狮驼岭\n魔王寨\n阴曹地府\n无底洞"}
	self.人物列表[11] = {模型="虎头怪",x=713,y=40,染色方案=6,介绍="戏谑犹可爱,虽有神力不欺人,虎头怪弯弧五百步,长戟八十斤,勇武过人,生性耿直豁达,对朋友忠肝义胆,是顶天立地的大丈夫\n#Z/擅使兵器：斧钺、锤",兵器="斧钺\n锤",门派="狮驼岭\n魔王寨\n阴曹地府\n无底洞"}
	self.人物列表[12] = {模型="鬼潇潇",x=533,y=40,染色方案=2,介绍="寒眸印秋水，魂隐三生途，素手执竹伞，影馀幽冥路。鬼潇潇青丝如墨，红杉如火，一对异色瞳里似乎藏着无尽的忧愁和神秘。\n#Z/擅使兵器：爪刺、伞",兵器="爪刺\n伞",门派="狮驼岭\n魔王寨\n阴曹地府\n无底洞"}
	self.人物列表[13] = {模型="舞天姬",x=263,y=40,染色方案=11,介绍="霓裳曳广带,飘拂升天行,舞天姬明眸珠辉,瑰姿艳逸,生性善解人意,令人如沐春风.一舞绡丝动四方,观之心魂俱醉\n#Z/擅使兵器：飘带、环圈",兵器="飘带\n环圈",门派="天宫\n普陀山\n龙宫\n凌波城"}
	self.人物列表[14] = {模型="玄彩娥",x=353,y=40,染色方案=12,介绍="桂露对仙娥,星星下云逗,玄彩娥在花从中蝶翼翩翩,婀娜曼妙,犹聚晨露新聚,奇花初蕊,是集天地灵气于一身的百花仙子\n#Z/擅使兵器：飘带、魔棒",兵器="飘带\n魔棒",门派="龙宫\n普陀山\n天宫\n凌波城"}
	self.人物列表[15] = {模型="羽灵神",x=443,y=40,染色方案=1,介绍="游侠红尘里,豪情动九天.羽灵神热情正直,率性豁达,游侠三界间,交友遍天下;乐见四海尽升平,愿引凤鸣遍九州\n#Z/擅使兵器：弓弩、法杖",兵器="弓弩\n法杖",门派="天宫\n龙宫\n普陀山\n凌波城"}
	self.人物列表[16] = {模型="神天兵",x=623,y=40,染色方案=9,介绍="金甲腾云受天命,神枪破逆卫灵霄,神天兵风采鹰扬,锋芒毕露,守护天庭立天威,所向披靡,妖魔皆闻风丧胆\n#Z/擅使兵器：枪矛、锤",兵器="枪矛\n锤",门派="龙宫\n天宫\n五庄观\n凌波城"}
	self.人物列表[17] = {模型="龙太子",x=713,y=40,染色方案=10,介绍="乘风破浪翔碧海,腾云架雾上青天,龙太子凭借天生的优势领悟仙法精髓,是当之无愧的龙族骄子,身经百战的天界战将\n#Z/擅使兵器：枪矛、扇",兵器="枪矛\n扇",门派="龙宫\n天宫\n五庄观\n凌波城"}
	self.人物列表[18] = {模型="桃夭夭",x=533,y=40,染色方案=1,介绍="桃夭柳媚梦酣眠，笑语嫣然化春风。一朝春近晴光好，清波潋滟映芳菲，桃夭夭是蟠桃园含花吐蕊的花苞，历经三千毓秀钟灵，化身一个机灵爽朗，骄憨顽皮的少女。\n#Z/擅使兵器：飘带、灯笼",兵器="飘带\n灯笼",门派="天宫\n龙宫\n普陀山\n凌波城"}

	self.创建中头像 = {}
	self.创建大头像 = {}
	self.创建人物精灵 = {}
	for n=1,18 do
		local s = qtx(self.人物列表[n].模型)
		local q = qmx(self.人物列表[n].模型,nil,根)
		local w = qzd(self.人物列表[n].模型,nil,根)
		local 大角色 = txs[self.人物列表[n].模型]
		self.创建中头像[n] = 资源:载入(s[7],"网易WDF动画",s[5])
		self.创建大头像[n] = pwd(大角色)
		self.创建人物精灵[n] = {}
		self.创建人物精灵[n]["静立"] = 资源:载入(q[3],"网易WDF动画",q[1])
		self.创建人物精灵[n]["行走"] = 资源:载入(q[3],"网易WDF动画",q[2])
		self.创建人物精灵[n]["攻击"] = 资源:载入(w[10],"网易WDF动画",w[1])
		self.创建人物精灵[n]["施法"] = 资源:载入(w[10],"网易WDF动画",w[7])
		self.人物列表[n].x = self.人物列表[n].x
		self.人物列表[n].y = self.人物列表[n].y
	end

	self.控件类 = require("ggeui/加载类")()
	local 总控件 = self.控件类:创建控件('创建控件')
	总控件:置可视(true,true)
	self.名称输入框 = 总控件:创建输入("创建输入",self.局部游戏宽度-165,self.局部游戏高度+265,120,14,根)
	self.名称输入框:置可视(false,false)
	self.名称输入框:置限制字数(12)
	self.名称输入框:置光标颜色(4294967295)
	self.名称输入框:置文字颜色(4294967295)
end

function 场景类_创建:置染色(人物ID,染色方案,染色ID,方向)
	self.创建人物精灵[人物ID]["静立"]:置染色(染色方案,染色ID,染色ID,染色ID)
	self.创建人物精灵[人物ID]["行走"]:置染色(染色方案,染色ID,染色ID,染色ID)
	self.创建人物精灵[人物ID]["攻击"]:置染色(染色方案,染色ID,染色ID,染色ID)
	self.创建人物精灵[人物ID]["施法"]:置染色(染色方案,染色ID,染色ID,染色ID)
	self:置方向(方向,人物ID)
end

function 场景类_创建:后退方向()
	if self.方向 ~= 7 then
		self.方向 = self.方向 + 1
		self:置方向(self.方向,self.选中人物)
	else
		self.方向 = 0
		self:置方向(self.方向,self.选中人物)
	end
end

function 场景类_创建:前进方向()
	if self.方向 ~= 0 then
		self.方向 = self.方向 - 1
		self:置方向(self.方向,self.选中人物)
	else
		self.方向 = 7
		self:置方向(self.方向,self.选中人物)
	end
end

function 场景类_创建:重置旋转()
	进度 = 0
	self.人开始=1
	self.仙开始=120
	self.魔开始=240
end

function 场景类_创建:显示(dt,x,y)

	引擎.置标题(全局游戏标题.." - ("..全局大分区.."["..全局小分区.."] - ".."创建角色")
	if self.选中人物 ~= 0 then
		self.创建人物精灵[self.选中人物][self.动作]:更新(dt)
	end
	self.后退一个方向:更新(x,y)
	self.前进一个方向:更新(x,y)
	self.一号染色:更新(x,y)
	self.二号染色:更新(x,y)
	self.三号染色:更新(x,y)
	self.人物站立:更新(x,y)
	self.人物奔跑:更新(x,y)
	self.人物攻击:更新(x,y)
	self.人物施法:更新(x,y)
	self.人物介绍:更新(x,y)
	self.可用兵器:更新(x,y)
	self.可选门派:更新(x,y)
	self.人物说明框上翻:更新(x,y,false)
	self.人物说明框下翻:更新(x,y,false)
	self.上一步:更新(x,y)
	self.下一步:更新(x,y)
	self.人物随机名字:更新(x,y)
	self.旋转背景:更新(x,y)
	if self.分类 == "人" and self.旋转==false then
		self.魔小:更新(x,y)
		self.仙中:更新(x,y)
		self.背景图片:更新(x,y)
	elseif self.分类 == "仙" and self.旋转==false then
		self.人小:更新(x,y)
		self.魔中:更新(x,y)
		self.背景图片仙:更新(x,y)
	elseif self.分类 == "魔" and self.旋转==false then
		self.仙小:更新(x,y)
		self.人中:更新(x,y)
		self.背景图片魔:更新(x,y)
	end
	if self.旋转==true then
		self.人小:更新(x,y)
		self.仙小:更新(x,y)
		self.魔小:更新(x,y)
		self.人中:更新(x,y)
		self.仙中:更新(x,y)
		self.魔中:更新(x,y)
	end

	if self.人小:事件判断() then
		self.开始 = 1
		self.结束 = 6
		self.分类 = "人"
		self.旋转=true
		self.选中人物 = 0
		self:重置旋转()
	elseif self.仙小:事件判断() then
		self.开始 = 13
		self.结束 = 18
		self.分类 = "仙"
		self.旋转=true
		self.选中人物 = 0
		self:重置旋转()
	elseif self.魔小:事件判断() then
		self.开始 = 7
		self.结束 = 12
		self.分类 = "魔"
		self.旋转=true
		self:重置旋转()
	elseif self.人中:事件判断() then
		self.开始 = 1
		self.结束 = 6
		self.分类 = "人"
		self.旋转=true
		self.选中人物 = 0
		self:重置旋转()
	elseif self.仙中:事件判断() then
		self.开始 = 13
		self.结束 = 18
		self.分类 = "仙"
		self.旋转=true
		self.选中人物 = 0
		self:重置旋转()
	elseif self.魔中:事件判断() then
		self.开始 = 7
		self.结束 = 12
		self.分类 = "魔"
		self.旋转=true
		self.选中人物 = 0
		self:重置旋转()
	end
	self.旋转背景:显示(0,0)
	if self.选中人物 ~= 0 then
		self.控件类:更新(dt,x,y)
		if self.后退一个方向:事件判断() then
			self:后退方向()
		elseif self.前进一个方向:事件判断() then
			self:前进方向()
		elseif self.人物站立:事件判断() then
			self.动作 = "静立"
		elseif self.人物奔跑:事件判断() then
			self.动作 = "行走"
		elseif self.人物攻击:事件判断() then
			self.动作 = "攻击"
		elseif self.人物施法:事件判断() then
			self.动作 = "施法"
		elseif self.一号染色:事件判断() then
			if self.人物列表[self.选中人物].染色方案 ~= nil then
				if self.染色ID ~= 0 then
					self.染色ID = 0
					self:置方向(0,self.选中人物)
					self:置染色(self.选中人物,self.人物列表[self.选中人物].染色方案,self.染色ID,self.方向)
				end
			else
				tp.提示:写入("#Y/该角色暂未开放染色")
			end
		elseif self.二号染色:事件判断() then
			if self.人物列表[self.选中人物].染色方案 ~= nil  then
				if self.染色ID ~= 1 then
					self.染色ID = 1
					self:置方向(0,self.选中人物)
					self:置染色(self.选中人物,self.人物列表[self.选中人物].染色方案,self.染色ID,self.方向)
				end
			else
				tp.提示:写入("#Y/该角色暂未开放染色")
			end
		elseif self.三号染色:事件判断() then
			if self.人物列表[self.选中人物].染色方案 ~= nil then
				if self.染色ID ~= 2 then
					self.染色ID = 2
					self:置方向(0,self.选中人物)
					self:置染色(self.选中人物,self.人物列表[self.选中人物].染色方案,self.染色ID,self.方向)
				end
			else
				tp.提示:写入("#Y/该角色暂未开放染色")
			end
		elseif self.人物介绍:事件判断() and self.说明框状态 ~= "人物状态" then
			self.介绍文本:清空()
			self.介绍文本:添加文本(self.人物列表[self.选中人物].介绍)
			self.说明框状态 = "人物状态"
		elseif self.可用兵器:事件判断() and self.说明框状态 ~= "可用兵器"  then
			self.介绍文本:清空()
			self.介绍文本:添加文本(self.人物列表[self.选中人物].兵器)
			self.说明框状态 = "可用兵器"
		elseif self.可选门派:事件判断() and self.说明框状态 ~= "可选门派"  then
			self.介绍文本:清空()
			self.介绍文本:添加文本(self.人物列表[self.选中人物].门派)
			self.说明框状态 = "可选门派"
		elseif self.人物随机名字:事件判断() and self.说明框状态 ~= "可选门派"  then
			local 姓 = {"小黑","小白","无名","专业打油酱","酒到微醺","北疆雨寒","放慢心跳","Θ内心d1.伤","轻音柔体萌萝莉","觅览少女","愛遇良人","余音未散","别提","爆菊无极限","夜凉若水","览觅少年","一生傲娇","欲望泯灭人性","献给清明节","青燈古酒","花开似梦","入戏太深","不会撒谎","年少不知米青仔贵","执我之手","白衣煮茶","黑白棋局","忘不了，她","半夏白色枕头","末世岛屿","携我之心","哼哈二将","对面是二傻","繁华宛似浮云","風卷著沙","纪年海泊","沉鱼落雁","Louise゛","捣你菊花","情深不寿","淚順著雨","封心锁爱","暈“噠120","苍天有井自然空","命定浮沉","慧极必伤","刹那芳华","路易絲","灬情丶落轩","清酒暖心","与情无染","情难自控","X凄凉菂羙","有飘影更自信","南巷孤貓","烈酒醉人","沦陷的痛","夜的第七章","星逝破晓","一尾流莺","北城孤人","若如初见","简单","风恋绝尘","特别的人η","一指流砂","温柔散尽","彻底完败","揍跪了丶好么","月寒影对","特别的梦η","烟花寂凉","ˉ罗密欧","沟沟有深度","绽放情花","梦暖情双","新不了情","Θ“肮脏_矜持”","你的菊花真美","墨染诗水","刺痛命脉","野性难改","內傷無法治愈","最短不过善变","青絲繞手","樱花年华","十夏之风","负心人","举杯邀月","已然情深","情字繞口","徒增伤悲","ㄨ雨℡逝ㄚ","床单一片红","清歡相伴","何惧缘浅","一拉拉","扭曲旳黑暗”","转角遇到墙","竖萧而奏","溫酒相隨","似水柔情","贱人·滚之","细雨微醺","北軌陽葵","抚琴而唱","旧事重提","ω带刺╮男淫","紫丶星河","烟过是云","南岸青梔","撕心裂肺","伸手难辨","中指的邂逅","萧暗寒剑","雨过你在","忠贞罘渝","极速ω堕落","眼兮的温柔","北港初晴","青梅落影","落荒而逃","不服来嘛","双手成就你的梦","寡人寡巷","南岸末阴","从不服输","１切都昰命▂","吟唱寒荒","凉城以北","孤人孤街","半夏时光","説不岀旳疼╮","撸自身哥哥","南館瀟湘","空城旧梦","黑白年代","∑幼稚鬼","信基哥原地复活","鱼忘七秒#","壹席青城","十言九妄","不在乎的在乎ゝ","溪舔取精","南人旧心","人忘七年#","独守空城","撕裂的天堂","今天干我儿","灯为谁点","北人久情","事与愿违","初见钟情","潇潇暮雨","彼此相爱゛","脂为谁添","南熙寒笙","師傅.別念了","蝶梦恋花","发酵的恋","っ遮遮掩掩゛","夏末染殇","地心侵略者","风泊天","琴瑟在御","茹梦初醒","沐风朝朝","炫。枫少","寒风笑雪夜","葬我以风","凤凰于飞","鱼巷猫归","抱你到天亮.","浅唱呐忧伤","闹市海港","赐你以梦","深秋无痕","╮麻辣","百合大队长","人走茶凉","旧城窄巷","回眸的笑","ε择日","一寸光阴","北葵向暖","曲终人散","少钩鈏我","为了你","一寸精","暖阳今夏","南栀倾寒","满城灯火","烈酒i","夜凉如水","这季悲凉","冷月昨秋","醉生梦死","极度深寒","淡丿子枫","深如大海i","|回身诉说","葑鈊ご独爱","各自生欢","梦冥光","追忆年华","深海溺心 i","复制回忆","在为止的路上狂奔","苏秋辰","听一首歌丶","笑叹如梦","时光不复","ω永别","碎泪","任憑風吹","念一个人丶","人亦已歌","咎由自取","幹杯清茶","不準妳走","初衷是你","阴月下的墓碑","渔舟唱晚","續杯烈酒","邀月对影","风吹屁丫爽","夜寒影对","彼岸灯火","今夕何夕","沦陷′2009"}
			local 组合 = 姓[random(1,#姓)]
			self.名称输入框:置文本(组合)
		end
	end
	if self.旋转==true then
		for i=1,10 do
			进度 = 进度 +1
			self.人开始=self.人开始+1
			self.仙开始=self.仙开始+1
			self.魔开始=self.魔开始+1
			if self.人开始  == 360 then self.人开始 =1 end
			if self.仙开始  == 360 then self.仙开始 =1 end
			if self.魔开始  == 360 then self.魔开始 =1 end
			if 进度 == 360 then
				self.旋转=false
			end
		end
		self.人小:显示(self.旋转坐标[self.人开始].x,self.旋转坐标[self.人开始].y)
		self.仙小:显示(self.旋转坐标[self.仙开始].x,self.旋转坐标[self.仙开始].y)
		self.魔小:显示(self.旋转坐标[self.魔开始].x,self.旋转坐标[self.魔开始].y)
	end
	if self.分类 == "人" and self.旋转==false then
		self.魔小:显示(16,2)
		self.仙中:显示(5,70)
		-- self.人大:显示(65,26)
		self.背景图片:显示(0,0)
	elseif self.分类 == "仙" and self.旋转==false then
		self.人小:显示(16,2)
		self.魔中:显示(5,70)
		-- self.仙大:显示(65,26)
		self.背景图片仙:显示(0,0)
	elseif self.分类 == "魔" and self.旋转==false then
		self.仙小:显示(16,2)
		self.人中:显示(5,70)
		-- self.魔大:显示(65,26)
		self.背景图片魔:显示(0,0)
	end
	for n=self.开始,self.结束 do
		self.创建中头像[n]:显示(self.人物列表[n].x,self.人物列表[n].y)
		if self.创建中头像[n]:是否选中(x,y) then
			self.选择框:更新(dt)
			self.选择框:显示(self.人物列表[n].x,self.人物列表[n].y)
			if mouseb(0) and self.选中人物 ~= n then
				self.选中人物 = n
				self.动作 = "静立"
				self.方向 = 4
				self.染色ID = 0
				if self.人物列表[self.选中人物].染色方案 ~= nil  then
					self:置染色(self.选中人物,self.人物列表[self.选中人物].染色方案,self.染色ID,self.方向)
				end
				self:置方向(self.方向,self.选中人物)
				self.介绍文本:清空()
				self.介绍文本:添加文本(self.人物列表[self.选中人物].介绍)
			end
		end
	end


	-- self.人物姓名框:显示(self.局部游戏宽度-307,self.局部游戏高度+63)
	self.后退一个方向:显示(self.局部游戏宽度+345,self.局部游戏高度+15)
	self.前进一个方向:显示(self.局部游戏宽度+230,self.局部游戏高度+15)

	self.一号染色:显示(self.局部游戏宽度+230,self.局部游戏高度+40)
	self.二号染色:显示(self.局部游戏宽度+280,self.局部游戏高度+40)
	self.三号染色:显示(self.局部游戏宽度+330,self.局部游戏高度+40)
	self.人物站立:显示(self.局部游戏宽度+200,self.局部游戏高度-150)
	self.人物随机名字:显示(self.局部游戏宽度-25,self.局部游戏高度+260)
	self.人物奔跑:显示(self.局部游戏宽度+250,self.局部游戏高度-150)
	self.人物攻击:显示(self.局部游戏宽度+300,self.局部游戏高度-150)
	self.人物施法:显示(self.局部游戏宽度+350,self.局部游戏高度-150)

	if self.选中人物 ~= 0 then
		self.控件类:显示(x,y)
		self.名称输入框:置可视(true,true)
		self.影子:显示(self.局部游戏宽度+292,self.局部游戏高度)
		self.创建人物精灵[self.选中人物][self.动作]:显示(self.局部游戏宽度+292,self.局部游戏高度)
	else
		self.名称输入框:置可视(false,false)
	end
	self.人物介绍:显示(self.局部游戏宽度+260,self.局部游戏高度+95)
	-- self.可用兵器:显示(self.局部游戏宽度+38,self.局部游戏高度+95)
	self.可选门派:显示(self.局部游戏宽度+180,self.局部游戏高度+95)
	self.上一步:显示(self.局部游戏宽度+152,self.局部游戏高度+250)
	self.下一步:显示(self.局部游戏宽度+282,self.局部游戏高度+250)
	-- self.文字创建角色:显示(self.局部游戏宽度-40,self.局部游戏高度-225)
	self.人物说明框:显示(self.局部游戏宽度+160,self.局部游戏高度+126)
	if self.选中人物 ~= 0 then
		self.创建大头像[self.选中人物]:显示(self.局部游戏宽度-420,self.局部游戏高度-250)
		self.介绍文本:显示(self.局部游戏宽度+163,self.局部游戏高度+129)
	end
	self.人物说明框上翻:显示(self.局部游戏宽度+411,self.局部游戏高度+129)
	self.人物说明框下翻:显示(self.局部游戏宽度+411,self.局部游戏高度+186)
	-- self.测试人物:显示(0,0)
	if self.上一步:事件判断() then
		self.选中人物 = 0
		self.动作 = "静立"
		self.方向 = 4
		self.染色ID = 0
		self.说明框状态 = "人物状态"
		self.介绍文本:清空()
		self.名称输入框:置可视(false,false)
		tp.进程 = 2
	elseif self.下一步:事件判断() then
      if self.选中人物 == 0 then
        tp.提示:写入("#Y/请选择一个人物进入游戏")
      else

      	---elseif string.find(self.名称输入框:取文本(), "/") ~= nil then
		--self.数据.名称 = "3名字" .. self.数据.id


        if     string.find(self.名称输入框:取文本(), "#") ~= nil or string.find(self.名称输入框:取文本(),"/")~= nil
        	or string.find(self.名称输入框:取文本(), "@") ~= nil or string.find(self.名称输入框:取文本(),"*")~= nil
        	or string.find(self.名称输入框:取文本(), " ") ~= nil or string.find(self.名称输入框:取文本(),"~")~= nil
        	or string.find(self.名称输入框:取文本(), "GM") ~= nil or string.find(self.名称输入框:取文本(),"gm")~= nil
        	or string.find(self.名称输入框:取文本(), "	") ~= nil or string.find(self.名称输入框:取文本(),"充值")~= nil
        	or string.find(self.名称输入框:取文本(), "游戏管理员") ~= nil or string.find(self.名称输入框:取文本(),"·")~= nil
        	or self.名称输入框:取文本() == "" then
            tp.提示:写入("#Y/名字不能含有敏感字符")
        else
          if #self.名称输入框:取文本()<15 then
            客户端:发送数据(3,self.人物列表[self.选中人物].模型..fgf..self.名称输入框:取文本()..fgf..self.染色ID)
            self.名称输入框:置文本("")
          else
              tp.提示:写入("#Y/角色的名字太长了。")
          end
        end
      end
	end
end

return 场景类_创建