--======================================================================--

场景类_标题说明=[[                         #95#R更新公告#85

#G/亲爱的玩家朋友：                                     #S/(当前版本:]]..版本..[[)]]..

[[

    #G此版本为现阶段市面上非常好的挂机版本,秒杀所有的飞蛾版本，内容最多玩法最多！！大家可以叫上你的亲朋好友前来体验。

#R最新更新：

#G★★★★★★★ 2020.09.19★★★★★★★

#G★增加14个官方同步新宠物

#G★月魅 神猪 神狗 飞天 谛听 等等14个新造型

#G★增加蚩尤BUFF，分两个级别 低级蚩尤和高级蚩尤

#G★增加助战可以携带宠物，真正意义单开玩通关

#G★增加攻城战，奖励丰厚，并且攻下长安城的帮派可以获得三个特殊称谓，增加属性

#G★增加 化圣 小鸟伏特加 成神 无情哈拉少 化神 顶级玩法

#G★修复：人物和宠物修炼 法宝灵气

#G★★★★★★★ 2020.09.16★★★★★★★

#G★修复所有锦衣和坐骑显示问题

#G★增加坐骑染色

#G★增加炫彩染色

#G★增加助战可以携带宠物，真正意义单开玩通关

#G★增加攻城战，奖励丰厚，并且攻下长安城的帮派可以获得三个特殊称谓，增加属性

#G★增加 化圣 小鸟伏特加 成神 无情哈拉少 化神 顶级玩法

#G★修复：人物和宠物修炼 法宝灵气

#G★★★★★★★ 2020.09.07★★★★★★★

#G★全新稳定挂机版本

#G★全新宝宝套装系统

#G★全服经验提升系统

#G★坐骑增加移动速度提升

#G★强化技能增加战斗速度



]]