--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:30
--======================================================================--
function 引擎.主线剧情解析(剧情章节,剧情ID)
	local msg = {}
	--local txt = {{"模型","对话","选项"},{"模型","对话","选项"},{"模型","对话","选项"},{"模型","对话","选项"}} -- 可拓展的对话事件
	-- msg[4] = {{"姜暮烟",10,10,}} -- 数组元素说明：名称，模型，x坐标，y坐标（坐标不与屏幕坐标牵扯），武器，染色方式（数组），方向，编号
	-- msg参数：1为对话内容集合，2为行为指令（可空），3为音乐播放（可空），4为视频播放（可空）
	local mx = 引擎.场景.队伍[1].模型
	local mc = 引擎.场景.队伍[1].名称
	local rs = 引擎.场景.队伍[1].染色方案
	local rz = 引擎.场景.队伍[1].染色组
	if 剧情章节 == 1 then
		local txt = {nil,{mx,mc,"头好痛啊！..这是在哪，我不是应该在求职的路上么？难道我穿越了？？#24"},{mx,mc,"先四处转一转吧..找个人问问...#3"},{mx,mc,"喂~老伯~那个"},
		{"男人_村长","老伯","年轻人..看你天赋异禀..将来必成大器..我这里有4张藏宝图就送给你好了....哈哈哈哈"},{mx,mc,"神仙啊..藏宝图！...我要成为百万富翁...走向人生巅峰...迎娶百富美了吗...#89"},
		{nil,nil,"将等级提高到10级左右去东海海底坐标0,0附近触发剧情，否则不能触发；\n建邺衙门内对的Npc贸易总管可以自由招募队员进行剧情，剧情内人物可入队，如队伍人满则存入仓库（右键关闭剧情对话）"}
		}
		msg[1] = txt
		--msg[3] = {{"1028x2024",1}}
		msg[5] = {{mc,mx,40,13,nil,{rs,rz},4,1},{"老伯","男人_村长",58,31,nil,nil,2}}
		msg[6] = {
		{[[引擎.场景.剧情处理:置随机方向组({1},{{5,6,7,4},45})]],1},{[[引擎.场景.剧情处理:置中断时间(200)]],1},{[[引擎.场景.剧情处理:置剧情跳转(1)]],1},
		{[[引擎.场景.剧情处理:置中断时间(200)]],4},{[[引擎.场景.剧情处理:置目标(1,{53,28})]],4},
		{[[引擎.场景.剧情处理:加入任务("主线剧情","将等级提高到10级之后前往东海海底0,0附近触发剧情")]],5}
	}
	elseif 剧情章节 == 2 then
	elseif 剧情章节 == 3 then
	elseif 剧情章节 == 4 then
	elseif 剧情章节 == 5 then
	elseif 剧情章节 == 6 then
	elseif 剧情章节 == 7 then
	elseif 剧情章节 == 8 then
	elseif 剧情章节 == 9 then
	elseif 剧情章节 == 10 then
	elseif 剧情章节 == 11 then
	elseif 剧情章节 == 12 then
	elseif 剧情章节 == 13 then
	elseif 剧情章节 == 14 then
	elseif 剧情章节 == 15 then
	elseif 剧情章节 == 16 then
	elseif 剧情章节 == 17 then
	elseif 剧情章节 == 18 then
	elseif 剧情章节 == 19 then
	elseif 剧情章节 == 20 then
	elseif 剧情章节 == 21 then
	elseif 剧情章节 == 22 then
	elseif 剧情章节 == 23 then
	elseif 剧情章节 == 24 then
	elseif 剧情章节 == 25 then
	elseif 剧情章节 == 26 then
	end
	return msg
end