--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:30
--======================================================================--
local floor = math.floor
local ceil =  math.ceil
local tp = 引擎.场景
local random = 引擎.取随机整数
local insert = table.insert
function 引擎.保卫长安事件(名称,编号,模型,特殊,组合)
	if tp.剧情开关.保卫长安[1] == "鬼王密信" then
		tp.窗口.对话栏:文本(tp.队伍[1].模型,tp.队伍[1].名称,"住手！#4")
		tp.窗口.对话栏:文本(模型,名称,"你这小娃娃是谁，别找死#24",{"少吓唬人，看招","我走错地方了"},{"保卫长安",名称,编号,模型})
	elseif tp.剧情开关.保卫长安[1] == "无尽梦魇" then
		if  tp.剧情开关.保卫长安[2] == 7 then
			tp.窗口.对话栏:文本("将军1","幻境接引人","你要回去长安吗",{"送我回去吧","我点错了"},{"保卫长安",名称,编号,模型})
		else
			引擎.保卫长安战斗(名称,编号,模型,特殊,组合)
		end
	end
end

function 引擎.保卫长安战斗(名称,编号,模型,特殊,组合)
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	local 最终 = {}
	平均等级 = floor(平均等级 / 数量)
	local 等级 = 平均等级+20
	local gl = random(1,10)
	if tp.剧情开关.保卫长安[1] == "鬼王密信" then
		local mxs = {"牛头","马面","野鬼","骷髅怪","僵尸"}
		属性表 = {}
		体力资质 = 3000
		防御资质 = 1500
		攻击资质 = 1500
		速度资质 = 1000
		法力资质 = 2500
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for n=2,7 do
			local jns = {"高级连击"}
			if random(1,10) <= 4 then
				insert(jns,"惊心一剑")
			end
			最终[n] = {"喽啰",mxs[random(1,#mxs)],等级,2,0,0,0,0,0,0,-1,nil,nil,jns,true,nil,10000,属性表}
		end
		if tp.剧情开关.保卫长安[2] == 1 then
			属性表 = {}
			体力资质 = 5000
			防御资质 = 1500
			攻击资质 = 1000
			速度资质 = 2000
			法力资质 = 2800
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
			local mps = {4,12,8}
			local tbs = tp:取门派主技能(mps[random(1,3)])
			insert(tbs,"高级反震")
			insert(tbs,"高级防御")
			最终[1] = {名称,"吸血鬼",等级,2,0,0,0,0,0,0,-1,96,{1,1},tbs,true,true,10000,属性表}
			tp.场景.战斗:写入({{"吸血鬼","六道轮回吸血鬼","受死吧！"}})
		elseif tp.剧情开关.保卫长安[2] == 2 then
			属性表 = {}
			体力资质 = 6500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 2000
			法力资质 = 2800
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级*1.6)*1.2)
			local mps = {1,11,14}
			local tbs = tp:取门派主技能(mps[random(1,3)])
			insert(tbs,"高级反震")
			insert(tbs,"高级敏捷")
			最终[1] = {名称,"幽灵",等级,2,0,0,0,0,0,0,-1,97,{1,0},tbs,true,true,10000,属性表}
			tp.场景.战斗:写入({{"幽灵","六道轮回幽灵","受死吧！"}})
		elseif tp.剧情开关.保卫长安[2] == 3 then
			属性表 = {}
			体力资质 = 5000
			防御资质 = 1000
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6)*1.2)
			local mps = {3,9,11,15}
			local tbs = tp:取门派主技能(mps[random(1,3)])
			insert(tbs,"高级魔之心")
			insert(tbs,"高级法术暴击")
			最终[1] = {名称,"画魂",等级,2,0,0,0,0,0,0,-1,20113,{4,0},tbs,true,true,10000,属性表}
			tp.场景.战斗:写入({{"画魂","六道轮回画魂","受死吧！"}})
		elseif tp.剧情开关.保卫长安[2] == 4 then
			属性表 = {}
			体力资质 = 6500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 2000
			法力资质 = 2800
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级*1.6)*1.2)
			local mps = {6,2,7}
			local tbs = tp:取门派主技能(mps[random(1,3)])
			insert(tbs,"高级反震")
			insert(tbs,"高级敏捷")
			最终[1] = {名称,"幽萤娃娃",等级,2,0,0,0,0,0,0,-1,20113,{4,0},tbs,true,true,10000,属性表}
			tp.场景.战斗:写入({{"幽萤娃娃","六道轮回幽萤娃娃","受死吧！"}})
		elseif tp.剧情开关.保卫长安[2] == 5 then
			属性表 = {}
			体力资质 = 5000
			防御资质 = 1000
			攻击资质 = 2000
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级*1.5)*2)
			属性表[4] = ceil(平均等级*2.5+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级+等级)
			local mps = {5,10,13}
			local tbs = tp:取门派主技能(mps[random(1,3)])
			insert(tbs,"高级强力")
			insert(tbs,"高级偷袭")
			最终[1] = {名称,"鬼将",等级,2,0,0,0,0,0,0,-1,95,{1,0},tbs,true,true,10000,属性表}
			tp.场景.战斗:写入({{"鬼将","六道轮回鬼将","受死吧！"}})
		end
		tp.场景.战斗:进入战斗(最终,{[1]="保卫长安",[2]=名称,[3]=模型})
	elseif tp.剧情开关.保卫长安[1] == "无尽梦魇" then
		if tp.剧情开关.保卫长安[2] <= 3 then
			if 特殊 == nil then
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1000
				法力资质 = 2000
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*10)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				for n=1,7 do
					local a = 组合[random(1,#组合)]
					local b = nil
					if a == "金身罗汉" then
						b = true
					end
					最终[n] = {"梦魇"..a,a,等级,2,0,0,0,0,0,0,-1,nil,nil,{"奔雷咒","水漫金山","高级魔之心","高级强力","剑荡四方","惊心一剑"},nil,b,10000,属性表}
				end
			else
			    属性表 = {}
				体力资质 = 5000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 2000
				法力资质 = 3200
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*3)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级*2)*2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
				最终[1] = {"无尽梦魇","蜃气妖",等级,2,0,0,0,0,0,0,-1,nil,nil,tp:取门派主技能(random(1,15)),nil,true,10000,属性表}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1000
				法力资质 = 2000
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*10)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				for n=2,10 do
					local a = 组合[random(1,#组合)]
					local b = nil
					if a == "金身罗汉" then
						b = true
					end
					最终[n] = {"梦魇"..a,a,等级,2,0,0,0,0,0,0,-1,nil,nil,{"奔雷咒","水漫金山","高级魔之心","高级强力","剑荡四方","惊心一剑"},nil,b,10000,属性表}
				end
			end
		elseif tp.剧情开关.保卫长安[2] > 3 then
			if 特殊 == nil then
				属性表 = {}
				体力资质 = 3500
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*13)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级*1.6)*2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				for n=1,7 do
					local a = 组合[random(1,#组合)]
					local b = nil
					if a == "金身罗汉" then
						b = true
					end
					最终[n] = {"梦魇"..a,a,等级,2,0,0,0,0,0,0,-1,nil,nil,{"奔雷咒","水漫金山","高级魔之心","高级强力","嗜血追击","惊心一剑"},nil,b,10000,属性表}
				end
			else
			    属性表 = {}
				体力资质 = 5500
				防御资质 = 1200
				攻击资质 = 1700
				速度资质 = 1800
				法力资质 = 3400
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*3)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
				最终[1] = {"无尽梦魇","蜃气妖",等级,2,0,0,0,0,0,0,-1,nil,nil,tp:取门派主技能(random(1,15)),nil,true,10000,属性表}
				属性表 = {}
				体力资质 = 3500
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*13)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级*1.6)*2)
				属性表[4] = ceil(平均等级*2.5+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				for n=2,10 do
					local a = 组合[random(1,#组合)]
					local b = nil
					if a == "金身罗汉" then
						b = true
					end
					最终[n] = {"梦魇"..a,a,等级,2,0,0,0,0,0,0,-1,nil,nil,{"奔雷咒","水漫金山","高级魔之心","高级强力","剑荡四方","惊心一剑"},nil,b,10000,属性表}
				end
			end
		end
		tp.场景.战斗:进入战斗(最终,{[1]="保卫长安",[2]=名称,[3]=模型,[4]=编号,[5]=特殊})
	end
end