--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
function 引擎.副本剧情解析(剧情章节,剧情ID)
	local msg = {}
	local mx = 引擎.场景.队伍[1].模型
	local mc = 引擎.场景.队伍[1].名称
	if 剧情章节 == "通天河" then
		-- 第3个内容详细说明：为灰色头像和加入头像，ID为数组成员{}，数组成员1表示要灰色的头像，nil则表示不灰色，2为要加入的头像，比如自己的头像
		local txt = {
			{"唐僧","唐僧",nil,"徒弟们，这通天河水果然淘淘，又无舟楫，怎渡的过？为师腹中饥饿难捱，先化顿斋饭，寻个船家再渡河的是。"},
			{"孙悟空","孙悟空",{1,2},"若俺老孙，扭一扭腰也就过去了，若携着师傅过去，那佛祖定要怪我师徒取经心不诚，可也烦恼！"},
			{"猪八戒","猪八戒",{nil,2},"师傅你看，前面有庄户人家，做的好大法事道场，必有斋僧布施。佛菩萨保佑，这斋饭来的倒容易。"},
			{"唐僧","唐僧",{2,1},"果真是好大法事，那最前有位老人家，徒儿们我们去寻他化点斋饭来。"},
			{"男人_村长","唐僧",{2,1},"果真是好大法事，那最前有位老人家，徒儿们我们去寻他化点斋饭来。"},
		}
		msg[6] = {
			{[[引擎.场景.剧情处理.黑条显示方式 = 2]],5},{[[引擎.场景.剧情开始 = false]],5},{[[引擎.场景.剧情处理:屏幕移动(103,95,10)]],5},{[[引擎.场景.剧情处理:置中断时间(800)]],5}
		}
		msg[1] = txt
	elseif 剧情章节 == "大闹天宫" then
		local txt = {
			{"福星","福星",nil,"我乃蟠桃园力士总管，大圣此番前来有何贵干？"},
			{mx,mc,{1,2},"我奉玉帝钦点看管这蟠桃园，今特来查勘，有什么需要我帮忙的么#43"},
			{"福星","福星",nil,"园中确有事务需要大圣打理。由于此园已许久未曾修葺，而蟠桃盛会将至，因此园中的锄数力士、运水力士和修桃力士近日一直忙碌终日，苦不堪言！大圣若有闲暇，可先去助他们一臂之力#47"},
			{mx,mc,{1,2},"正好我也许久未曾活动筋骨了，就让我去瞅瞅吧！"},
		}
		msg[1] = txt
		msg[6] = {
			{[[引擎.场景.剧情处理.黑条显示方式 = 2]],5},{[[引擎.场景.剧情开始 = false]],5}
		}
	elseif 剧情章节 == 3 then
	elseif 剧情章节 == 4 then
	elseif 剧情章节 == 5 then
	elseif 剧情章节 == 6 then
	elseif 剧情章节 == 7 then
	elseif 剧情章节 == 8 then
	elseif 剧情章节 == 9 then
	elseif 剧情章节 == 10 then
	elseif 剧情章节 == 11 then
	elseif 剧情章节 == 12 then
	elseif 剧情章节 == 13 then
	elseif 剧情章节 == 14 then
	elseif 剧情章节 == 15 then
	elseif 剧情章节 == 16 then
	elseif 剧情章节 == 17 then
	elseif 剧情章节 == 18 then
	elseif 剧情章节 == 19 then
	elseif 剧情章节 == 20 then
	elseif 剧情章节 == 21 then
	elseif 剧情章节 == 21 then
	end
	return msg
end