--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-05-08 16:30:24
--======================================================================--
local floor = math.floor
local ceil = math.ceil
local tp = 引擎.场景
local format = string.format
local random = 引擎.取随机整数

function 引擎.副本事件(名称,模型,编号)
	if tp.剧情开关.副本 == false then
		return false
	end
	if tp.剧情开关.副本[1] == "乌鸡国" then
		if tp.剧情开关.副本[2] == 1 then
			引擎.副本战斗(名称,模型,编号)
		elseif tp.剧情开关.副本[2] == 2 then
			tp.窗口.对话栏:文本("和尚3","热心仙人","人间风景果然比天上大不同。眼前这些人看起来满怀心事，不知道老夫可否帮上什么忙#55",{"我们要掀起这块石板，请您帮忙。","我点错了"},{编号})
		elseif tp.剧情开关.副本[2] == 3 then
			if 名称 == "乌鸡国王" then
				if tp.剧情开关.副本[4][3] < 5 then
					tp.窗口.对话栏:文本("男人_老伯","乌鸡国王","请为我清除场景内的荆棘丛吧")
				else
					tp.窗口.对话栏:文本("男人_老伯","乌鸡国王","我要回宫和妖精对质，大家一起吗？",{"大家一起去","我还是算了"},{"副本"})
				end
			else
				引擎.副本战斗(名称,模型,编号)
			end
		elseif tp.剧情开关.副本[2] == 4 then
			local gl = random(1,3)
			local wb = {{"你说你像云，自在漂浮才美丽。我终于相信，囚犯的渴望有时很动听",{"我要让这些神仙的渴望变成现实","好熟悉……轻轻的我又走了"}},{"你是谁？离这里远点！",{"妖怪莫要嚣张，我来收拾你","我这就走，这就走"}},{"我好饿，你的肉好吃吗……",{"哼，少废话，看打！","啊，我很久没有洗澡了，我跑！"}}}
			tp.窗口.对话栏:文本("树怪",名称,wb[gl][1],wb[gl][2],{"副本",模型,编号})
		elseif tp.剧情开关.副本[2] == 5 then
			if 名称 ~= "鬼祟小妖" then
				if 名称 == "观音大士" then
					tp.窗口.对话栏:文本("观音姐姐","观音大士","我乃南海观世音，为度厄而来，尔等若要帮助乌鸡国王，需要找来九件玲珑",{"我找到玲珑了","我点错了"},{"副本",模型,编号})
				else
					tp.窗口.对话栏:文本("男人_老伯","乌鸡国王","怎么样才能分辨出妖怪呢？不知观音大士有什么办法")
				end
			else
				引擎.副本战斗(名称,模型,编号)
			end
		elseif tp.剧情开关.副本[2] == 6 then
			if 名称 == "观音大士" then
				tp.窗口.对话栏:文本("观音姐姐","观音大士","妖精已经露出了真面目，速将其收伏")
			elseif 名称 == "乌鸡国王" then
				tp.窗口.对话栏:文本("男人_老伯","乌鸡国王","朕的子民们现在还好吗？#14")
			else
				引擎.副本战斗(名称,模型,编号)
			end
		elseif tp.剧情开关.副本[2] == 7 then
			if 名称 == "观音大士" then
				tp.窗口.对话栏:文本("观音姐姐","观音大士","乌鸡国的事情终于告一段落了，我送你回长安吧。",{"送我回去吧","在等等"},{"副本"})
			end
		end
	elseif tp.剧情开关.副本[1] == "车迟斗法" then
		if tp.剧情开关.副本[2] == 1 then
			if 模型 == "男人_道士" then
				local ccc = 引擎.题库("自由")
				tp.窗口.对话栏:文本("男人_道士","有个道士",ccc[1],ccc[2],{"答题","车迟国",编号,ccc[3]})
			elseif 模型 == "道观" then
				tp.窗口.对话栏:文本(nil,nil,"请选择你要做的事情",{"上交材料","查看建设进度"},{"副本"})
			end
		elseif tp.剧情开关.副本[2] == 2 then
			tp.窗口.对话栏:文本("和尚2","有个和尚","大侠协助我等建设道观，全寺上下不甚感激。")
			tp.窗口.对话栏:文本(tp.队伍[1].模型,tp.队伍[1].名称,"大师言重，可那三道士究竟什么来头，如此狂妄？")
			tp.窗口.对话栏:文本("和尚2","有个和尚","这就不知了，只知他们三人神通广大，国王亦认为和尚无用，从此大兴道教，近些日子来，我寺杳无人烟，香火供品纷纷兴旺道观。哀哉哀哉！")
			tp.窗口.对话栏:文本(tp.队伍[1].模型,tp.队伍[1].名称,"岂有此理！这是什么道理，自古佛道并存，同亦不同，不同亦同。岂有灭佛兴道之理？我等得看看那三道士什么来头？！我这就号召兄弟们先来搞它个360度的大捣乱！",nil,"车迟国")
		elseif tp.剧情开关.副本[2] == 3 then
			if 编号 >= 1 then
				tp.窗口.对话栏:文本("泡泡",名称,"我就是供品，你们想做什么？",{"我来吃掉你","我吃饱了，放你一马"},{"副本",名称,模型,编号})
			end
		elseif tp.剧情开关.副本[2] == 4 then
			tp.窗口.对话栏:文本("和尚2","有个和尚","阿弥陀佛，善哉善哉！少侠真是顽皮，顽皮就好，可不要造酿祸端！老衲这就引你们前往大殿，了解情况即可，切记不可冲动啊！",nil,"车迟国")
		elseif tp.剧情开关.副本[2] == 5 then
			if tp.剧情开关.副本[4][4] < 3 then
				tp.窗口.对话栏:文本(nil,nil,"尔等何人？",{"神像，得罪了","我点错了"},{"副本"})
			else
				tp.窗口.对话栏:文本("男人_道童","道童","大胆狂徒！胆敢在三清大殿撒野，待我师傅前来收拾尔等！",nil,nil)
				tp.窗口.对话栏:文本(tp.队伍[1].模型,tp.队伍[1].名称,"哪里来的小屁孩！口出狂言，看我们这就去收拾你师傅，看他们还敢如此狂妄！",nil,"车迟国")
			end
		elseif tp.剧情开关.副本[2] == 6 then
			if tp.剧情开关.副本[4][5] == 0 then
				tp.窗口.对话栏:文本("南极仙翁","有个神仙","什么风把少侠吹到天上来看老夫？来来来，许久没研究棋局，我们先来杀它个九九八十一回。")
				tp.窗口.对话栏:文本(tp.队伍[1].模型,tp.队伍[1].名称,"老神仙，今日可没空跟您研究下棋，车迟国的三个妖道蛊惑了风雨雷电四神，我可忙着呢，我可得去阻止四仙为虎作伥，解放车迟国那群受苦受难的和尚呀！")
				tp.窗口.对话栏:文本("南极仙翁","有个神仙","还有这档子事？怪不得风婆、雨师和雷公一早就在哪里劈里啪啦地施法，少侠速速前往阻止！",nil,"车迟国")
			elseif tp.剧情开关.副本[4][5] == 1 or tp.剧情开关.副本[4][5] == 2 then
				引擎.副本战斗(名称,模型,编号)
			elseif tp.剧情开关.副本[4][5] == 3 then
				if 名称 == "有个和尚" then
					tp.窗口.对话栏:文本("和尚2","有个和尚","谢谢少侠的帮助，我送你回长安吧。",{"送我回去吧","在等等"},{"副本"})
				elseif 名称 == "有个神仙" then
					return false
				else
					tp.窗口.对话栏:文本(nil,nil,"你要领取奖励吗？",{"是的","我点错了"},{"副本",编号})
				end
			end
		end
	elseif tp.剧情开关.副本[1] == "水陆大会" then
		if tp.剧情开关.副本[2] == 1 or tp.剧情开关.副本[2] == 2 then
			if 名称 == "道场督僧" then
				tp.窗口.对话栏:文本("空度禅师","道场督僧","老衲受唐王所托，在此协助玄奘大师修筑道场讲法，望众有志之士可来助一臂之力，凡出力者均论功行赏。",{"大师，请问现在有什么事情是缺人手做的","看流星耶..当我没来过"},{"副本"})
			elseif 名称 == "桃树" then
				if random(1,10) > 5 then
					引擎.副本奖励()
					tp.窗口.对话栏:文本(nil,nil,"噔噔噔..道场督僧很是满意的砍下了几捆桃木。")
					tp.剧情开关.副本[4][1] = tp.剧情开关.副本[4][1] + 1
					if tp.剧情开关.副本[4][1] < 10 then
						tp.窗口.任务栏:修改内容("副本任务",format("道场还缺些木材，你速去道场后院100,19处，采集一些桃木\n#L/完成度：%d/10",tp.剧情开关.副本[4][1]))
					else
						tp.剧情开关.副本[2] = 3
						tp.假人库:生成副本Npc()
						tp.提示:写入("#Y/【道场督僧】：感谢齐心协力帮忙，道场准备工作已经完成。唐王向来怀有佛心，良辰吉日，已与众臣到场等待玄奘开坛讲法。")
						tp.窗口.任务栏:修改内容("副本任务","和大家一起等待玄奘法师开坛讲法吧")
					end
				else
					引擎.副本战斗(名称,模型,编号)
				end
			end
		elseif tp.剧情开关.副本[2] == 4 then
			if 名称 == "受伤的程咬金" then
				tp.窗口.对话栏:文本("程咬金","受伤的程咬金","呃……这些畜生好是厉害，竟把我伤着。玄奘法师正准备颂经时，突然天色大变，狂风滚滚，杀出十几个妖邪，最可怕的是有一个妖邪半空闪出，九尺长且有着茶盏大小的双眼，呼啦的张开了大嘴，把大家卷了去。黑云好像往寺后院飘去。老夫冒死相拼还是没救下唐王！！快！快！唐王和玄奘法师均被这妖孽掳去。我伤势太重了，有劳诸位了。")
				tp.剧情开关.副本[4][1] = 0
				tp.窗口.任务栏:修改内容("副本任务",format("原来妖魔把唐王和玄奘法师掳走了，听程咬金将军说后院似乎有妖魔的踪影\n#L/完成度：%d/2",tp.剧情开关.副本[4][1]))
				tp.剧情开关.副本[2] = 5
				tp.假人库:生成副本Npc()
			end
		elseif tp.剧情开关.副本[2] == 5 then
			if 名称 == "翼虎将军" or 名称 == "翼蛇将军" then
				tp.窗口.对话栏:文本(模型,名称,"哈哈，两位大王真是勇猛，对抗碧元君仙子需要灵物来提升修罗之力，虽说蟠桃有次食之功效，但天庭守卫森严，可苦了咱哥几个#52。哈哈！实没想到大唐举水陆大会之人就是玄奘，得来全不费功夫啊，这玄奘乃极乐中降来投胎的佛子—金蝉子，十世修行的原体，食其一块肉，长寿长生。食其肉将极大增加修罗之力，可助于我们哥几个对抗碧霞元君仙子，让我们的蚩尤大人复活。")
				tp.窗口.对话栏:文本(模型,名称,"嗯？！你们竟敢偷听，爷几个今天高兴，姑且放过你们。",{"呔！你们竟敢将唐王和玄奘大师掳走，看招！","是是是，我们这叫走"},{"副本",名称,模型,编号})
			elseif 名称 == "受伤的程咬金" then
				tp.窗口.对话栏:文本("程咬金","受伤的程咬金","快！快！快去救唐王和玄奘法师！")
			end
		elseif tp.剧情开关.副本[2] == 6 then
			if 名称 == "受伤的程咬金" then
				tp.窗口.对话栏:文本("程咬金","受伤的程咬金","快！快！快去救唐王和玄奘法师！")
			elseif 名称 == "土地公公" then
				tp.窗口.对话栏:文本("男人_土地","土地公公","我可以送你去妖魔巢穴，你要过去吗",{"是的我要去","看流星耶..当我没来过"},{"副本","水陆大会"})
			end
		elseif tp.剧情开关.副本[2] == 7 then
			引擎.副本战斗(名称,模型,编号)
		elseif tp.剧情开关.副本[2] == 8 then
			tp.窗口.对话栏:文本("帮派妖兽","魍魉","居然给你们找到了这里，既然来了，那就别走了！",{"放了唐王和玄奘法师！","看流星耶..当我没来过"},{"副本","水陆大会",名称,模型,编号})
		end
	elseif tp.剧情开关.副本[1] == "通天河" then
	elseif tp.剧情开关.副本[1] == "黑风山" then
		if tp.剧情开关.副本[2] == 1 then
			if 名称 == "玄奘" then
				tp.窗口.对话栏:文本("唐僧","玄奘",format("施主可否帮我抄写佛经，以便张贴布置灵堂？（剩余%d次）",5-tp.剧情开关.副本[4][1]),{"好啊，就让法师看看我飘逸的字体吧","不要了，我怕墨水沾到新染的衣服上"},{"副本"})
			elseif 名称 == "镇山太保刘伯钦" then
				tp.窗口.对话栏:文本("男人_镖头","镇山太保刘伯钦",format("肉多香啊，那法师偏要吃斋，我娘叫我去摘菜，可是我一闻到菜味就腿软，你能帮我么？（剩余%d次)",5-tp.剧情开关.副本[4][2]),{"这个任务简单，我去啦","我也不爱吃青菜"},{"副本"})
			elseif 名称 == "婆婆" then
				tp.窗口.对话栏:文本("女人_孟婆","婆婆",format("咳咳，老身腿脚不便，小侠能否帮忙打扫房间招待贵客？%d次)",5-tp.剧情开关.副本[4][3]),{"婆婆您坐好，我这就去","我最近也腿疼，不去了"},{"副本"})
			end
		end
	elseif tp.剧情开关.副本[1] == "大闹天宫" then
	end
end

function 引擎.副本奖励(数量)
	if tp.剧情开关.副本 == false then
		return false
	end
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	local 最终 = {}
	local jy = 0
	local jq = 0
	平均等级 = floor(平均等级 / 数量)
	if tp.剧情开关.副本[1] == "乌鸡国" then
		if tp.剧情开关.副本[2] == 1 then
			jy = floor(平均等级*551+平均等级*平均等级)
			jq = floor(平均等级*150+(平均等级+10)*(平均等级-10))
		elseif tp.剧情开关.副本[2] == 2 then
			jy = floor((平均等级*551+平均等级*平均等级)/2)
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10))/2)
		elseif tp.剧情开关.副本[2] == 3 then
			jy = floor((平均等级*551+平均等级*平均等级)*0.8)
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10))*0.8)
		elseif tp.剧情开关.副本[2] == 4 then
			jy = floor((平均等级*551+平均等级*平均等级))
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10))*1.2)
		elseif tp.剧情开关.副本[2] == 6 then
			jy = floor((平均等级*551+平均等级*平均等级)*2)
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10))*3)
		end
	elseif tp.剧情开关.副本[1] == "车迟斗法" then
		if tp.剧情开关.副本[2] == 1 then
			if 数量 == nil then
				数量 = 1
			end
			for i=1,数量 do
				jy = jy + floor((平均等级*451+平均等级*平均等级)/2)
				jq = jq + floor((平均等级*100+(平均等级+10)*(平均等级-10)))
			end
		elseif tp.剧情开关.副本[2] == 3 then
			jy = floor((平均等级*551+平均等级*平均等级))
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10)))
		elseif tp.剧情开关.副本[2] == 5 then
			jy = floor((平均等级*551+平均等级*平均等级)*1.5)
			jq = floor((平均等级*200+(平均等级+10)*(平均等级-10)))
		elseif tp.剧情开关.副本[2] == 6 then
			if tp.剧情开关.副本[4][5] == 1 then
				jy = floor((平均等级*551+平均等级*平均等级)*2)
				jq = floor((平均等级*250+(平均等级+10)*(平均等级-10)))
			elseif tp.剧情开关.副本[4][5] == 2 then
				jy = floor((平均等级*551+平均等级*平均等级)*3)
				jq = floor((平均等级*300+(平均等级+10)*(平均等级-10)))
			elseif tp.剧情开关.副本[4][5] == 3 then
				jy = floor((平均等级*551+平均等级*平均等级))
				jq = 1
			end
		end
	elseif tp.剧情开关.副本[1] == "水陆大会" then
		if tp.剧情开关.副本[2] == 2 then
			jy = floor((平均等级*551+平均等级*平均等级)/2)
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10))/2)
		elseif tp.剧情开关.副本[2] == 5 then
			jy = floor((平均等级*551+平均等级*平均等级)*1.2)
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10)))
		elseif tp.剧情开关.副本[2] == 7 then
			jy = floor((平均等级*551+平均等级*平均等级))
			jq = floor((平均等级*150+(平均等级+10)*(平均等级-10)))
		end
	end
	tp.提示:写入(format("#Y/你获得了%d经验，%d金钱，%d储备金",jy,jq,floor(jq*2)))
	tp:增加经验(jy)
	tp.金钱 = tp.金钱 + jq
end

function 引擎.副本战斗(名称,模型,编号)
	if tp.剧情开关.副本 == false then
		return false
	end
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	local 最终 = {}
	local boss = nil
	平均等级 = floor(平均等级 / 数量)
	local 等级 = tp:取进制等级(平均等级)+20
	if tp.剧情开关.副本[1] == "乌鸡国" then
		if tp.剧情开关.副本[2] == 1 then
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
			local 主怪 = {名称,模型,等级,2,0,0,0,0,0,0,-1,56,{1},{"高级反震"},true,nil,10000,属性表}
			最终[1] = 主怪
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2000
			属性表 = {}
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
			for n=2,6 do
				最终[n] = {"伙伴木妖",模型,等级,2,0,0,0,0,0,0,-1,nil,nil,{},true,nil,10000,属性表}
			end
			tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号})
		elseif tp.剧情开关.副本[2] == 3 then
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 3500
			属性表 = {}
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6))
			local gl = random(1,3)
			local mp = {}
			if gl == 1 then
				mp = {"飞砂走石","三昧真火"}
			elseif gl == 2 then
				mp = {"龙卷雨击","龙吟","龙腾"}
			elseif gl == 3 then
				mp = {"落叶萧萧","冰川怒","血雨"}
			end
			最终[1] = {"荆棘丛","花妖",等级,2,0,0,0,0,0,0,-1,nil,nil,mp,true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级*2+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级+等级)
			最终[2] = {"大力荆棘","羊头怪",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级反震","高级强力","高级必杀"},true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3500
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6))
			最终[3] = {"大法荆棘","牛妖",等级,2,0,0,0,0,0,0,-1,nil,nil,{"地狱烈火","水漫金山","泰山压顶","奔雷咒"},true,nil,10000,属性表}
			tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号})
		elseif tp.剧情开关.副本[2] == 4 then
			local mp = tp:取门派主技能(random(1,5))
			table.insert(mp,"高级反震")
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 3000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*3+等级*1.6)
			最终[1] = {名称,"地狱战神",等级,2,0,0,0,0,0,0,-1,nil,nil,mp,true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 3000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*2+等级*1.6)
			for n=2,3 do
				mp = tp:取门派主技能(random(1,5))
				最终[n] = {"妖怪守卫","兔子怪",等级,2,0,0,0,0,0,0,-1,nil,nil,mp,nil,nil,10000,属性表}
			end
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*6)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级+等级)
			for n=4,8 do
				最终[n] = {"妖怪兵士","牛头",等级,2,0,0,0,0,0,0,-1,nil,nil,{},nil,nil,10000,属性表}
			end
			tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号})
		elseif tp.剧情开关.副本[2] == 5 then
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2000
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)/2)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级+等级)
			local mx = {"羊头怪","狐狸精","蛤蟆精","黑熊精","牛妖"}
			for n=1,5 do
				最终[n] = {"鬼祟小妖",mx[random(1,#mx)],等级,2,0,0,0,0,0,0,-1,nil,nil,{},nil,nil,10000,属性表}
			end
			tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号})
		elseif tp.剧情开关.副本[2] == 6 then
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 3000
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级*2+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*3+等级*1.6)
			最终[1] = {"假乌鸡国王","大力金刚",等级,2,0,0,0,0,0,0,-1,nil,nil,tp:取门派主技能(15),true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3500
			属性表 = {}
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*8)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*4+等级*1.6)
			local mps = random(1,2)
			if mps == 1 then
				mps = tp:取门派主技能(9)
			else
				mps = tp:取门派主技能(15)
			end
			table.insert(mps,"高级法术连击")
			table.insert(mps,"高级法术暴击")
			for n=2,5 do
				最终[n] = {"侍从","蛤蟆精",等级,2,0,0,0,0,0,0,-1,nil,nil,mps,true,nil,10000,属性表}
			end
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*8)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级+等级)
			for n=6,9 do
				最终[n] = {"使女","狐狸精",等级,2,0,0,0,0,0,0,-1,nil,nil,{"超级连击","高级吸血","高级毒"},true,nil,10000,属性表}
			end
			tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号},true)
		end
	elseif tp.剧情开关.副本[1] == "车迟斗法" then
		if tp.剧情开关.副本[2] == 3 then
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3000
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
			local abs = {11,15,3,9}
			local gp = {"寿桃","苹果","烧饼","香梨"}
			最终[1] = {gp[random(1,#gp)],"泡泡",等级,2,0,0,0,0,0,0,-1,nil,nil,tp:取门派主技能(abs[random(1,#abs)]),true,nil,10000,属性表}
			体力资质 = 3500
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表 = {}
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			最终[2] = {gp[random(1,#gp)],"泡泡",等级,2,0,0,0,0,0,0,-1,nil,nil,tp:取门派主技能(10),true,nil,10000,属性表}
			体力资质 = 3000
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表 = {}
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*10)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			for n=3,7 do
				最终[n] = {"供品","泡泡",等级,2,0,0,0,0,0,0,-1,nil,nil,{"连击","高级偷袭"},true,nil,10000,属性表}
			end
		elseif tp.剧情开关.副本[2] == 5 then
			local aba = {{"元始天尊","天兵"},{"灵宝道君","天将"},{"太上老君","天将"}}
			体力资质 = 4000
			防御资质 = 1500
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			local abs = {5,3}
			abs = tp:取门派主技能(abs[random(1,#abs)])
			table.insert(abs,"魔之心")
			table.insert(abs,"强力")
			最终[1] = {aba[tp.剧情开关.副本[4][4]+1][1],"大力金刚",等级,2,0,0,0,0,0,0,-1,101,{1,0},abs,true,true,10000,属性表}
			属性表 = {}
			体力资质 = 3000
			防御资质 = 1500
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3000
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*10)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
			for n=2,7 do
				最终[n] = {"护法",aba[tp.剧情开关.副本[4][4]+1][2],等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级法术暴击","泰山压顶"},true,nil,10000,属性表}
			end
		elseif tp.剧情开关.副本[2] == 6 then
			if tp.剧情开关.副本[4][5] == 1 then
				local abs
				if 名称 == "风婆" then
					属性表 = {}
					体力资质 = 4000
					防御资质 = 1500
					攻击资质 = 1500
					速度资质 = 1500
					法力资质 = 2500
					属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
					属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
					属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
					属性表[4] = ceil(平均等级+等级)
					属性表[5] = ceil(速度资质*等级/800)
					属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
					abs = tp:取门派主技能(10)
					table.insert(abs,"高级吸血")
					table.insert(abs,"高级敏捷")
					最终[1] = {"风婆","风伯",等级,2,0,0,0,0,0,0,-1,89,{1,0},abs,true,nil,10000,属性表}
				elseif 名称 == "雨神" then
					属性表 = {}
					体力资质 = 4000
					防御资质 = 1500
					攻击资质 = 1000
					速度资质 = 1500
					法力资质 = 3500
					属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
					属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
					属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
					属性表[4] = ceil(平均等级+等级)
					属性表[5] = ceil(速度资质*等级/800)
					属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
					abs = tp:取门派主技能(15)
					table.insert(abs,"高级法术连击")
					table.insert(abs,"高级魔之心")
					最终[1] = {"雨神","雨师",等级,2,0,0,0,0,0,0,-1,114,{1,0},abs,true,nil,10000,属性表}
				elseif 名称 == "雷公" then
					属性表 = {}
					体力资质 = 4000
					防御资质 = 1500
					攻击资质 = 1000
					速度资质 = 1500
					法力资质 = 3500
					属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
					属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
					属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
					属性表[4] = ceil(平均等级+等级)
					属性表[5] = ceil(速度资质*等级/800)
					属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
					abs = tp:取门派主技能(11)
					table.insert(abs,"高级法术暴击")
					table.insert(abs,"高级法术波动")
					最终[1] = {"雷公","天将",等级,2,0,0,0,0,0,0,-1,71,{1,0},abs,true,nil,10000,属性表}
				end
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3000
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
				abs = {"水漫金山","高级法术连击","高级反震"}
				for n=2,6 do
					最终[n] = {"天将","天将",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				end
			elseif tp.剧情开关.副本[4][5] == 2 then
				属性表 = {}
				体力资质 = 5000
				防御资质 = 1500
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 3000
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*3)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				abs = tp:取门派主技能(10)
				table.insert(abs,"高级吸血")
				table.insert(abs,"高级强力")
				最终[1] = {"鹿力","炎魔神",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				local lls = {"芙蓉仙子","净瓶女娲","雨师"}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
				for n=2,5 do
					最终[n] = {"喽啰",lls[random(1,3)],等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				end
				lls = {"牛妖","踏云兽"}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				for n=6,10 do
					最终[n] = {"喽啰",lls[random(1,2)],等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				end
				boss = true
			end
		end
		tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号},boss)
	elseif tp.剧情开关.副本[1] == "水陆大会" then
		if tp.剧情开关.副本[2] == 2 then
			local abs
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			abs = tp:取门派主技能(random(1,15))
			table.insert(abs,"高级反震")
			最终[1] = {"桃木虫","海毛虫",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3000
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			for n=2,3 do
				最终[n] = {"桃木虫喽啰","蝴蝶仙子",等级,2,0,0,0,0,0,0,-1,nil,nil,{},nil,nil,10000,属性表}
			end
		elseif tp.剧情开关.副本[2] == 5 then
			local mxz = {}
			if 名称 == "翼虎将军" then
				local abs
				属性表 = {}
				体力资质 = 5000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				abs = tp:取门派主技能(12)
				table.insert(abs,"高级吸血")
				table.insert(abs,"高级强力")
				最终[1] = {"翼虎将军","噬天虎",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				mxz = {"虎精兵","老虎"}
			elseif 名称 == "翼蛇将军" then
				local abs
				属性表 = {}
				体力资质 = 5000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2.5)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				abs = tp:取门派主技能(5)
				table.insert(abs,"高级吸血")
				table.insert(abs,"高级强力")
				最终[1] = {"翼蛇将军","律法女娲",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				mxz = {"蛇精兵","灵符女娲"}
			end
			属性表 = {}
			体力资质 = 3000
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			for i=2,8 do
				最终[i] = {mxz[1],mxz[2],等级,2,0,0,0,0,0,0,-1,nil,nil,{"破血狂攻","高级反震"},nil,nil,10000,属性表}
			end
		elseif tp.剧情开关.副本[2] == 7 then
			local abs
			if 模型 == "鼠先锋" then
				属性表 = {}
				体力资质 = 4000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				最终[1] = {"巡山小妖",模型,等级,2,0,0,0,0,0,0,-1,nil,nil,{"破血狂攻","高级强力"},true,nil,10000,属性表}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
				for i=2,5 do
					最终[i] = {"巡山喽啰","雷鸟人",等级,2,0,0,0,0,0,0,-1,nil,nil,{"雷击"},true,nil,10000,属性表}
				end
			elseif 模型 == "地狱战神" then
				属性表 = {}
				体力资质 = 4000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*1.5)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
				abs = tp:取门派主技能(5)
				table.insert(abs,"高级强力")
				最终[1] = {"上古妖兽首领","地狱战神",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
				for i=2,5 do
					最终[i] = {"妖兽精兵","蜘蛛精",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级反震"},true,nil,10000,属性表}
				end
				属性表 = {}
				体力资质 = 3500
				防御资质 = 1000
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
				abs = tp:取门派主技能(15)
				table.insert(abs,"高级魔之心")
				最终[6] = {"妖巫师","吸血鬼",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
			elseif 模型 == "野猪精" then
				属性表 = {}
				体力资质 = 4500
				防御资质 = 1500
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3000
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*8)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级*2+等级)*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
				最终[1] = {"妖将军",模型,等级,2,0,0,0,0,0,0,-1,nil,nil,{"破血狂攻","高级强力"},true,nil,10000,属性表}
				属性表 = {}
				体力资质 = 3000
				防御资质 = 1000
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级))
				for i=2,6 do
					最终[i] = {"护法金刚","蜘蛛精",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级反震"},true,nil,10000,属性表}
				end
				属性表 = {}
				体力资质 = 3500
				防御资质 = 1500
				攻击资质 = 1500
				速度资质 = 1500
				法力资质 = 2500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级*1.6))
				abs = tp:取门派主技能(4)
				table.insert(abs,"高级敏捷")
				table.insert(abs,"高级反震")
				abs = {}
				最终[7] = {"妖护法","幽灵",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
				属性表 = {}
				体力资质 = 3500
				防御资质 = 1000
				攻击资质 = 1000
				速度资质 = 1500
				法力资质 = 3500
				属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
				属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
				属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
				属性表[4] = ceil(平均等级+等级)
				属性表[5] = ceil(速度资质*等级/800)
				属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
				abs = tp:取门派主技能(11)
				table.insert(abs,"高级法术波动")
				最终[8] = {"妖护法","幽灵",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
			end
		elseif tp.剧情开关.副本[2] == 8 then
			local abs = {}
			属性表 = {}
			体力资质 = 5000
			防御资质 = 1000
			攻击资质 = 1000
			速度资质 = 1500
			法力资质 = 3500
			属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*3)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
			abs = tp:取门派主技能(9)
			table.insert(abs,"高级魔之心")
			最终[1] = {"魍魉","帮派妖兽",等级,2,0,0,0,0,0,0,-1,nil,nil,abs,true,nil,10000,属性表}
			属性表 = {}
			体力资质 = 3000
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil(平均等级*体力资质/100+(平均等级+等级)*2*12)
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.3)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			for i=2,6 do
				最终[i] = {"妖护卫","黑熊精",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级必杀"},true,nil,10000,属性表}
			end
			属性表 = {}
			体力资质 = 3500
			防御资质 = 1000
			攻击资质 = 1500
			速度资质 = 1500
			法力资质 = 2500
			属性表[1] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
			属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
			属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
			属性表[4] = ceil(平均等级+等级)
			属性表[5] = ceil(速度资质*等级/800)
			属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
			local nms = {10,13}
			for i=7,8 do
				local cbs
				cbs = tp:取门派主技能(nms[1])
				table.insert(cbs,"高级反震")
				最终[i] = {"妖王护法","百足将军",等级,2,0,0,0,0,0,0,-1,nil,nil,cbs,true,nil,10000,属性表}
				table.remove(nms,1)
			end
		end
		tp.场景.战斗:进入战斗(最终,{[1]="副本",[2]=名称,[3]=模型,[4]=编号},boss)
	elseif tp.剧情开关.副本[1] == "通天河" then
	elseif tp.剧情开关.副本[1] == "大闹天宫" then
	elseif tp.剧情开关.副本[1] == "秘境降妖" then
	end
end