--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
local tp = 引擎.场景
local random = 引擎.取随机整数
function 引擎.十二生肖战斗(名称,编号,模型)
	local ceil = math.ceil
	local floor = math.floor
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	local 最终 = {}
	平均等级 = floor(平均等级 / 数量)
	平均等级 = 60
	local 特殊 = nil
	local 等级 = 平均等级+20
	if 名称 == "子鼠" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 2000
		法力资质 = 2500
		属性表[1] = 80000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/600)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		属性表[7] = 999999999
		最终[1] = {"子鼠","鼠先锋",等级,2,0,0,0,0,0,0,-1,109,{1,0},{"高级连击","高级隐身"},true,nil,10000,属性表}
	elseif 名称 == "丑牛" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3500
		属性表[1] = 50000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+2*1.6))
		最终[1] = {"丑牛","踏云兽",等级,2,0,0,0,0,0,0,-1,110,{1,1},{"三昧真火","高级魔之心","神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3000
		属性表[1] = 20000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+2*1.6))
		for i=2,3 do
			最终[i] = {"哞哞牛","踏云兽",等级,2,0,0,0,0,0,0,-1,nil,nil,{"飞砂走石","高级魔之心"},true,nil,10000,属性表}
		end
	elseif 名称 == "寅虎" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 25000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		最终[1] = {"寅虎","噬天虎",等级,2,0,0,0,0,0,0,-1,106,{1,0},{"变身","鹰击","高级吸血","高级神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 10000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,5 do
			最终[i] = {"虎跑","噬天虎",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级强力","连击"},true,nil,10000,属性表}
		end
		for i=6,8 do
			最终[i] = {"虎跃","噬天虎",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级强力","连击"},true,nil,10000,属性表}
		end
	elseif 名称 == "卯兔" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 2000
		法力资质 = 3500
		属性表[1] = 25000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
		最终[1] = {"卯兔","兔子怪",等级,2,0,0,0,0,0,0,-1,51,{1,0},{"失心符","落雷符","高级敏捷","高级神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 2000
		法力资质 = 2000
		属性表[1] = 15000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,5 do
			local name = "蹦蹦"
			if i > 2 then
				name = "跳跳"
			end
			最终[i] = {"卯兔","兔子怪",等级,2,0,0,0,0,0,0,-1,nil,nil,{"高级连击","高级必杀"},true,nil,10000,属性表}
		end
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 2000
		法力资质 = 3000
		属性表[1] = 15000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
		最终[6] = {"狸","花妖",等级,2,0,0,0,0,0,0,-1,58,{1},{"失心符","定身符","高级敏捷","高级神迹"},true,nil,10000,属性表}
	elseif 名称 == "辰龙" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3000
		属性表[1] = 20000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6))
		最终[1] = {"辰龙","蛟龙",等级,2,0,0,0,0,0,0,-1,90,{1,1},{"龙卷雨击","高级魔之心","高级神佑复生"},true,nil,10000,属性表}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3000
		属性表[1] = 10000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
		for i=2,5 do
			最终[i] = {"龙飞","蛟龙",等级,2,0,0,0,0,0,0,-1,nil,nil,{"龙腾","水漫金山","高级魔之心","高级神佑复生"},true,nil,10000,属性表}
		end
		for i=6,10 do
			最终[i] = {"龙跃","蛟龙",等级,2,0,0,0,0,0,0,-1,nil,nil,{"龙腾","水漫金山","高级魔之心","高级神佑复生"},true,nil,10000,属性表}
		end
	elseif 名称 == "巳蛇" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 25000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		最终[1] = {"巳蛇","千年蛇魅",等级,2,0,0,0,0,0,0,-1,20104,{5},{"破釜沉舟","横扫千军","高级强力","高级神迹"},true,nil,10000,属性表}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 10000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,8 do
			最终[i] = {"蛇形魅影","千年蛇魅",等级,2,0,0,0,0,0,0,-1,nil,nil,{"横扫千军","后发制人","高级强力"},true,nil,10000,属性表}
		end
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 2000
		法力资质 = 3000
		属性表[1] = 15000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
		最终[9] = {"狸","花妖",等级,2,0,0,0,0,0,0,-1,58,{1},{"失心符","定身符","高级敏捷","高级神迹"},true,nil,10000,属性表}
	elseif 名称 == "午马" then
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 25000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级*2+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		最终[1] = {"午马","马面",等级,2,0,0,0,0,0,0,-1,78,{1,0},{"阎罗令","尸腐毒","高级防御","高级鬼魂术"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 12000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,5 do
			最终[i] = {"逐日","马面",等级,2,0,0,0,0,0,0,-1,nil,nil,{"阎罗令","高级鬼魂术"},true,nil,10000,属性表}
		end
		for i=6,8 do
			最终[i] = {"追风","马面",等级,2,0,0,0,0,0,0,-1,nil,nil,{"阎罗令","高级鬼魂术"},true,nil,10000,属性表}
		end
	elseif 名称 == "未羊" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 50000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		最终[1] = {"未羊","羊头怪",等级,2,0,0,0,0,0,0,-1,54,{1,0},{"力劈华山","高级强力","高级神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 20000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*1.5)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,3 do
			最终[i] = {"咩咩","羊头怪",等级,2,0,0,0,0,0,0,-1,nil,nil,{"壁垒击破","高级强力"},true,nil,10000,属性表}
		end
	elseif 名称 == "申猴" then
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 2500
		速度资质 = 1000
		法力资质 = 3000
		属性表[1] = 50000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2*1.2)
		属性表[3] = 5000
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级)*1.2)
		最终[1] = {"申猴","长眉灵猴",等级,2,0,0,0,0,0,0,-1,2051,{1,0},{"高级强力","高级神迹"},true,nil,10000,属性表}
	elseif 名称 == "酉鸡" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3500
		属性表[1] = 30000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*防御资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6))
		最终[1] = {"酉鸡","雷鸟人",等级,2,0,0,0,0,0,0,-1,62,{1,0},{"泰山压顶","高级魔之心","高级神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3000
		属性表[1] = 17000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
		for i=2,5 do
			最终[i] = {"鸡鸣","雷鸟人",等级,2,0,0,0,0,0,0,-1,nil,nil,{"落岩","高级魔之心"},true,nil,10000,属性表}
		end
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 2000
		法力资质 = 3000
		属性表[1] = 15000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级*1.6))
		最终[6] = {"狸","花妖",等级,2,0,0,0,0,0,0,-1,58,{1},{"失心符","定身符","高级敏捷","高级神迹"},true,nil,10000,属性表}
	elseif 名称 == "戌狗" then
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 2500
		速度资质 = 2000
		法力资质 = 2000
		属性表[1] = 20000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/600)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		属性表[7] = 999999999
		最终[1] = {"戌狗","哮天犬",等级,2,0,0,0,0,0,0,-1,nil,nil,{"翻江搅海","天崩地裂","高级敏捷","高级神迹"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 8000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[7] = 999999999
		for i=2,10 do
			最终[i] = {"犬吠","狼",等级,2,0,0,0,0,0,0,-1,nil,nil,{"浪涌","高级必杀"},true,nil,10000,属性表}
		end
	elseif 名称 == "亥猪" then
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 2500
		属性表[1] = 30000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		属性表[7] = 999999999
		最终[1] = {"亥猪","野猪",等级,2,0,0,0,0,0,0,-1,52,{1},{"晶清诀","高级神迹","高级防御"},true,nil,10000,属性表}
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 10000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=2,3 do
			最终[i] = {"猪小哼","野猪",等级,2,0,0,0,0,0,0,-1,2079,{1},{"横扫千军","高级强力"},true,nil,10000,属性表}
		end
		属性表 = {}
		防御资质 = 1500
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3000
		属性表[1] = 5000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级*2+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*3+等级*1.6))
		for i=4,5 do
			最终[i] = {"哼哼猪","野猪",等级,2,0,0,0,0,0,0,-1,2079,{2},{"唧唧歪歪","高级魔之心"},true,nil,10000,属性表}
		end
		属性表 = {}
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 2000
		属性表[1] = 8000
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*1.5+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		for i=6,10 do
			最终[i] = {"猪哼哼","野猪",等级,2,0,0,0,0,0,0,-1,2079,{4},{"高级必杀"},true,nil,10000,属性表}
		end
	end
	tp.场景.战斗:进入战斗(最终,{[1]="十二生肖",[2]=名称,[3]=模型,[4]=编号,[5]=特殊})
end