--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2020-09-13 02:55:54
--======================================================================--
local sj = 引擎.取随机整数
local format = string.format
local insert = table.insert
function 引擎.场景:对话事件(ID,编号,页数,已经在任务中)
	local wb = {}
	if ID == 1501 then
		if 编号 == 1 then
			local xx = {"我要更换当前的宠物"}
			self.窗口.对话栏:文本("普陀山_接引仙女","宠物仙子","每个宠物都有它特定的属性，有时候宠物甚至决定一只召唤兽的好坏",xx)
		elseif 编号 == 2 then
			wb[1] = "好消息！最近老夫请到了京城梨园的名角来献艺，机会难得，各位千万不要错过了！"
			wb[2] = "听戏可是人生的一大乐趣啊~#51"
			wb[3] = "我们是远近闻名的草台班子，南腔北调昆腔越剧流行歌曲你想听什么都有"
			wb[4] = "真是太平盛世啊，老百姓衣食无忧，闲暇时间还是多听听戏吧。"
			wb[5] = "一到戏台开演的日子，建邺城总是万人空巷。"
			self.窗口.对话栏:文本("男人_老伯","戏班老板",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "如果说我现在说的是假话，你相信么？"
			wb[2] = "周猎户最喜欢和我拉家常了，他家就住在药店边上。"
			wb[3] = "嘘——千万不要告诉他们我爱吹牛啊，这会影响我的形象的！"
			wb[4] = "人生最痛快的事情莫过于和周猎户一起喝点小酒了！"
			wb[5] = "天上有只牛在飞，一定是我在地上吹。"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 5 or self.红尘试炼[2] == 6) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_苦力","吹牛王",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			self.窗口.对话栏:文本("女人_赵姨娘","幸运使者","目前游戏还处于测试阶段，很多功能都还没有开放，等正式版的时候老玩家可以来我这里领取礼包哦")
		elseif 编号 == 5 then
			wb[1] = "上面粉蒸出来的包子，客官想要几个。"
			wb[2] = "建邺虽小，可样样齐全，什么都有#2货栈边上那个王大嫂做的烤鸭真是好吃。"
			wb[2] = "包子有肉不在褶上,肚里有货不在嘴上。"
			local xx = {"购买","我什么也不想做"}
			self.窗口.对话栏:文本("小孩_飞儿","飞儿",wb[sj(1,#wb)],xx)
		elseif 编号 == 6 then
			wb[1] = "我的工作就是收取厌倦尘世生活的玩家性命，如果你不再留恋这个美好的世界，你的一切都将在我这里终结，请认真做出你的选择，你的朋友、亲人将再也见不到你，你永远只存在他们的记忆当中"
			local xx = {"我已经想清楚了","我保留意见"}
			self.窗口.对话栏:文本("马面","勾魂马面",wb[sj(1,#wb)],xx)
		elseif 编号 == 7 then
			wb[1] = "城北的海岸常有大风浪，岸边那艘沉船，也不知道是哪个年月遇到大风浪沉在那里的"
			wb[2] = "我丈夫出海死了，现在我也只好出来摆摊赚钱养活我那个两个孩子"
			wb[3] = "飞儿可真是个懂事的孩子，年纪轻轻就挑起了全家的重担。"
			wb[4] = "瞧一瞧！看一看！新鲜出炉的烤鸭！#51"
			wb[5] = "听过京城的人说，城里到处是亭台楼阁，红砖绿瓦，连皇上都住在那儿，真想去见识一下"
			wb[6] = "在我这里你可以学习烤鸭技巧，学会如何烹饪烤鸭之后你购买一只未煮熟的烤鸭，进行烹饪，烹饪之后的烤鸭不仅可以食用还可以500两银子出售给我"
			wb[7] = "无鸭不成席。来到建邺，你可一定得尝尝我家的烤鸭！"
			if self.红尘试炼 ~= nil and 已经在任务中 == nil then
				if self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 1 or self.红尘试炼[2] == 3 or self.红尘试炼[2] == 30) then
					self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
					return
				elseif self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 5 or self.红尘试炼[2] == 9) then
					self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
					return
				end
			end
			self.窗口.对话栏:文本("女人_王大嫂","王大嫂",wb[sj(1,#wb)])
		elseif 编号 == 8 then
			wb[1] = "我在收购附近的海产，什么大海龟、巨蛙、海毛虫之类的都收#R/（警告：请将不出售的海产召唤兽设置为参战状态）"
			local xx = {"我卖大海龟（250两银子/只或者300两储备金/只）给你","我卖巨蛙（350两银子/只或者400两储备金/只）给你","我卖海毛虫（500两银子/只或者600两储备金/只）给你","没什么，我只是看看"}
			self.窗口.对话栏:文本("男人_钓鱼","海产收购商",wb[sj(1,#wb)],xx)
		elseif 编号 == 9 then
			wb[1] = "几年前一次台风，这里沉了不少船，东海湾那里常年有个旋涡，沉掉的船都在下面。要下沉船，从海边的旋涡那潜下去即可。"
			wb[2] = "要下沉船，从海边的旋涡那潜下去即可。"
			wb[3] = "这几年风调雨顺，老百姓的日子过得都很富足，只是城外野兽横行，常有外出的百姓受到骚扰。"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 1) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_老孙头","老孙头",wb[sj(1,#wb)])
		elseif 编号 == 10 then
			wb[1] = "这建邺小城真是风景如画。"
			wb[2] = "十级以下的新人我可以为你免费治疗伤势。"
			wb[3] = "我是行走江湖的郎中，治病救人是我份内之事。"
			wb[4] = "我是建邺城最精通医药之术的人。"
			wb[5] = "少肉多菜，少烦多眠，少欲多施，方能长寿。"
			local xx = {"快些治疗我吧","我点错了"}
			self.窗口.对话栏:文本("男人_药店老板","陈长寿",wb[sj(1,#wb)],xx)
		elseif 编号 == 11 then
			wb[1] = "我没事就去长安书店给颜如玉打工，出体力赚钱一点都不难。"
			wb[2] = "昨天我去长安商会总管那，妈呀，东西多到开天眼都看不过来了"
			self.窗口.对话栏:文本("小孩_飞儿","罗招弟",wb[sj(1,#wb)])
		elseif 编号 == 12 then
			wb[1] = "驱鬼除妖测字算命啦，前算五百年，后算五百年。"
			wb[2] = "这位朋友面带福相，印堂发亮，想是遇到什么喜事了吧。"
			wb[3] = "我就是英俊潇洒玉树临风嫉恶如仇斩妖除魔的方寸第一道士牛大胆！#51"
			wb[4] = "城里的渔夫出海打渔之前，都爱到我这里算上一卦。"
			wb[5] = "求神问卦，看人说话。这位你可要来让我瞧瞧？"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 3 or self.红尘试炼[2] == 11) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_道士","牛大胆",wb[sj(1,#wb)],nil)
		elseif 编号 == 13 then
			wb[1] = "我收购一切装备，直接给我就可以估价了。（#R/收购价格为正常价格的60%#W/）"
			local xx = {"出售","我什么都不想做"}
			self.窗口.对话栏:文本("男人_苦力","装备收购商",wb[sj(1,#wb)],xx)
		elseif 编号 == 14 then
			wb[1] = "我鉴定一切武器，按物品收费，你自己给予给我就好了。（#R/鉴定价格为正常价格的10%#W/）"
			local xx = {"给予","我什么都不想做"}
			self.窗口.对话栏:文本("男人_苦力","装备鉴定商",wb[sj(1,#wb)],xx)
		elseif 编号 == 15 then
			wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
			local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满全队召唤兽的气血、魔法和忠诚值","我只是看看"}
			self.窗口.对话栏:文本("男人_巫医","超级巫医",wb[sj(1,#wb)],xx)
		elseif 编号 == 16 then
			wb[1] = "建邺虽然小，可是什么都不缺。"
			wb[2] = "前几天去了趟长安城，城里的过往客商可真多。"
			wb[3] = "建邺的风景还不错吧。"
			wb[4] = "老孙头最近好象有什么心事的样子，整天皱着个眉头在自言自语。"
			wb[5] = "俗话说无奸不商，如今像我这样清白做生意的商人可真是少见了啊#17"
			wb[6] = "建邺城可谓麻雀虽小，五脏俱全。长安城有的，你在这都能找到#43"
			self.窗口.对话栏:文本("男人_老伯","赵元宝",wb[sj(1,#wb)],xx)
		elseif 编号 == 17 then
			wb[1] = "面对世俗偏见，有情人终成眷属真的不容易#52"
			wb[2] = "货栈边上那个王大嫂做的烤鸭真是好吃"
			wb[3] = "又过冬了，得为咱家孩子添置几件棉袄了"
			wb[4] = "听说最近长安城集市热闹的很，过几天可要去看看"
			wb[5] = "听说东海里有数不尽的宝贝……"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 11 or self.红尘试炼[2] == 12 or self.红尘试炼[2] == 24) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("普陀山_接引仙女","小花",wb[sj(1,#wb)])
		elseif 编号 == 18 and 页数 == nil then
			wb[1] = "最近有些事情忙不过来了，你愿意帮我分担一点吗？"
			local xx = {"我来领取建邺赏金任务","我完成任务回来领取奖励","查看心魔宝珠获得场景","我只是看看"}
			self.窗口.对话栏:文本("男人_衙役","赵铺头",wb[sj(1,#wb)],xx)
		elseif 编号 == 19 then
			wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
			local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚值","我只是看看"}
			self.窗口.对话栏:文本("男人_巫医","超级巫医",wb[sj(1,#wb)],xx)
		elseif 编号 == 20 then
			wb[1] = "最近常有鬼鬼祟祟的家伙在门口探头探脑#35，我们镖局可不要这种来路不正的生意。"
			self.窗口.对话栏:文本("男人_镖头","张来福",wb[sj(1,#wb)])
		elseif  编号 == 21 then
			wb[1] = "找我干嘛呢？"
			local xx = {"交易","只是路过"}
			self.窗口.对话栏:文本("男人_特产商人","建邺特产商人",wb[sj(1,#wb)],xx)
		elseif 编号 == 22 then
			wb[1] = "听说这里有动物的毛能治小儿惊风，此次我是特地来这收购货物的。"
			wb[2] = "我是专门走南闯北倒卖货物的商人。"
			wb[3] = "求老天保佑，早日除去城外的野兽，免得我们出城还要提心吊胆。"
			wb[4] = "衙门里的简师爷平日深居简出，低调得很。"
			wb[5] = "您要点什么，下次我给您带来。"
			wb[6] = "衙天南地北的特产我这都有，就连地府的东西我也能搞到。"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 7 or self.红尘试炼[2] == 8) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			if self.红尘试炼 ~= nil and 已经在任务中 == nil then
				if self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 7 or self.红尘试炼[2] == 8) then
					self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
					return
				elseif self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 15) then
					self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
					return
				end
			end
			self.窗口.对话栏:文本("男人_武器店老板","马全有",wb[sj(1,#wb)])
		elseif 编号 == 23 then
			wb[1] = "善哉善哉，佛祖有云：“一人出家，全家光荣”，这位施主看似颇有慧根，应该及早皈依我佛门才是啊。"
			wb[2] = "不知上次赵捕头有没有记得帮我替我带香烛回来。"
			wb[3] = "师傅常说，“心静则万事静，心清则万事清”，我特地到这个清静的小城来体验生活。"
			wb[4] = "不要问我从何而来，我站在这就是神仙一样的存在。"
			wb[5] = "和尚越老越值钱#18"
			self.窗口.对话栏:文本("男人_胖和尚","迎客僧",wb[sj(1,#wb)])
		elseif 编号 == 24 then
			wb[1] = "这是李老爷的府上，在这个小城里，我们老爷可是知名度最高的人了。"
			wb[2] = "我家老爷最近病的厉害，医生怎么查也查不出是什么原因。"
			wb[3] = "当个管家也不容易呀，每天忙里忙外，什么杂七杂八的事情都得打点。"
			wb[4] = "人说做一次善事容易，做一辈子善事就难咯，在这点上我是万分钦佩我家老爷的。"
			wb[5] = "建邺城啥时才能开个长安城那样的赌坊呢#80"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 13 or self.红尘试炼[2] == 17) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_店小二","管家",wb[sj(1,#wb)])
		elseif 编号 == 25 then
			wb[1] = "最近天气很好，海上没有大风浪。"
			wb[2] = "城外东海湾附近常有怪物出没，路过那里可要小心。"
			wb[3] = "咱家李善人老爷最近身体不适，我得去药店寻个方子。"
			wb[4] = "听说戏班老板请了京城的梨园弟子前来献艺，一定得去捧个场。"
			self.窗口.对话栏:文本("男人_兰虎","符全",wb[sj(1,#wb)])
		elseif 编号 == 26 then
			wb[1] = "天天在这边看门真是没意思，我也渴望刺激的生活。"
			wb[2] = "前面就是江南野外了，没有实力可不要硬闯，小心被野兽吃的骨头都不剩！"
			local xx = {"传送江南野外","我只是路过"}
			self.窗口.对话栏:文本("男人_衙役","建邺守卫",wb[sj(1,#wb)],xx)
		elseif 编号 == 27 then
			wb[1] = "城里有位好心的郎中陈长寿，给新人看病从不收银子。他一般都在去东海湾的城门口附近摆摊看病。"
			wb[2] = "我经常去找宠物仙子姐姐玩，她那里有好多可爱的小动物，上次还送了我一只做宠物呢#43"
			wb[3] = "城里什么都好，就是小伙伴太少。想去江南野外玩，妈妈又不让，说那里的怪物太凶，没一定的修为去了很危险。"
			wb[4] = "人之初，性本善，性相近，习相远。教书先生今天教的三字经，我一定得背熟。 "
			wb[5] = "建邺城里最好吃的就是马氏酸枣了#89"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 9 or self.红尘试炼[2] == 10 or self.红尘试炼[2] == 21) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("小孩_雷黑子","雷黑子",wb[sj(1,#wb)])
		elseif 编号 == 28 then
			wb[1] = "我是城里的教书先生，如果你不清楚接下来做些什么，我可以给你一些建议。"
			wb[2] = "黑发不知勤学早，白首方悔读书迟。少侠可不要荒废了学业！"
			wb[3] = "在我教过的学生里，雷黑子是最刻苦上进的一个。"
			self.窗口.对话栏:文本("男人_书生","教书先生",wb[sj(1,#wb)])
		elseif 编号 == 29 then
			wb[1] = "爱你们"
			wb[2] = "我的玩家们是最牛逼的"
			wb[3] = "小白天下第一"
			self.窗口.对话栏:文本("男人_财主","小白",wb[sj(1,#wb)])

		end
	elseif ID == 1505 then
		if 编号 == 1 then
			wb[1] = "建邺里一年四季温暖如春。"
			wb[2] = "客官想买其他杂货可以去城里看看。"
			wb[3] = "洞冥草可以解除摄妖香的效果，你记住了吗#1"
			wb[4] = "宠物口粮只能通过怪物获得"
			local xx = {"购买","我什么也不想做"}
			self.窗口.对话栏:文本("男人_巫医","杂货店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1537 then
		if 编号 == 1 then
			wb[1] = "别看我官小，建邺城的贸易都是由我掌管的"
			wb[2] = "有钱可以使鬼推磨，恰好我有钱"
			local xx = {"我要招募队员","我要更改角色的名字","我随便逛逛 不好意思"}
			self.窗口.对话栏:文本("男人_老财","贸易车队总管",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "公堂禁地，闲杂人等不许乱闯。"
			wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
			wb[3] = "作奸犯科可是要下大狱的。"
			wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
			wb[5] = "虽有石狮把门，安全还得靠人。"
			self.窗口.对话栏:文本("男人_衙役","衙役1",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "公堂禁地，闲杂人等不许乱闯。"
			wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
			wb[3] = "作奸犯科可是要下大狱的。"
			wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
			wb[5] = "虽有石狮把门，安全还得靠人。"
			self.窗口.对话栏:文本("男人_衙役","衙役2",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "公堂禁地，闲杂人等不许乱闯。"
			wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
			wb[3] = "作奸犯科可是要下大狱的。"
			wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
			wb[5] = "虽有石狮把门，安全还得靠人。"
			self.窗口.对话栏:文本("男人_衙役","衙役3",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "公堂禁地，闲杂人等不许乱闯。"
			wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
			wb[3] = "作奸犯科可是要下大狱的。"
			wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
			wb[5] = "虽有石狮把门，安全还得靠人。"
			self.窗口.对话栏:文本("男人_衙役","衙役4",wb[sj(1,#wb)])
		elseif 编号 == 6 then
			wb[1] = "这日子有点太平过头了，半个月来一个告状的都没有。"
			wb[2] = "我们建邺城北门附近，有个有名的郎中叫陈长寿，他可以帮新朋友进行免费治疗。"
			wb[3] = "我们这里可是清水衙门，不收礼的。"
			wb[4] = "作奸犯科之事，衙门绝不会放过。"
			wb[5] = "清廉方正，一心为民，为官之道也。"
			self.窗口.对话栏:文本("男人_师爷","简师爷",wb[sj(1,#wb)])
		elseif 编号 == 7 then
			wb[1] = "不能体恤民情的官不是好官。"
			wb[2] = "公堂之上，岂容喧哗"
			wb[3] = "公正公平，廉洁高效，这词不错，明儿粉到墙上去"
			self.窗口.对话栏:文本("男人_老书生","建邺县令",wb[sj(1,#wb)])
		end
	elseif ID == 1502 then
		if 编号 == 1 then
			wb[1] = "客官想要什么兵器？"
			wb[2] = "行走江湖不能两手空空，来挑一件趁手的兵器吧。"
			wb[3] = "这里的风景还不错吧。"
			wb[4] = "少侠是来选购兵器的吧？请慢慢挑选，务必看清楚名称哦！"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_武器店老板","武器店老板",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "长安武器店专卖0级和20级武器，0级和10级的武器则在建邺城出售。少侠记住了没#1"
			wb[2] = "瞧一瞧看一看了，我这里的武器最适合新人使用了。边上的老板出售高级一点的兵器，购买时请看清楚物品等级，别买错了哦#2"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_老孙头","武器店掌柜",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			wb[1] = "（这是一个燃着暗红色火光的打铁炉，使用的时候请小心，烫到手就不好了。）"
			local xx = {"查看熟练度","打造","合成","修理","分解","熔炼"}
			self.窗口.对话栏:文本(nil,"打铁炉",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1503 then
		if 编号 == 1 then
			wb[1] = "小店的服饰都是请城里的裁缝精心裁剪的，做工绝对没有问题。"
			wb[2] = "城里的老少都穿我卖的衣服。"
			wb[3] = "小店布匹又快用光了，过两天得去城里进货。"
			wb[4] = "本店服装纯手工制作，随便看看吧。"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_服装店老板","服装店老板",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "（缝纫台上摆放着布匹、剪刀、尺子等物品，欢迎使用）"
			local xx = {"查看熟练度","打造","合成","认证"}
			self.窗口.对话栏:文本(nil,"缝纫台",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1504 then
		if 编号 == 1 then
			wb[1] = "城里有位好心的郎中陈长寿，看病从不收银子，他一般都在去东海湾的城门口附近摆摊看病。"
			wb[2] = "拉肚子，选好药，选药也要有诀窍。"
			wb[3] = "客官需要什么药？"
			wb[4] = "俗话说“对症下药”，这药可是不能乱吃的。"
			wb[5] = "佛手可以去长安、西梁女国和朱紫国的药店买哦。"
			wb[6] = "药材好，药才好。"
			local xx = {"购买","我只是来看看"}
			self.红尘试炼[2] = 7
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 7) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_药店老板","药店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1526 then
		if 编号 == 1 then
			wb[1] = "最近都打不到什么猎物，日子还怎么过啊，老婆说再这样下去，就得考虑让我进京城打工了。"
			wb[2] = "城外的野兽倒不少，可都是凶猛无比，真是恐怖啊！"
			wb[3] = "如今外出打猎要带一包袱的草药，都搞不清是谁打谁了。"
			wb[4] = "进山不怕虎伤人，下海不怕龙卷身。没有胆量是做不得猎人的。"
			wb[5] = "自从建邺城开了新城门，经由我家门口去东海确实方便了许多。"
			self.窗口.对话栏:文本("男人_兰虎","周猎户",wb[sj(1,#wb)])
		end
	elseif ID == 1534 then
		if 编号 == 1 then
			wb[1] = "日行一善，积善成德。"
			wb[2] = "钱财是身外之物，能用来济世行善是最好不过。"
			wb[3] = "老夫虽膝下无子，但这万贯家财我已经找到了继承人。"
			wb[4] = "我已经不再年轻了，但我喜欢帮助有志向有作为的年轻人"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 19 or self.红尘试炼[2] == 29) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_老财","李善人",wb[sj(1,#wb)])
		end
	elseif ID == 1523 then
		if 编号 == 1 then
			wb[1] = "你要把物品典当给我吗？如果是#Y/古董#W/的话我的出价会高些，但是如果是普通的物品那么典当价格为正常价格的30%"
			xx = {"我有物品需要典当","我只是随便逛逛 打扰了"}
			self.窗口.对话栏:文本("男人_特产商人","当铺老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1524 then
		if 编号 == 1 then
			wb[1] = "角色所持有的金钱不能超过6亿，银行最大存款不能超过3亿"
			local xx = {"存款","取款","我只是来看看"}
			self.窗口.对话栏:文本("男人_财主","钱庄老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1506 then
		if 编号 == 1 then
			wb[1] = "我可以送你去#R/傲来国#W/你要不要去呢？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","船夫",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "我只为10级以下的新人治疗，而且是免费的，有什么可以帮你的吗？"
			local xx = {"请帮我治疗","我随便看看,打扰了"}
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 13 or self.红尘试炼[2] == 15 or self.红尘试炼[2] == 17) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("男人_村长","云游神医",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
			local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚值","我只是看看"}
			self.窗口.对话栏:文本("男人_巫医","超级巫医",wb[sj(1,#wb)],xx)
		elseif 编号 == 4 then
			wb[1] = "这附近有个岩洞，进去过的人都说里面有很厉害的怪物，最好找一些伙伴一起进去比较安全，你也想进去冒险吗？"
			local xx = {"是的，我想进去探个究竟","我怕黑，还是不进去了"}
			self.窗口.对话栏:文本("男人_钓鱼","捕鱼人",wb[sj(1,#wb)],xx)
		elseif 编号 == 5 then
			wb[1] = "我可以送你去#R/龙宫#W/，你要不要去呢？"
			local xx = {"是的我要去","我还有逛逛"}
			self.窗口.对话栏:文本("虾兵","老虾",wb[sj(1,#wb)],xx)
			elseif 编号 == 6 then
			wb[1] = "从这里过去可以到建邺，那里的风景很不错的。"
			wb[2] = "东海湾常有怪物出没，可要小心。"
			wb[3] = "长安城里的集市很热闹的，有机会一定要去看看。"
			wb[4] = "东海边的林老汉可以带你去东海岩洞，那里能遇到海毛虫哦#40"
			wb[5] = "东海之水，载不动我沉沉的依恋。"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "枯萎的金莲" and (self.红尘试炼[2] == 19 or self.红尘试炼[2] == 26 or self.红尘试炼[2] == 28) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("普陀山_接引仙女","楚恋依",wb[sj(1,#wb)])
		elseif 编号 == "1_蝴蝶精灵" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		elseif 编号 == "1_转生后的蝴蝶精灵" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		end
	--龙宫
	elseif ID == 1117 then
		if 编号 == 1 then
			local v = false
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"定海针") and not 取数组内容(self.剧情开关.飞升[2][3],"定海针") then
				v = true
			end
			if not v then
				wb[1] = "龙宫里有数不尽的宝贝，有机缘之人方能得到。"
				wb[2] = "龙族的法术玄妙精深，要苦心修习方能领悟。"
				wb[3] = "修行贵在用心领悟，切忌轻浮自满。"
				wb[4] = "要想成为仙界的精英，是要下一番苦功夫的。"
				wb[5] = "遇到大唐弟子可千万别跟他们蛮干，切记。"
				wb[6] = "为人间降雨是老夫的职责所在。"
				local xx = {"交谈","给予","师门任务","学习技能",}
				if self.队伍[1].门派 == "无门派" then
					insert(xx,"拜师")
				end
				if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"定海针") and 取数组内容(self.剧情开关.飞升[2][3],"定海针") then
					insert(xx,"飞升剧情")
				end
				self.窗口.对话栏:文本("东海龙王","东海龙王",wb[sj(1,#wb)],xx,"门派师傅")
			else
				insert(self.剧情开关.飞升[2][3],"定海针")
				self.剧情开关.飞升[2][4] = {1117,"东海龙王",self:指定等级物品(90,sj(1,18))}
 				self.窗口.对话栏:文本("东海龙王","东海龙王",format("虽然有玉帝旨意，但是此物乃龙宫镇海之宝，不可轻与。你可拿#R/%s（90-120级皆可）#W/换来镇海。否则飓风狂浪无法止息，寡人也吃不消",self.剧情开关.飞升[2][4][3]))
			end
		end
	elseif ID == 1116 then
		if 编号 == 1 then
			wb[1] = "我可以送你去#R/东海湾#W/，你要不要去呢？"
			local xx = {"是的 我要去","我还有逛逛"}
			self.窗口.对话栏:文本("虾兵","虾兵",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "有志的仙族青年应该投奔我龙宫，及早谋个好前程啊。"
			wb[2] = "最近宫里丢了颗定颜珠，千岁正发愁呢。"
			wb[3] = "海底地形复杂，当心可别迷了路。"
			wb[4] = "一只羊在吃草，一只狼在旁边过，但没吃羊，少侠可知这个谜语说的是谁#40"
			wb[5] = "前几日一只螃蟹爬出蒸锅说“我热”，我愤怒的教导他，想红就给我忍着点#4"
			self.窗口.对话栏:文本("蟹将","蟹将军",wb[sj(1,#wb)])
		elseif (编号 == 3 or 编号== 7 or 编号 == 9 or 编号 == 10 or 编号 == 12 or 编号 == 13 or 编号 == 15) then
			wb[1] = "龙宫的宝贝真是多啊，随便偷得一两件拿到外面来卖都能发笔横财。"
			wb[2] = "瞧一瞧看一看了，东海龙宫宝贝大展销啦#51"
			wb[3] = "三界之间的恩怨情仇，从来就和我们这种小角色无关#109"
			self.窗口.对话栏:文本("虾兵","虾兵",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "大家叫我龟千岁，可我看起来还是那么年轻吧？"
			wb[2] = "在海里呆得久了，想到陆地上走走。"
			wb[3] = "龙族的法术玄妙无比，要苦心修习方能领悟。"
			wb[4] = "龙宫里有数不尽的宝贝，有机缘之人才能得到。"
			wb[5] = "生蚝肉怎么这么好吃#89 "
			wb[6] = "年纪越大，越容易犯低级错误#76"
			self.窗口.对话栏:文本("龟丞相","龟千岁",wb[sj(1,#wb)])
		elseif 编号 == 6 then
			wb[1] = "我爹爹只不过改了下雨的时辰点数就被斩首了，真不甘心！"
			wb[2] = "我一定要用袁守诚的人头祭祀我父王。"
			self.窗口.对话栏:文本("小龙女","小龙女",wb[sj(1,#wb)])
		elseif 编号 == 8 then
			wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
			wb[2] = "整天就是在这里看门，真是没什么意思，不过真让我休息的话我也还是找个地方待着睡觉。"
			wb[3] = "千年王八万年龟，我今年已经一万零八岁了。"
			wb[4] = "学游泳，找我就对了，价格实惠，包学包会#39"
			wb[5] = "这太尉不过是个有名无实的闲职罢了！"
			self.窗口.对话栏:文本("龟丞相","龟太尉",wb[sj(1,#wb)])
		elseif 编号 == 11 then
			wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
			wb[2] = "我这出去就是海底的迷宫了，里面有不少怪物，最好结伴而行。"
			wb[3] = "没事别老找我说话，找那老龟吧，他喜欢侃。"
			wb[4] = "嘿哟嘿哟！强身健体，为我龙宫健康工作一万年！"
			wb[5] = "真的蛤蟆勇士，敢于直面先天的缺陷。"
			self.窗口.对话栏:文本("蛤蟆精","蛤蟆勇士",wb[sj(1,#wb)])
		elseif 编号 == 14 then
			wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
			wb[2] = "海底地形复杂，当心可别迷了路。"
			wb[3] = "最近宫里丢了颗定颜珠，千岁正发愁呢。"
			wb[4] = "论智慧我比蟹将军高那么一点点，可是他比我多了好多手脚，所以比我升的快。"
			wb[5] = "八只脚，抬面鼓，两把剪刀鼓前舞，生来横行又霸道，嘴里常把泡沫吐。少侠猜猜是谁？#86"
			wb[6] = "不想当龙虾的虾不是好虾#40"
			self.窗口.对话栏:文本("虾兵","虾将军",wb[sj(1,#wb)])
		elseif 编号 == 16 then
			wb[1] = "小白龙真是个傻瓜，本公主略施小计就把他整的一点脾气也没有。"
			wb[2] = "九头虫怎么还不回来，不知道事情办妥了没有。"
			wb[3] = "龙族的法术玄妙无比，要苦心修习方能领悟。"
			wb[4] = "龙宫纵有千万般好处，可还是比不上我的乱石山碧波潭。"
			self.窗口.对话栏:文本("女人_万圣公主","万圣公主",wb[sj(1,#wb)])
		elseif 编号 == 18 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("蟹将","传送蟹将",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1507 then
		if 编号 == 1 then
			wb[1] = "你需要我送你去建邺城吗？"
			local xx = {"是的","我点错了"}
			self.窗口.对话栏:文本("蟹将","螃蟹精",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "这附近有条沉船，听说上面有不少宝贝#89"
			wb[2] = "你是怎么下来的#24现在的人胆子越来越大了。"
			wb[3] = "海边经常刮飓风，还是呆在这里安全。"
			self.窗口.对话栏:文本("蛤蟆精","蛤蟆精",wb[sj(1,#wb)],xx)
		elseif 编号 == "1_小海" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		elseif 编号 == "1_小毛" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		elseif 编号 == "1_小虫" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		elseif 编号 == "1_海毛虫长老" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		end
	elseif ID == 1508 then
		if 编号 == 1 then
			wb[1] = "你需要我送你去建邺城吗？"
			local xx = {"是的","我点错了"}
			self.窗口.对话栏:文本("虾兵","虾精",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "老子来去如风，你可别想抓到我"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 24) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("吸血鬼","妖风",wb[sj(1,#wb)])
		end
	elseif ID == 1509 then
		if 编号 == 1 then
			wb[1] = "哇，这艘船沉了多少年了，想不到还有人能找来。"
			wb[2] = "我要投胎……"
			wb[3] = "你问我为什么不走，不，我要守着这艘船，舱里还有我花大价钱买进的珠宝，那才是我的命啊。"
			wb[4] = "别看这沉船黑咕隆咚，各种珍奇宝贝可不少。"
			if self.红尘试炼 ~= nil and self.红尘试炼[1] == "商人的鬼魂" and (self.红尘试炼[2] == 21 or self.红尘试炼[2] == 27) and 已经在任务中 == nil then
				self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
				return
			end
			self.窗口.对话栏:文本("野鬼","商人的鬼魂",wb[sj(1,#wb)])
		end
	-- 江南野外
	elseif ID == 1193 then
		if 编号 == "1_树怪" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		elseif 编号 == "1_伐木之人" then
			self:获取任务对话(self.红尘试炼[1],self.红尘试炼[2],编号)
		end
	-- 长安事件
	elseif ID == 1001 then
		if 编号 == 7 then
			wb[1] = "我这里有一些奇珍异宝，你要买吗？"
			local xx = {"购买","我点错了"}
			self.窗口.对话栏:文本("男人_道士","罗道人",wb[sj(1,#wb)],xx)
		elseif 编号 == 8 then
			wb[1] = "每次进入染色界面需要消耗一颗彩果，你确定吗？"
			local xx = {"我想为人物染色","我点错了"}
			self.窗口.对话栏:文本("女人_染色师","染色师",wb[sj(1,#wb)],xx)
		elseif 编号 == 9 then
			wb[1] = "我可以送你去大唐国境，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		elseif 编号 == 10 then
			wb[1] = "我可以将你身上的神兽#R/（目前仅支持神兽）#W/的攻宠类型转换为法宠类型#R/（仅一次）#W/你确定吗？"
			local xx = {"是的我要转换","算了算了"}
			self.窗口.对话栏:文本("男人_道士","法宠认证人",wb[sj(1,#wb)],xx)
		elseif 编号 == 11 then
			wb[1] = "我可以帮你的角色免费进行洗点一次，你确定吗？（洗点将初始化所有点数，并返回潜力值）"
			local xx = {"是的我要为角色洗点一次","不了不了"}
			self.窗口.对话栏:文本("男人_道士","洗点人",wb[sj(1,#wb)],xx)
		elseif 编号 == 12 then
			wb[1] = "少侠请选择要为你传送的门派"
			local xx = {"方寸山","女儿村","神木林","化生寺","大唐官府","盘丝洞","阴曹地府","无底洞","魔王寨","狮驼岭","天宫","普陀山","凌波城","五庄观","龙宫"}
			self.窗口.对话栏:文本("男人_镖头","门派传送人",wb[sj(1,#wb)],xx)
		elseif 编号 == 13 then
			wb[1] = "我可以送你去战神山，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_太上老君","圣山传送人",wb[sj(1,#wb)],xx)
		elseif 编号 == 14 then
			wb[1] = "欢迎参加门派闯关竞赛活动，你是否已经叫齐伙伴准备闯关了？"
			local xx = {"准备好了，请告诉我们第一关的挑战地点","查看十五门派大闯关活动积分","兑换十五门派大闯关活动奖励","我只是来凑凑热闹"}
			self.窗口.对话栏:文本("男人_马副将","门派闯关使",wb[sj(1,#wb)],xx)
		elseif 编号 == 15 then
			wb[1] = " 欢迎参加寻梦追忆四季轮换活动，在这里你可以体验各种不同的玩法，可以通过本活动获得召唤兽装备等其他特殊物品奖励。"
			local xx = {"开始四季活动","结束四季活动","查看四季活动积分","兑换四季活动奖励","没有什么想玩的"}
			self.窗口.对话栏:文本("普陀山_接引仙女","四季轮转活动使",wb[sj(1,#wb)],xx)
		elseif 编号 == 25 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"秘境降妖","我点错了"}
			self.窗口.对话栏:文本("护卫","御林军左统领",wb[sj(1,#wb)],xx)
		elseif 编号 == 38 then
			wb[1] = "我这里可以办理关于账号的问题。"
			local xx = {"修改密码"}
			self.窗口.对话栏:文本("男人_店小二","账号服务",wb[sj(1,#wb)],xx)
		end
	-- 金銮殿
	elseif ID == 1044 then
		if 编号 == 1 then
			wb[1] = "盛世唐朝，尔等岂敢来犯。天佑我朝流芳千古！"
			local xx = {"保卫长安任务","查看保卫长安积分","兑换保卫长安奖励","我点错了"}
			self.窗口.对话栏:文本("考官2","魏征",wb[1],xx)
		elseif 编号 == 5 then
			local v = false
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 5 then
				wb[1] = "听说你要博彩诸家之长，将武学发挥到出神入化的境界。你需要证明你的能力，获得三大掌门人的推荐。"
				self.窗口.对话栏:文本("皇帝","李世民",wb[1])
				self.剧情开关.飞升[1] = 6
				self.窗口.任务栏:修改内容("飞升剧情",format("获得大唐官府的推荐；\n#L/◆获得化生寺的推荐；\n#L/◆获得女儿村的推荐；"))
				return false
			end
			wb[1] = "为选拔天下贤能之士，特在此举行御前科举大赛，会试入围的才子可以在金銮殿上进行殿试，所有参加殿试的才子都可按成绩获得一定的奖励和称谓"
			self.窗口.对话栏:文本("皇帝","李世民",wb[1],xx)
		end
	elseif ID == 1026 then
		if 编号 == 1 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"乌鸡国","我点错了"}
			self.窗口.对话栏:文本("男人_书生","吴举人",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1016 then
		if 编号 == 1 then
			wb[1] = "拉肚子，选好药，选药也要有诀窍。"
			wb[2] = "得了病要对症下药，可不能乱吃。"
			wb[3] = "是药三分毒，身体有恙，不可不吃药，也不可乱吃。"
			wb[4] = "方圆几十里的百姓抓药都要来我这里。"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_药店老板","药店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1110 then
		if 编号 == 1 then
			wb[1] = "大唐国境之内，鸟语花香，山清水秀，国泰民安，乃是一颇得上天福泽庇佑的所在"
			local xx = {"送我去凌波城","是吧我也这么觉得"}
			self.窗口.对话栏:文本("男人_土地","大唐国境土地",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "我可以送你去#R/普陀山#W/，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("普陀山_接引仙女","普陀山接引仙女",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			if self.剧情开关.进入副本 ~= false and self.剧情开关.进入副本[1] == "黑风山" then
				self.窗口.对话栏:文本("男人_店小二","小二","话说那镇山太保刘伯钦，怒喝一声，手举钢叉刺向老虎。但见怒气纷纷，狂风滚滚，人虎斗作一团，只吓得白面和尚缩在草堆里瑟瑟发抖……玄奘法师被刘猎户收留，今晚正要开灵堂为刘父超度呢。这位客官，你要去刘猎户家转转么？",{"那就去瞧瞧热闹","我还没准备好"},"副本选项")
				return false
			end
			wb[1] = "客官你是要打尖还是住店？"
			self.窗口.对话栏:文本("男人_店小二","小二",wb[sj(1,#wb)])
		end
	elseif ID == 1002 then
		if 编号 == 3 then
			wb[1] = "阁下我送你去长安吧"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_胖和尚","接引僧",wb[sj(1,#wb)],xx)
		elseif 编号 == 4 then
			wb[1] = "得即是失，失即是得，世事本是过往烟云，不必太过看重"
			wb[2] = "不可说，不可说"
			wb[3] = "苦海无边，回头是岸"
			wb[4] = "无色无相，无嗔无狂"
			self.窗口.对话栏:文本("男人_胖和尚","慧海",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "方丈又去碑林里净修了。"
			wb[2] = "不知道我什么时候才能熬到住持的位置。"
			wb[3] = "化瘀，还是疗伤？这是个问题。"
			wb[4] = "大悲无泪，大悟无言，大笑无声。"
			self.窗口.对话栏:文本("男人_胖和尚","慧悲",wb[sj(1,#wb)])
		elseif 编号 == 6 then
			wb[1] = "少侠捐献银两可以增加人气。你需要捐献吗？"
			self.窗口.对话栏:文本("空度禅师","空慈方丈",wb[sj(1,#wb)])
		elseif 编号 == 7 then
			wb[1] = "心静则万事静，心清则万事清。"
			wb[2] = "这位施主是来拜师学艺的吗？请到藏经阁找空度禅师。"
			wb[3] = "谁能告诉我小乘佛法与大乘佛法到底有何差异#47？"
			wb[4] = "宁静而致远。"
			self.窗口.对话栏:文本("男人_胖和尚","慧静",wb[sj(1,#wb)])
		elseif 编号 == 8 then
			wb[1] = "法明长老的病情越来越重了，这可如何是好……"
			wb[2] = "得即是失，失即是得，世事本是过眼烟云，不必太过看重。"
			wb[3] = "施主是来上香的吗？"
			wb[4] = "一花一世界，一叶一如来。"
			wb[5] = "身心清净方为道，退步原来是向前。"
			self.窗口.对话栏:文本("男人_胖和尚","慧明",wb[sj(1,#wb)])
		elseif 编号 == 2 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"水陆大会","我点错了"}
			self.窗口.对话栏:文本("男人_胖和尚","疥癞和尚",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1528 then
		if 编号 == 2 then
			wb[1] = "得即是失，失即是得，世事本是过往烟云，不必太过看重"
			wb[2] = "不可说，不可说"
			wb[3] = "施主是来上香的吗？"
			wb[4] = "随心、随缘、随性。"
			wb[5] = "一念愚即般若绝，一念智即般若生。"
			local xx = nil
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 1 then
				xx = {"飞升剧情","我随便看看"}
			end
			self.窗口.对话栏:文本("空度禅师","法明长老",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1043 then
		if 编号 == 1 then
			wb[1] = "我佛门心法只传授诚心向佛之士。"
			wb[2] = "学道有成，根本在悟。"
			wb[3] = "得即是失，失即是得，世事本是过眼烟云，不必太过看重。"
			wb[4] = "人生本在是非场，一生难免会有过。修真正道先修心，悟玄讲道渡世人。"
			wb[5] = "救人一命，胜造七级浮屠，这才是化生寺弟子天职所在。"
			wb[6] = "出家人要以慈悲为怀，善哉善哉。"
			wb[7] = "医生难医命终之人，佛陀难渡无缘的众生。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("空度禅师","空度禅师",wb[sj(1,#wb)],xx,"门派师傅")
		end
	elseif ID == 1054 then
		if 编号 == 1 then
			wb[1] = "俺的武艺不想带进棺材里，是该找个传人的时候了"
			wb[2] = "一屋不扫何以天下？修身与治国平天下同等重要。"
			wb[3] = "俺老程的三板斧可是天下有名的。"
			wb[4] = "大唐武艺，天下无双。弟子们江湖行走可别坏了师门的名声"
			wb[5] = "做了官还要天天上朝，真是麻烦。"
			wb[6] = "学本领要虚心，可不能浮躁自满。"
			wb[7] = "学会俺的一身本领，闯荡江湖绰绰有余。"
			local xx = {"交谈","给予","师门任务","学习技能"}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("程咬金","程咬金",wb[sj(1,#wb)],xx,"门派师傅")
		end
	elseif ID == 1198 then
		if 编号 == 2 then
			wb[1] = "我家老程的三板斧据说是在梦中学会的，我才不信呢。"
			wb[2] = "现在是太平盛世，百姓安居乐业。"
			wb[3] = "我家兄弟当初与老爷并肩作战，现如今也不知身在何处？"
			wb[4] = "听说老爷最近要远征歼杀突厥，真担心他的身子。"
			self.窗口.对话栏:文本("女人_程夫人","程夫人",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			wb[1] = "心比天高，命比纸薄，我的人生也会如此么？"
			wb[2] = "夫人什么时候再上街呢……好想再见到那个小哥一面#17"
			wb[3] = "我家老爷是开国功臣，现在正在广招门徒。"
			self.窗口.对话栏:文本("女人_丫鬟","丫鬟",wb[sj(1,#wb)],xx)
		elseif 编号 >= 4 and 编号 < 8 then
			wb[1] = "程老爷三板斧，你学到第几斧啦？"
			wb[2] = "能拜我们程老爷为师可是一种荣幸呢！"
			wb[3] = "府衙禁地，闲杂人等不得入内。"
			wb[4] = "这里是天子脚下，太平得很"
			wb[5] = "大唐首席弟子之争日趋白热。"
			self.窗口.对话栏:文本("护卫","程府护卫",wb[sj(1,#wb)],xx)
		elseif 编号 == 8 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("护卫","传送护卫",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1024 then
		if 编号 == 1 then
			wb[1] = "长风镖局广招天下英雄侠客押运镖银，武艺越高押送的镖银越贵重，报酬也更丰厚，不过预交的押金也自然要多些。"
			local xx = {"领取运镖任务","我只是来看看"}
			self.窗口.对话栏:文本("男人_镖头","郑镖头",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1028 then
		if 编号 == 1 then
			wb[1] = "别看我只是一个小二，长安消息可就数我最灵通了，最近在这里住店过往商人经常提起有强盗的事情，想不想听听？"
			local xx = {"听听无妨。。。","还是别多管闲事了。。。"}
			self.窗口.对话栏:文本("男人_店小二","店小二",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "客官远道而来辛苦了，我们酒店有干净舒适的客房，您休息后可完全回复气血和魔法。休息一次需要500两银子，对于20级以下的玩家，我们不收费"
			local xx = {"我要住店休息","我精神很好，不想住店"}
			self.窗口.对话栏:文本("男人_酒店老板","酒店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1020 then
		if 编号 == 1 then
			wb[1] = "长安武器店专卖0级和20级武器，0级和10级的武器则在建邺城出售。少侠记住了没#1"
			wb[2] = "瞧一瞧看一看了，我这里的武器最适合新人使用了。边上的老板出售高级一点的兵器，购买时请看清楚物品等级，别买错了哦#2"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_老孙头","武器店掌柜",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "客官想要什么兵器？"
			wb[2] = "行走江湖不能两手空空，来挑一件趁手的兵器吧。"
			wb[3] = "这里的风景还不错吧。"
			wb[4] = "少侠是来选购兵器的吧？请慢慢挑选，务必看清楚名称哦！"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_武器店老板","武器店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1017 then
		if 编号 == 1 then
			wb[1] = "这里出售的都是上等货色，主要是项链腰带一类。客官想买点什么？"
			wb[2] = "珍珠链，买三条，美过翡翠与玛瑙，锦绣饰品店欢迎你！"
			wb[3] = "既然来长安旅游，何不在本店买一件护身符留作纪念？"
			wb[4] = "价格很公道的，随便选几样吧。"
			wb[4] = "送些精致饰品给意中人，表示一下心意嘛"
			local xx = {"购买","我什么都不想做"}
			self.窗口.对话栏:文本("女人_赵姨娘","饰品店老板",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1022 then
		if 编号 == 1 then
			wb[1] = "人靠衣装马靠鞍，本店为您提供各种新款服装，就算不买也来看看吧。"
			wb[2] = "这里各种绸缎一应俱全，肯定有你想要的。只有大唐官府的玩家才能学会鉴定衣服的技能，而项链腰带的鉴定技能只有地府的玩家才能学。"
			wb[3] = "本店的服饰选用的都是上等丝绸布匹，做工细致，包您满意"
			wb[4] = "三分长相，七分打扮，挑件合身的衣服吧。店里的张裁缝可以让你提高裁缝熟练度。"
			wb[5] = "要自己做衣服请到那边的裁缝台吧，只收取您少量的加工费。"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_服装店老板","服装店老板",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "我裁剪的衣服，穿过的人没有说不好的！我一眼看过去，不用尺，就知道你的三围是多少！"
			local xx = {"咨询打造方法","有什么需要帮忙的（打工增加熟练度）","查看熟练度","我只是随便看看"}
			self.窗口.对话栏:文本("男人_服装店老板","张裁缝",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1030 then
		if 编号 == 1 then
			wb[1] = "我这里出售一些从异域传来的美味珍馐，你需要吗？"
			local xx = {"购买","我只是来看看"}
			self.窗口.对话栏:文本("男人_酒店老板","酒店老板",wb[sj(1,#wb)],xx)
		end
	-- 地府
	elseif ID == 1122 then
		if 编号 == 1 then
			wb[1] = "现在做鬼的也不安分，老是有出去闲逛的，你能帮我抓他们回来吗？"
			local xx = {"好的 我帮你。","不，我没有空"}
			self.窗口.对话栏:文本("男人_钟馗","城里的孩子",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			wb[1] = "要想人不知，除非己莫为。做坏事的人可是要下地狱的。"
			wb[2] = "地府有十八层地狱，关押那些生前做尽坏事的家伙。"
			wb[3] = "想要尝尝我这跟铁链子的威力么？"
			self.窗口.对话栏:文本("马面","马面",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "生是追梦人，死为追梦鬼。还记得当初的梦想么？"
			wb[2] = "地府有十八层地狱，关押那些前生坏事做尽的恶人。"
			self.窗口.对话栏:文本("兔子怪","兔子怪",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("僵尸","地遁鬼",wb[sj(1,#wb)],xx)
		elseif 编号 == 6 then
			wb[1] = "相见不如怀念，怀念不如忘记。"
			wb[2] = "喝下孟婆汤，过了奈何桥，前生的事就再与你无缘。"
			wb[3] = "孟婆汤有甘、苦、辛、酸、咸五种口味，少侠想要哪一种？"
			wb[4] = "听说地藏菩萨在广招门徒，年轻人想不想去学些本领？"
			self.窗口.对话栏:文本("女人_孟婆","孟婆",wb[sj(1,#wb)])
		end
	-- 森罗
	elseif ID == 1123  then
		if 编号 == 1 then
			wb[1] = "生死有命，富贵在天。拜师的请进内室，地藏菩萨正在招收门徒。"
			wb[2] = "阎王要你三更死，不敢留你过五更。"
			wb[3] = "人生切莫把心欺，神鬼昭彰放过谁？"
			wb[4] = "左执生死簿，右拿勾魂笔，赏善罚恶，管人生死——这说的就是老夫我啦#17"
			self.窗口.对话栏:文本("男人_判官","判官",wb[sj(1,#wb)],xx)
		else
			local name = ""
		    if 编号 == 2 then
		    	wb[1] = "我掌第五殿，司掌叫唤大地狱。凡押解到此殿者，押赴望乡台，令之闻见世上本家因罪恶遭殃各事。"
		    	name = "阎罗王"
		    elseif 编号 == 3 then
		    	wb[1] = "我掌第十殿，专司各殿解到鬼魂。辨明善恶，核定等级，发往转生。"
		    	name = "转轮王"
		    elseif 编号 == 4 then
		    	wb[1] = "我掌第一殿，司人世天寿生死，统管幽冥吉凶。"
		    	name = "秦广王"
		    elseif 编号 == 5 then
		    	wb[1] = "我掌第二殿，司掌活大地狱。凡在阳间伤人肢体，奸盗杀生者，推入此狱。"
		    	name = "初江王"
		    elseif 编号 == 6 then
		    	wb[1] = "我掌第三殿，司掌黑蝇大地狱。凡是人抗粮赖租，交易狡诈者，推入此狱。"
		    	name = "宋帝王"
		    elseif 编号 == 7 then
		    	wb[1] = "我掌第六殿，司掌打叫唤大地狱及枉死城。凡世人怨天尤地，对北溺变涕泣者，推入此狱。"
		    	name = "卞城王"
			elseif 编号 == 8 then
		    	wb[1] = "我掌第九殿，司掌打叫酆都城铁网阿鼻地狱。凡阳世杀人放火，战绞正法者，解到本殿。"
		    	name = "平等王"
			elseif 编号 == 9 then
		    	wb[1] = "我掌第七殿，司掌热恼地狱。凡阳世取骸合药，离人至戚者，推入此狱。"
		    	name = "泰山王"
		    elseif 编号 == 10 then
		    	wb[1] = "我掌第八殿，司掌大热恼大地狱，凡谢世不孝，使父母翁姑愁闷懊恼者，发入此狱。"
		    	name = "都市王"
		    elseif 编号 == 11 then
		    	wb[1] = "我掌第四殿，司掌合大地狱。凡阳世忤逆尊长，教唆兴讼者，推入此狱。"
		    	name = "忤官王"
		    end
		    wb[2] = "人世沉浮，根本寂灭。"
		    wb[3] = "天网恢恢，疏而不漏。"
		    wb[4] = "善恶到头，神鬼难欺。"
		    wb[5] = "天理昭彰，报应不爽。"
		    wb[6] = "因果循环，六道轮回。"
		    wb[7] = "临阵无退，杀身有择。"
		    self.窗口.对话栏:文本("阎罗王",name,wb[sj(1,#wb)],xx)
		end
	elseif ID == 1124 then
		if 编号 == 1 then
			wb[1] = "地狱不空，誓不成佛。"
			wb[2] = "修行贵在持之以恒，切忌浮躁自满。"
			wb[3] = "地府法术诡异玄妙，只传授有缘之人。"
			wb[4] = "地府弟子学有所成是师父我最大的心愿。"
			wb[5] = "要想在魔界扬名，还要多加历练才是啊。"
			wb[6] = "恶业将盈，地狱相现。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("地藏王","地藏王",wb[sj(1,#wb)],xx,"门派师傅")
		end
	-- 傲来
	elseif ID == 1092 then
		if 编号 == 1 then
			wb[1] = "我这里出售上好的鱼竿，如果打算钓鱼的话就买一根鱼竿去试试身手吧。"
			local xx = {"花费2000两购买鱼竿","兑换海产","太贵了我没钱"}
			self.窗口.对话栏:文本("男人_钓鱼","渔夫",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "我可以送你去东海湾你要不要去呢？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","船夫",wb[sj(1,#wb)],xx)
		elseif 编号 == 3 then
			wb[1] = "我可以送你去蓬莱仙岛你要不要去呢？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_诗中仙","仙岛引路人",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1095 then
		wb[1] = "听说世间最美的服饰出自月宫嫦娥之手。"
		wb[2] = "客官想要什么样的衣服？"
		wb[3] = "长木匠，短铁匠，不长不短是裁缝。"
		self.窗口.对话栏:文本("男人_服装店老板","牛师傅",wb[sj(1,#wb)],{"购买","我什么都不想做"})
	elseif ID == 1101 then
		if 编号 == 1 then
			wb[1] = "少侠是来选购兵器的吧？请慢慢挑选，务必看清楚名称哦！"
			wb[2] = "这里的风景还不错吧。"
			wb[3] = "客官想要什么兵器？"
			wb[4] = "行走江湖不能两手空空，来挑一件趁手的兵器吧。"
			local xx = {"购买","我什么都不想做"}
			self.窗口.对话栏:文本("男人_兰虎","杜天",wb[sj(1,#wb)],xx)
		end
	-- 北俱芦洲
	elseif ID == 1174 then
		if 编号 == 1 then
			wb[1] = "我可以送你去长寿郊外，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("兔子怪","地遁鬼",wb[1],xx)
		elseif 编号 == 2 then
			wb[1] = "我可以送你去女娲神迹，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("净瓶女娲","女娲神迹传送人",wb[1],xx)
		end
	-- 长寿郊外
	elseif ID == 1091 then
		if 编号 == 1 then
			wb[1] = "我可以送你去北俱芦洲，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[1],xx)
		elseif 编号 == 2 then
			wb[1] = "我可以送你去天宫，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_将军","传送天将",wb[1],xx)
		elseif 编号 == 3 then
			wb[1] = "我可以送你去大唐境外，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_土地","西牛贺洲土地",wb[1],xx)
		end
	-- 境外
	elseif ID == 1173 then
		if 编号 == 1 then
			wb[1] = "我可以送你去西牛贺洲，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_土地","大唐境外土地",wb[1],xx)
		elseif 编号 == 2 then
		    wb[1] = "我可以送你去碗子山，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_土地","碗子山土地",wb[1],xx)
		end
	-- 方寸山
	elseif ID == 1137 and 编号 == 1 then
		wb[1] = "难！难！难！道最玄，莫把金丹做等闲。不遇至人传妙诀，空言口困舌头干！"
		wb[2] = "天地玄黄修道德，宇宙洪荒炼元神；虎龙啸聚风云鼎，乌兔周旋卯酉晨。"
		wb[3] = "我方寸山的技艺只传授有缘之人"
		wb[4] = "修行贵在用心领悟，切忌轻浮自满。"
		wb[5] = "方寸何意，三星又何意，徒儿你可明白？"
		wb[6] = "修习之路没有捷径，踏平坎坷方能成大道。"
		local xx = {"交谈","给予","师门任务","学习技能",}
		if self.队伍[1].门派 == "无门派" then
			insert(xx,"拜师")
		end
		self.窗口.对话栏:文本("菩提祖师","菩提祖师",wb[sj(1,#wb)],xx,"门派师傅")
	-- 天宫
	elseif ID == 1111 then
		if 编号 == 1 then
			wb[1] = "我可以送你去西牛贺洲，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("天兵","守门天兵",wb[1],xx)
		elseif (编号 == 2 or 编号 == 3) then
			wb[1] = "天天在这里守门真是无聊死了，我也渴望冒险刺激的生活。"
			wb[2] = "整天有人来打听这打听那的，什么红琉璃白琉璃，当心我火了打你一顿。"
			wb[3] = "又要开蟠桃会了，我算算我守了多少年的门，自从我守门开始，已经开了2次蟠桃会了。"
			wb[4] = "天宫可是众仙云集之地，不是你想来就来，想走就走的！"
			wb[5] = "天宫重地，严禁喧哗！！"
			self.窗口.对话栏:文本("天兵","守门天兵",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "我可以送你去长安，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("芙蓉仙子","接引仙女",wb[1],xx)
		elseif 编号 == 8 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			self.窗口.对话栏:文本("天兵","守门天兵",wb[sj(1,#wb)],{"抓捕生肖","我点错了"})
		end
	elseif ID == 1112 then
		if 编号 == 1 then
			wb[1] = "下界有妖魔作乱，要多加防范才是。"
			wb[2] = "不知道嫦娥仙子如何喜欢我，唉，真是苦恼啊#14"
			wb[3] = "天庭也非清净之地，啥时能再回到我的灌江口？"
			wb[4] = "我就是英俊潇洒玉树临风天庭第一美男子二郎神#17"
			self.窗口.对话栏:文本("男人_二郎神","杨戬",wb[sj(1,#wb)])
		elseif 编号 == 2 then
			local v = false
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"避火诀") then
				v = true
			end
			if not v then
				wb[1] = "下界凡间遇到纷争可不要与他们一般见识，他们可是不讲理的。"
				wb[2] = "下界有妖魔作乱，要多加防范才是。"
				wb[3] = "天庭冷落，真想再回到人间。"
				wb[4] = "想成为天界的精英，是要下一番苦功夫的。"
				wb[5] = "修行贵在持之以恒，切记浮躁自满。"
				local xx = {"交谈","给予","师门任务","学习技能",}
				if self.队伍[1].门派 == "无门派" then
					insert(xx,"拜师")
				end
				self.窗口.对话栏:文本("李靖","李靖",wb[sj(1,#wb)],xx,"门派师傅")
			else
				self.剧情开关.飞升[2][1] = self.剧情开关.飞升[2][1] + 1
				insert(self.剧情开关.飞升[2][2],"避火诀")
				local v1 = 开关取内容("◆去#R/玉皇大帝#L/那获得仙界的试炼资格。","",取数组内容(self.剧情开关.飞升[2][2],"定海针") and 取数组内容(self.剧情开关.飞升[2][2],"避火诀") and 取数组内容(self.剧情开关.飞升[2][2],"炼金鼎") and 取数组内容(self.剧情开关.飞升[2][2],"修篁斧"))
				self.窗口.任务栏:修改内容("飞升剧情",format("去向#R/东海龙王#L/要定海针%s；\n#L/◆去向#R/李靖#L/要一本避火诀%s；\n#L/◆去向#R/镇元大仙#L/借下炼金鼎%s；\n#L/◆去向#R/观音姐姐#L/借吧修篁斧%s\n#L/%s",开关取内容("(完成)","",取数组内容(self.剧情开关.飞升[2][2],"定海针")),开关取内容("(完成)","",取数组内容(self.剧情开关.飞升[2][2],"避火诀")),开关取内容("(完成)","",取数组内容(self.剧情开关.飞升[2][2],"炼金鼎")),开关取内容("(完成)","",取数组内容(self.剧情开关.飞升[2][2],"修篁斧")),v1))
				self.窗口.对话栏:文本("李靖","李靖","既是玉帝有旨，我就给你吧，不可将此物传别人。")
				self.提示:写入("#Y/你获得了避火诀")
				self.提示:写入("#Y/你获得了10000经验")
				增加经验(10000)
				增加物品("避火诀")
			end
		elseif 编号 == 3 then
			if self.剧情开关.飞升 == false or self.剧情开关.飞升[1] ~= 3 then
				wb[1] = "作皇帝难，作玉皇大帝更难啊。"
				wb[2] = "那个什么九头虫献上的宝贝还真不错。"
				wb[3] = "其实我很怕我老婆的，很多事情都是她做主，但是话说回来，怕她，说明我爱她嘛#17你说是不是。"
				wb[4] = "汝等不来接受朕的考验，就别想飞升化境#99"
				wb[5] = "那猴子自从跟了唐三藏取经，好久都没消息了，也不知道现在行至何处？"
				local xx = {}
				if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 then
					insert(xx,"飞升剧情")
				end
				if #xx > 0 then
					insert(xx,"我点错了")
					self.窗口.对话栏:文本("男人_玉帝","玉皇大帝","我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。",xx)
					return false
				end
				self.窗口.对话栏:文本("男人_玉帝","玉皇大帝",wb[sj(1,#wb)])
			else
				wb[1] = "嗯，听太上老君说你潜心向道，有望打破玄关，登入化境。朕要考验你的诚心和能力，现在有四件事需要你去做。不知道你能行否？"
				self.窗口.对话栏:文本("男人_玉帝","玉皇大帝",wb[sj(1,#wb)],{"我可以","我再考虑下"},"飞升开关")
			end
		elseif 编号 == 4 then
			wb[1] = "我蟠桃园里的桃子可都是稀世珍品。"
			wb[2] = "谁这么大胆，偷走了我的九叶灵芝草#51"
			wb[3] = "蟠桃园的桃子长势喜人，今年又可以开一场盛大的蟠桃宴会了。"
			wb[4] = "猴子被佛祖降服以后，天界的日子总算太平了。"
			wb[5] = "仙魔两界向来水火不容，说什么神仙妖魔自由恋爱，哼，除非神仙都死光了。"
			self.窗口.对话栏:文本("女人_王母","王母娘娘",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "居然把火尖枪输给那个看门小神，那是师傅送我的枪啊#52我有何颜面去见师傅和父亲"
			wb[2] = "作为三坛海会大神，率领天兵去收降那猴子，却屡战屡败，真是惭愧！"
			wb[3] = "下界有妖魔作乱，要多加防范才是。"
			wb[4] = "天上一日，人间一年。下界许久没什么大动静，我待在这都快生锈了。"
			wb[5] = "莲藕为骨，荷叶为衣，我乃刀枪不入之躯。"
			self.窗口.对话栏:文本("男人_哪吒","哪吒",wb[sj(1,#wb)])
		end
	elseif ID == 1113 then
		if 编号 == 1 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"学习技能","我点错了"}
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 2 then
				xx = {"学习技能","飞升剧情","我点错了"}
			end
			self.窗口.对话栏:文本("男人_太上老君","太上老君",wb[sj(1,#wb)],xx)
		end
	-- 魔王
	elseif ID == 1512 then
		if 编号 == 1 or 编号 == 2 then
			wb[1] = "我们寨主就是人称平天大圣的牛魔王！"
			wb[2] = "别看齐天大圣厉害，见到我们大王还不一样得叫大哥！"
			wb[3] = "我们大王正在和九头虫喝酒呢。"
			wb[4] = "加入魔王寨，保你有吃有喝，没人敢再欺负你。"
			wb[5] = "自从大王修炼出了五火神焰印，我们寨子一下就人丁兴旺起来了#89"
			self.窗口.对话栏:文本("牛妖","守门牛妖",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("牛妖","传送牛妖",wb[sj(1,#wb)],xx)
		end
	--
	elseif ID == 1145 then
		if 编号 == 1 then
			wb[1] = "家家有本难念的经，本王一世英明，如今却家事缠身，可叹啊！"
			wb[1] = "你们谁瞧见了本王的避水金睛兽？"
			wb[1] = "学本领要专心，不能三天打渔，两天晒网。"
			wb[1] = "想称霸江湖不是那么容易，要专心修行才行。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("牛魔王","牛魔王",wb[sj(1,#wb)],xx,"门派师傅")
		end
	elseif ID == 1145 then
		if 编号 == 2 then
			wb[1] = "别想在我背后做坏事，我有十八只眼睛盯着你呢。"
			wb[2] = "只要我成为天命取经人取得真经，将来就能由魔转仙，哈哈哈哈#18"
			wb[3] = "小白龙估计已经被天谴了吧，哈哈哈哈。"
			wb[4] = "几天没见万圣公主了，可真想她啊#52"
			self.窗口.对话栏:文本("九头精怪","九头精怪",wb[sj(1,#wb)])
		end
	-- 普陀
	elseif ID == 1140 then
		if 编号 == 2 then
			wb[1] = "这里就是普陀山紫竹林了。"
			wb[2] = "你也是来拜见大慈大悲观世音菩萨的吗？#18"
			wb[3] = "菩萨最近正在招收徒，只有女性的仙族才收哦#0"
			wb[4] = "元宵节要到了，谁能陪我去长安城观灯？"
			wb[5] = "紫竹林风光无限好，我再也不愿回到水晶宫了。"
			self.窗口.对话栏:文本("小龙女","龙女宝宝",wb[sj(1,#wb)])
		elseif  编号 == 3 then
			wb[1] = "这里是观音大士清修之地，闲杂人等不得乱闯。"
			wb[2] = "比起暗无天日的黑风山，这里可真是清明自在之地啊。#18"
			wb[3] = "跟着观音姐姐，我总会有成仙的那天#89"
			self.窗口.对话栏:文本("黑熊精","黑熊怪",wb[sj(1,#wb)])
		elseif  编号 == 4 then
			wb[1] = "我可以送你去长安，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("普陀山_接引仙女","接引仙女",wb[sj(1,#wb)],xx)
		end
	-- 潮音洞
	elseif ID == 1141 then
		if 编号 == 1 then
			local v = false
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"修篁斧") and not 取数组内容(self.剧情开关.飞升[2][3],"修篁斧") then
				v = true
			end
			if not v then
				wb[1] = "观世间疾苦繁华，身身入耳，一一在心。"
				wb[2] = "我南海普陀山有救世正心之法，只传授给有缘之人。"
				wb[3] = "心欲若除，则万事可成，心无杂念，非外事可扰。"
				wb[4] = "佛祖有真经三藏，乃是修真之经，正善之门，可劝人为善。"
				wb[5] = "修行贵在持之以恒，切忌浮躁自满。"
				local xx = {"交谈","给予","师门任务","学习技能",}
				if self.队伍[1].门派 == "无门派" then
					insert(xx,"拜师")
				end
				self.窗口.对话栏:文本("观音姐姐","观音姐姐",wb[sj(1,#wb)],xx,"门派师傅")
			else
				insert(self.剧情开关.飞升[2][3],"修篁斧")
			    self.窗口.对话栏:文本("观音姐姐","观音姐姐","真是不巧呀。我将此物给了我的镇山大神黑熊精砍竹子去了。他们很厉害的，看看你能不能要的到了。")
			end
		elseif 编号 == 2 then
			wb[1] = "普陀山是观音姐姐清修之地，紫气蒸腾，烟围雾笼，景色可是十分奇秀。"
			wb[2] = "大慈与一切众生乐，大悲与一切众生苦。"
			wb[3] = "很多怪病奇毒只有仙家灵丹可以医治。"
			wb[4] = "欲朝普陀山，必度莲花池，穿过前面的莲池，便可见到观音姐姐了。"
			self.窗口.对话栏:文本("普陀山_接引仙女","青莲仙女",wb[sj(1,#wb)])
		end
	-- 五庄
	elseif ID == 1147 then
		local v = false
		if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"炼金鼎") and not 取数组内容(self.剧情开关.飞升[2][3],"炼金鼎") then
			v = true
		end
		if not v then
			wb[1] = "学了本领要用在正途，不许恃强凌弱。"
			wb[2] = "修行要注重基础，持之以恒，切忌好高骛远。"
			wb[3] = "想成为仙界的精英，还要下一番苦功夫啊～"
			wb[4] = "我观中的人参果树乃是混沌初分，鸿蒙初判，天地未开之际产成的灵根。"
			wb[5] = "师傅领进门，修行在个人。本门法术之精妙还望各位多多领悟。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			if self.剧情开关.飞升 ~= false and self.剧情开关.飞升[1] == 4 and not 取数组内容(self.剧情开关.飞升[2][2],"炼金鼎") and 取数组内容(self.剧情开关.飞升[2][3],"炼金鼎") then
				insert(xx,"飞升剧情")
			end
			self.窗口.对话栏:文本("镇元子","镇元子",wb[sj(1,#wb)],xx,"门派师傅")
		else
			insert(self.剧情开关.飞升[2][3],"炼金鼎")
			local a = self:取药品(3)
			local b = self:取药品(3)
			a = a[sj(1,#a)]
			b = b[sj(1,#b)]
			self.剧情开关.飞升[2][5] = {1147,"镇元子",a,b}
 			self.窗口.对话栏:文本("镇元子","镇元子",format("呵呵，想不到竟有人朝我这里宝贝，就是掀翻了老君八卦炉的孙猴子，想要我的人参果也不能白给，不过既然有玉帝旨意，就破例赏你这个面子，我现在炼丹炼到要紧处，缺两味药材%s和%s，你去取来，我自然把炼金鼎给你。",self.剧情开关.飞升[2][5][3],self.剧情开关.飞升[2][5][4]))
		end
	-- 狮驼岭
	elseif ID == 1131 then
		if (编号 == 1 or 编号 == 2) then
			wb[1] = "这里的三位大王各有一手看家本领，说出来怕会吓死你。"
			wb[2] = "我家的三个大王分别住在三个山洞里。"
			wb[3] = "加入我们狮驼岭，保证你有吃有喝，前途无量。"
			wb[4] = "我们狮驼岭的小妖，光是有名有姓的就有四万七八千。"
			wb[5] = "我家的三个大王神通广大，就是神仙来也得让着三分。"
			self.窗口.对话栏:文本("雷鸟人","守山小妖",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("雷鸟人","传送小妖",wb[sj(1,#wb)],xx)
		end
	-- 大象洞
	elseif ID == 1132 then
		if 编号 == 1 then
			wb[1] = "老牛又叫我去喝酒，好象九头虫也去了，我可不能让这酒虫把酒都喝光了才到。"
			wb[2] = "近来好象又招收了不少门徒，看来得扩充山头了。"
			wb[3] = "狮驼岭的武功博大精深，不是一两天就能领悟的，想要出人头地还需用心苦练。"
			wb[4] = "高级反震什么的，最讨厌了#47"
			self.窗口.对话栏:文本("二大王","二大王",wb[sj(1,#wb)])
		end
	-- 老雕洞
	elseif ID == 1133 then
		if 编号 == 1 then
			wb[1] = "听说佛祖挑选的天命取经人其中有一个是金蝉子转世，吃他一块肉能长生不老，真想尝尝啊。"
			wb[2] = "近来好象又招收了不少门徒，看来得扩充山头了。"
			wb[3] = "狮驼岭的武功博大精深，不是一两天就能领悟的，想要出人头地还需用心苦练。"
			wb[4] = "鹰击长空，能破敌军六将，狮驼弟子务必好好修习！"
			self.窗口.对话栏:文本("三大王","三大王",wb[sj(1,#wb)])
		end
	-- 狮王洞
	elseif ID == 1134 then
		if 编号 == 1 then
			wb[1] = "我们这里神仙都不敢来的。"
			wb[2] = "最近来投靠的人越来越多，得想法子扩大山头了。"
			wb[3] = "学本领要专一，不能三心二意。"
			wb[4] = "要想在魔界扬名，还要多下苦功夫才行#2"
			wb[5] = "人不可貌相。别看我的弟子们相貌不够英俊，他们可都是温柔贴贴的好男人呢。"
			wb[6] = "要做得山大王，空有一身蛮力是不够的。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("大大王","大大王",wb[sj(1,#wb)],xx,"门派师傅")
		end
	--盘丝
	elseif ID == 1513 then
		if 编号 == 1 then
			wb[1] = "盘丝洞几百年的规矩，不许男人入住，连收徒也只收女弟子。"
			wb[2] = "晶晶姑娘又发脾气了，把犯了门规的小妖挂在洞外七天七夜，差点咽了气。"
			wb[3] = "金琉璃最近老带着些人类女孩进进出出的，不知道在搞什么名堂。"
			wb[4] = "我已修行了千年，为何还未成仙？"
			wb[5] = "濯垢泉乃天然温泉，是姐妹们美容养颜的好去处#97"
			self.窗口.对话栏:文本("芙蓉仙子","女妖",wb[sj(1,#wb)])
		elseif 编号 == 2 then
			wb[1] = "我一直想验证一下，佛光中炼成的宝物，是不是也可以用恶魔之心加以感化呢？"
			wb[2] = "我从何处而生？又要去往何处？"
			wb[3] = "为什么，为什么我总感觉冥冥之中有几个声音在耳边，而那声音又那么象我自己？"
			wb[4] = "什么？你找女儿村的小姑娘？不认识！我从未去过女儿村！！"
			self.窗口.对话栏:文本("如意仙子","金琉璃",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "雨花桥边的芦花，不知是否已经飘飞？"
			wb[2] = "我娘找不到我一定担心死了。"
			wb[3] = "这是什么地方？我怎么会在这里？"
			wb[4] = "当我站在雨花桥边，觉得非常难过，我总觉得，应该是两个人站在这里。"
			wb[5] = "村里的姐妹都被妖怪抓去害死了，我好害怕"
			self.窗口.对话栏:文本("女人_丫鬟","栗栗儿",wb[sj(1,#wb)])
		elseif 编号 == 4 or 编号 == 5 then
			wb[1] = "我们洞主就是人称魔界一枝花的性感又感性的美女～春十三娘"
			wb[2] = "最近总在附近发现一些人类的骸骨，不知道又是谁吃东西没清理好。"
			wb[3] = "金姑娘就喜欢在亭子那里用餐，说是那里风景好，吃东西就吃东西，还用选什么风景。"
			wb[4] = "想拜见我们洞主么？找我就对了！"
			wb[5] = "盘丝岭的夕阳远望可谓梦幻中最美的风景。"
			self.窗口.对话栏:文本("树怪","看门小妖",wb[sj(1,#wb)])
		elseif 编号 == 6 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("蝴蝶仙子","引路小妖",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1144 then
		if 编号 == 1 then
			wb[1] = "桃花过处，寸草不生。很多年之后,我有个绰号，叫做桃花娘子……"
			wb[2] = "我有一项不传绝技，叫作“催情大法”。"
			wb[3] = "师妹对那个臭猴子还是念念不忘。"
			wb[4] = "在出道的时候，我认识一个人，他叫孙悟空，他后来有个绰号，叫齐天大圣。"
			wb[5] = "我盘丝洞的法术可不是轻易能学到手的。"
			wb[6] = "现在的孙猴子早就不是五百年前那个孙猴子了！"
			wb[7] = "往前算五百年，往后算五百年，没人的美貌能超越我#99"
			self.窗口.对话栏:文本("春十三娘","春十三娘",wb[sj(1,#wb)])
		elseif 编号 == 2 then
			wb[1] = "盘丝岭从不相信眼泪。"
			wb[2] = "师姐一直好像有什么心事。"
			wb[3] = "师妹对那个臭猴子还是念念不忘。"
			wb[4] = "要想在魔界扬名，还要多加历练才是啊。"
			wb[5] = "学本领要虚心，不可轻浮自满。"
			wb[6] = "今晚的月亮好亮，不知那猴子身在何处，可有想我？"
			wb[7] = "这里就是当年盘丝大仙修炼的地方。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("白晶晶","白晶晶",wb[sj(1,#wb)],xx,"门派师傅")
		end
	-- 凌波城
	elseif ID == 1150 then
		if 编号 == 1 then
			wb[1] = "能给我杨戬当徒儿的，都是人中龙凤。"
			wb[2] = "想听故事找你们那六个师叔去，为师忙得很！"
			wb[3] = "好久没和孙悟空那小子比试比试了，真是寂寞如雪啊。"
			wb[4] = "为师教给你的东西可都学会了？"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("二郎神","二郎神",wb[sj(1,#wb)],xx,"门派师傅")
		elseif 编号 == 2 then
			wb[1] = "啊呜啊呜……汪汪汪！"
			wb[2] = "天庭里那个二郎神长得好像和主人不是很像……"
			wb[3] = "跟随主人出生入死这么多年，我们一起经历了许多事情，不知道你想听我从那一件讲起呢？"
			self.窗口.对话栏:文本("哮天犬","哮天犬",wb[sj(1,#wb)])
		elseif 编号 == 3 or 编号 == 4 then
			wb[1] = "你整理一下形象再来进门，你这蓬头垢面的成何体统#4"
			wb[2] = "少侠，你没走错，这就大名鼎鼎，鼎鼎大名的凌波城了。"
			wb[3] = "喂……都说了没走错了，你怎么还不进门啊#4"
			self.窗口.对话栏:文本("天兵","守门天将",wb[sj(1,#wb)])
		elseif 编号 == 7 then
			wb[1] = "当年，真没想到跟大哥混还这么有前途#17"
			wb[2] = "哮天犬这小子最不厚道了，每次都是他给大哥惹麻烦#83"
			wb[3] = "我觉得大哥的优点就是长得帅#17"
			self.窗口.对话栏:文本("狂豹","荒芜星",wb[sj(1,#wb)])
		elseif 编号 == 8 then
			wb[1] = "真不明白大哥为什么和那个死猴子称兄道弟的#4"
			wb[2] = "天庭里的繁文缛节实在令人生厌#4"
			wb[3] = "天庭里的繁文缛节实在令人生厌#4"
			self.窗口.对话栏:文本("鲛人","刀砧星",wb[sj(1,#wb)])
		elseif 编号 == 9 then
			wb[1] = "我最喜欢的就是灌江口的涛声。"
			wb[2] = "小螃蟹爬来爬去，好像也挺开心的呢#86"
			wb[3] = "一晃好像过了很多年了，但是三界还是乱糟糟的……"
			self.窗口.对话栏:文本("羊头怪","反吟星",wb[sj(1,#wb)])
		elseif 编号 == 10 then
			wb[1] = "#75知不知道，能给大哥当徒弟，是你三生有幸！"
			wb[2] = "能跟大哥闯荡，真是畅快！"
			wb[3] = "天下之大，大哥要是称第二，就没人称第一#89"
			self.窗口.对话栏:文本("犀牛将军_人","天瘟星",wb[sj(1,#wb)])
		elseif 编号 == 11 then
			wb[1] = "这江水哗啦啦的声音最是扰人清梦#83"
			wb[2] = "小螃蟹爬来爬去真是烦死人了。"
			wb[3] = "好久都没去看外面的世界了，感觉有点寂寞啊#52"
			self.窗口.对话栏:文本("野猪精","伏断星",wb[sj(1,#wb)])
		elseif 编号 == 12 then
			wb[1] = "龙宫家的姑娘，长的还是挺好看的#17"
			wb[2] = "想知道你师父和龙宫家姑娘的故事么？问我就对啦！"
			wb[3] = "你要是真问我发生了什么，我也只能说个大概……"
			self.窗口.对话栏:文本("百足将军","破碎星",wb[sj(1,#wb)])
		elseif 编号 == 13 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("天兵","传送天将",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1138 then
		if 编号 == 2 then
			wb[1] = "远古的祖先留下训言，神木族将有三次灾祸，现如今巫神女之乱和虎魄之乱均已灵验，还有一次……"
			wb[2] = "咳咳，俺们神木林千百年来遵守于黄帝大人的约定，如今灾乱四起，不得不踏进江湖，这究竟是福还是祸……"
			self.窗口.对话栏:文本("巫师","云中月",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "小奴好想去外面的世界看看，可是族长叔叔说小奴还太小，不能踏出神木林#52小奴好想快点长大！"
			self.窗口.对话栏:文本("女人_云小奴","云小奴",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "#17三界如此多英雄侠士，不知道族长大哥是否允许我们对外联姻呢？"
			self.窗口.对话栏:文本("女人_满天星","满天星",wb[sj(1,#wb)])
		elseif 编号 == 1 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("巫师","引路族民",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1154 then
		if 编号 == 1 then
			wb[1] = "大家往来神木之上，切记这里的一草一木，均有神灵在，不可以随便踩到花花草草哦！"
			wb[2] = "我神木林一派擅长操控自然之灵，天地万物均可化为己用，但谨记必须对神灵心存敬畏，方能运用自如。"
			wb[3] = "神木林千百年幽闭在武神坛之上，现在打开门户广纳门派，来来往往热闹了许多，突然有点不习惯#17"
			wb[4] = "我违背先祖遗训，打开了神木林的大门，让我族法传承出去，这究竟是对是错，全看徒儿你们是否真能为三界安危尽一份力了……"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("巫奎虎","巫奎虎",wb[sj(1,#wb)],xx,"门派师傅")
		end
	elseif ID == 1228 then
		if 编号 == 1 then
			wb[1] = "我可以送你去无底洞，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_土地","碗子山土地",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1139 then
		if 编号 == 1 then
			wb[1] = "欢迎你来到神秘而美丽的无底洞#86"
			wb[2] = "我们无底洞里还有很多神秘的故事呢#86"
			wb[3] = "我最喜欢这些红花了，闻起来香喷喷的~~"
			self.窗口.对话栏:文本("幽萤娃娃","璎珞",wb[sj(1,#wb)])
		elseif 编号 == 2 then
			wb[1] = "我们似乎已经在此处待了很久很久了。"
			wb[2] = "红莲那丫头的性子，还是那么莽撞冲动，真是伤脑筋啊#83"
			wb[3] = "能来到这里，真是一段难得的缘分呢……"
			self.窗口.对话栏:文本("修罗傀儡妖","墨衣",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "我这么年轻美丽，一定是妹妹啦，你们说对不对#86"
			wb[2] = "你猜墨衣是我的姐姐还是我的妹妹#110"
			wb[3] = "其实我有点害怕姐姐呢，这么多年了，她一直都是那么严厉，比地涌夫人还凶#17"
			self.窗口.对话栏:文本("修罗傀儡妖","红莲",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("幽萤娃娃","接引小妖",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1156 then
		if 编号 == 1 then
			wb[1] = "不要叫我师父，请叫我女王大人。"
			wb[2] = "要想领悟我无底洞技能，可得勤学苦练。"
			wb[3] = "我的徒儿们，每一个都那么聪明伶俐。"
			wb[4] = "如今，像我这么美貌与智慧并重的好师傅可不多了"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("地涌夫人","地涌夫人",wb[sj(1,#wb)],xx,"门派师傅")
		elseif 编号 == 2 then
			wb[1] = "地涌姐姐说人家和她小时候长得很像呢#86"
			wb[2] = "有时候我也觉得怪孤单的，就去外面找璎珞一起玩儿#90"
			self.窗口.对话栏:文本("女人_灵鼠娃娃","灵鼠娃娃",wb[sj(1,#wb)])
		end
	elseif ID == 1135 then
		if 编号 == 2 then
			wb[1] = "这里就是灵台方寸山，斜月三星洞。"
			wb[2] = "当年大闹天宫的齐天大圣就是在这里学艺的。"
			wb[3] = "菩提祖师管教很严厉，如果拜在他的门下，可要严于律己。"
			wb[4] = "金木水火土,急急如律令！"
			self.窗口.对话栏:文本("男人_道士","觉明",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "听说菩提祖师在广招门徒，常有能人异士来拜师。"
			wb[2] = "若不回头，为何不忘？若已无缘，何必誓言！"
			wb[3] = "别离仿佛昨日，转眼却已经年。旧事依然，物是人非。"
			self.窗口.对话栏:文本("女人_丫鬟","灵儿",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "方寸山远离红尘，清净雅致，正适合修道炼丹。"
			wb[2] = "方寸山以用符出名，方寸山的弟子人人都会画两手符。"
			wb[3] = "修道贵在专心，一心向道才能学有所成。"
			wb[4] = "由迷茫到觉悟的境界即是觉岸。可是苦海无边，哪里才是岸啊？"
			wb[5] = "是谁在此喧哗？打扰了我的清修#4"
			self.窗口.对话栏:文本("男人_道士","觉案",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_道童","接引道童",wb[sj(1,#wb)],xx)
		end
	-- 女儿
	elseif ID == 1142 then
		if 编号 == 2 then
			wb[1] = "这里的孙婆婆很和蔼的，弟子们有不明白的地方，她总是耐心教导。"
			wb[2] = "长安城真的像姑娘们说得那样繁花似锦么？真想哪天去看一看。"
			wb[3] = "这里就是远近闻名的女儿村，拜师的话请找孙婆婆。"
			wb[4] = "鸳鸯双栖蝶双飞，满眼春色惹人醉。"
			self.窗口.对话栏:文本("女人_翠花","翠花",wb[sj(1,#wb)])
		elseif 编号 == 3 then
			wb[1] = "女儿村的姑娘们个个能歌善舞，我家女儿也一定要好好学学。"
			wb[2] = "最近村子里不太平啊，好多姑娘失踪，我女儿前天也不见了，真是急死了。"
			wb[3] = "女儿村的姑娘们个个生的俊俏，看着就让人喜爱啊！"
			wb[4] = "我的女儿是我唯一的依靠，我就盼着她能平平安安的生活，以后嫁个好人家。"
			self.窗口.对话栏:文本("女人_王大嫂","栗栗娘",wb[sj(1,#wb)])
		elseif 编号 == 4 then
			wb[1] = "青琉璃女侠是我的恩人，我一直在想着报答她。"
			wb[2] = "最近村子里失踪了好几个姑娘，家里人都担心死了，特别是那个栗栗儿的娘，天天在村子附近寻找女儿，真是作孽啊。"
			wb[3] = "婆婆传授的法术是用来防身用的，可不是用来逞强的。"
			self.窗口.对话栏:文本("普陀山_接引仙女","柳飞絮",wb[sj(1,#wb)])
		elseif 编号 == 5 then
			wb[1] = "上次红线童子送我了个木偶，真好玩，不过只有一个是不是太孤独了。下次再叫他送我个，两个人就不孤独了。"
			wb[2] = "你有什么新奇的玩具啊，绿儿一个人好无聊哦！"
			wb[3] = "我的意中人是个盖世英雄，他要陪我玩丢手绢，嗯，还要把他的糖糖分给我吃！"
			self.窗口.对话栏:文本("女人_绿儿","绿儿",wb[sj(1,#wb)])
		elseif 编号 == 6 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("女人_丫鬟","接引女使",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1143 then
		if 编号 == 1 then
			wb[1] = "我女儿村的技能只适合女弟子学习。"
			wb[2] = "不知道有多少弟子掌握了制出淬毒暗器的秘法？"
			wb[3] = "前几天教了村里的姑娘们一套法术，不知道修习的如何了。"
			wb[4] = "村里人口虽然不多，却个个都是貌美如花的绝世高手。"
			wb[5] = "修习贵在持之以恒，专心如始方能有所领悟。"
			local xx = {"交谈","给予","师门任务","学习技能",}
			if self.队伍[1].门派 == "无门派" then
				insert(xx,"拜师")
			end
			self.窗口.对话栏:文本("孙婆婆","孙婆婆",wb[sj(1,#wb)],xx,"门派师傅")
		end
	-- 五庄观
	elseif ID == 1146 then
		if 编号 == 1 then
			wb[1] = "我送阁下回长安吧。"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_道童","传送道童",wb[sj(1,#wb)],xx)
		end
	-- 西梁女国
	elseif ID == 1040 then
		if 编号 == 1 then
			wb[1] = "我可以送你去朱紫国，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			wb[1] = "少侠欲前往丝绸之路吗？"
			local xx = {"我去！我去！","我路过瞧瞧而已"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		end
	-- 丝绸之路
	elseif ID == 1235 then
		if 编号 == 1 then
			wb[1] = "我可以送你去西梁女国，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		end
	-- 麒麟山
	elseif ID == 1210 then
		if 编号 == 1 then
			wb[1] = "我可以送你去宝象国，你要去吗？"
			local xx = {"送我过去吧","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		end
	-- 蓬莱
	elseif ID == 1207 then
		if 编号 == 1 then
			wb[1] = "我可以送你去傲来国，你要去吗？"
			local xx = {"送我过去吧","我还要逛逛"}
			self.窗口.对话栏:文本("男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx)
		end
	-- 长寿村
	elseif ID == 1070 then
		if 编号 == 1 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"车迟斗法","我点错了"}
			self.窗口.对话栏:文本("男人_胖和尚","慧觉和尚",wb[sj(1,#wb)],xx)
		elseif 编号 == 2 then
			if self.剧情开关.跑环开始 == false then
				wb[1] = "您想……"
				local xx = {"我来领取任务链任务","我来取消任务链任务","我来查看任务链任务说明（第一次玩建议查看）","我什么都不想做"}
				self.窗口.对话栏:文本("男人_老书生","陆萧然",wb[sj(1,#wb)],xx)
			else
				if self.剧情开关.跑环[1] == "召唤兽" then
					local ab = self.剧情开关.跑环[2]
					if ab == "狸" then
						ab = "浣熊"
					end
					self:获取宝宝(ab)
					local ky = nil
					for i=1,#self.队伍[1].宝宝列表 do
					    if self.队伍[1].宝宝列表[i].模型 == ab and self.队伍[1].宝宝列表[i] ~= self.队伍[1].参战宝宝 then
					    	table.remove(self.队伍[1].宝宝列表,i)
					    	ky = true
					    end
					end
					if ky then
						引擎.跑环奖励(self.剧情开关.跑环[4],self.剧情开关.跑环[3],self.剧情开关.跑环[5])
						self.窗口.任务栏:删除("任务链")
						self.窗口.对话栏:文本("男人_老书生","陆萧然","这是给你的奖励，你还要继续下一环任务吗？",{"继续吧","我要休息一会"})
						self.剧情开关.跑环开始 = false
					else
					    self.窗口.对话栏:文本("男人_老书生","陆萧然","少侠请先完成你的任务")
					end
				end
			end
		elseif 编号 == 3 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"通天河","我点错了"}
			self.窗口.对话栏:文本("蝴蝶仙子","蝴蝶女",wb[sj(1,#wb)],xx)
		elseif 编号 == 4 then
			wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
			local xx = {"大闹天宫","我点错了"}
			self.窗口.对话栏:文本("男人_诗中仙","太白金星",wb[sj(1,#wb)],xx)
		end
	elseif ID == 1083 then
		wb[1] = "三分长相，七分打扮，挑件合身的衣服吧。店里的张裁缝可以让你提高裁缝熟练度。"
		wb[2] = "人靠衣装马靠鞍，本店为您提供各种新款服装，就算不买也来看看吧。"
		wb[3] = "这里各色绸缎一应俱全，肯定有你想要的。只有大唐官府的玩家才能学会鉴定衣服的技能，而项链腰带的鉴定技能只有地府的玩家才能学。"
		self.窗口.对话栏:文本("男人_服装店老板","裁缝张",wb[sj(1,#wb)],{"购买","我只是来看看"})
	elseif ID == 1085 then
		wb[1] = "这里的风景还不错吧。"
		wb[2] = "行走江湖不能两手空空，来挑一件趁手的兵器吧。"
		wb[3] = "少侠是来选购兵器的吧？请慢慢挑选，务必看清楚名称哦！"
		self.窗口.对话栏:文本("男人_武器店老板","武器店老板",wb[sj(1,#wb)],{"购买","我只是来看看"})
	elseif ID == 1114 then
		if 编号 == 1 then
			wb[1] = "目前来说，以你的修为已经到头了，如果想百尺竿头，更上一步的话，除非能入于化境！"
			local xx = {"什么是化境","我想入化境，请指点一二。","入化境后有什么变化？","我已经通过考验，请带我入与化境。","我点错了"}
			self.窗口.对话栏:文本("吴刚","吴刚",wb[sj(1,#wb)],xx)
		end
	end
	wb = nil
	xx = nil
	return false
end