--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
function 引擎.强盗战斗(贼王,名称,ID,编号)
	local floor = math.floor
	local ceil = math.ceil
	local 战斗表 = {}
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#引擎.场景.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + 引擎.场景.队伍[n].等级
	end
	平均等级 = floor(平均等级 / 数量)
	local 等级 = 引擎.场景:取进制等级(平均等级)+20
	local 属性表 = {}
	if not 贼王 then
		体力资质 = 1000
		防御资质 = 500
		攻击资质 = 500
		速度资质 = 800
		法力资质 = 1300
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*3+等级)*2))
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
		属性表[4] = ceil(平均等级*3+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级)/2)
		战斗表[1] = {名称,"强盗",平均等级,1.5,1200,900,6000,1200,1500,800,-1,nil,nil,{"连击","强力","否定信仰","必杀","反震","反击"},nil,nil,10000,属性表}
	else
		等级 = 等级 + 10
		体力资质 = 1500
		防御资质 = 600
		攻击资质 = 1000
		速度资质 = 1000
		法力资质 = 2000
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*3+等级)*2))
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
		属性表[4] = ceil(平均等级*3+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级)/2)
		战斗表[1] = {"贼王","山贼",平均等级,1.5,1200,900,6000,1200,1500,800,-1,nil,nil,{"高级吸血","高级强力","高级必杀","高级反震","连击"},nil,nil,10000,属性表}
	end
	引擎.场景.场景.战斗:进入战斗(战斗表,{[1]="宝图",[2]=ID,[3]=编号,[4]=贼王})
end