--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
local djg = 引擎.取等级怪
local drs = 引擎.取敌人信息
local random = 引擎.取随机整数
local floor = math.floor
local ceil 	= math.ceil
local min   = math.min

function 引擎.抓鬼战斗(ID,名称,模型,编号)
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	local tp = 引擎.场景
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	平均等级 = floor(平均等级 / 数量)
	local 等级 = 平均等级+20
	if 模型 == "僵尸" then
		体力资质 = 5000
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1000
		法力资质 = 1000
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*5+等级)*2*6)*6)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+等级*0.7)
	elseif 模型 == "牛头" then
	    体力资质 = 2500
		防御资质 = 1500
		攻击资质 = 1500
		速度资质 = 1000
		法力资质 = 500
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*4+等级)*2*6)*3)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+等级/2)
	elseif 模型 == "马面" then
	    体力资质 = 2500
		防御资质 = 500
		攻击资质 = 500
		速度资质 = 1000
		法力资质 = 3000
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*4+等级)*2*6)*3)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+等级*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*4+等级*1.6)
	elseif 模型 == "骷髅怪" then
	    体力资质 = 2500
		防御资质 = 500
		攻击资质 = 500
		速度资质 = 1000
		法力资质 = 3000
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级*3+等级)*2*6)*3)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
		属性表[4] = ceil(平均等级*2.5+等级)
		属性表[5] = ceil(速度资质*等级/500)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级)/2)
	elseif 模型 == "野鬼" then
	    体力资质 = 1000
		防御资质 = 1500
		攻击资质 = 1500
		速度资质 = 1000
		法力资质 = 3500
		属性表[1] = ceil((平均等级*体力资质/100+等级*2*6)*2)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/1000)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+平均等级*4+等级*1.6)
	end
	local 主鬼 = {名称,模型,等级-10,2,0,0,0,0,0,0,-1,nil,nil,{},nil,nil,10000,属性表}
	local 副鬼 = {}
	local 鬼表 = {}
	鬼表[1] = 主鬼
	local fgs = djg(min(random(0,等级+10),160))
	local fgs1 = djg(min(等级,160))
	local f = 0
	for n=2,6 do
		鬼表[n] = drs(fgs[random(1,#fgs)])
		鬼表[n][1] = 鬼表[n][1].."恶鬼"
		鬼表[n][3] = 等级
		鬼表[n][4] = 鬼表[n][4] - 1
		鬼表[n][11] = -1
	end
	if random(1,50) == 1 then
		鬼表[random(2,6)] = drs(fgs1[random(1,#fgs1)]+3)
	end
	tp.场景.战斗:进入战斗(鬼表,{[1]="抓鬼",[2]=ID,[3]=编号})
	 -- 名称   等级 条件 气血 魔法 命中 伤害 防御 速度 躲避 灵力 种类 染色方案 染色组 技能组 必带技能 模型组
end