--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
function 还价事件(地图ID,人物ID,名称,模型)
	-- 开启还价的行为模式  前五个是影响心情值，后3个是影响人气值的
	local 内容 = {"夸奖","装熟","贬低","讨价","砍价","恐吓","威胁","抢劫"}
	if 地图ID == 1028 and 名称 == "酒店老板" then

	end
end

function 还价事件树(地图ID,名称)
	local 事件树 = {
		["夸奖"] = {},
		["装熟"] = {},
		["贬低"] = {},
		["讨价"] = {},
		["砍价"] = {},
		["恐吓"] = {},
		["威胁"] = {},
		["抢劫"]= {},
	}
	if 地图ID == 1028 and 名称 == "酒店老板" then
		事件树.夸奖 = {[1]=""}
	end
end