--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
local tp     = 引擎.场景
local random = 引擎.取随机整数
local floor  = math.floor
local ceil   = math.ceil
local djg    = 引擎.取等级怪
local drs    = 引擎.取敌人信息
local min    = math.min
local format = string.format

local function 宝石()
	local ms = {"光芒石","月亮石","太阳石","舍利子","红玛瑙","黑宝石","神秘石"}
	return ms[random(1,#ms)]
end

local function 低级魔兽要诀()
	local ms = {"反震","吸血","反击","连击","飞行","驱怪","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"}
	return ms[random(1,#ms)]
end

function 引擎.活动奖励(活动)
	if 活动 == 1 then -- 远古
		local pj = tp:平均等级()
		local jy = floor(pj*200+(40+pj)*pj/50)
		local jq = floor(pj*51+pj*15)
		tp:增加经验(jy)
		if random(1,10) <= 4 then
			增加物品(宝石(),random(1,3))
			tp.提示:写入("#Y/你获得了一颗宝石")
		elseif random(1,10) <= 4 then
			增加物品("魔兽要诀",低级魔兽要诀())
			tp.提示:写入("#Y/你获得了一本魔兽要诀")
		end
		tp.金钱 = tp.金钱 + jq
		tp.储备 = (tp.储备 or 0) + jq*2
		tp.提示:写入(format("#Y/你获得了%d经验，%d金钱，%d储备金",jy,jq,jq*2))
	elseif 活动 == 2 then -- 十五门
		local pj = tp:平均等级()
		local jy = floor(pj*251+(40+pj)*pj/50)
		local jq = floor(pj*100+pj*15)
		tp:增加经验(jy)
		tp.金钱 = tp.金钱 + jq
		tp.储备 = tp.储备 + floor(jq*2)
		tp.提示:写入(format("#Y/你获得了经验%d，金钱%d，储备%d",jy,jq,jq*2))
		tp.剧情进度.十五门积分 = (tp.剧情进度.十五门积分 or 0) + 1
		tp.提示:写入("#Y/十五门派积分增加了一点")
		local sl = random(1,3)
		local bs = 宝石()
		local dj
		if random(1,10) <= 9 then
			dj = 1
		elseif random(1,10) <= 5 then
			dj = 2
		elseif random(1,10) <= 3 then
			dj = 3
		elseif random(1,10) == 1 then
			dj = 4
		elseif random(1,20) == 1 then
			dj = 5
		end
		for i=1,sl do
			增加物品(bs,dj)
		end
		tp.提示:写入("#Y/你获得了一颗宝石")
	end
end
function 引擎.活动事件(活动,名称,模型,编号)
	if 活动 == 1 then -- 远古
		tp.窗口.对话栏:文本(模型,名称,"被压地下上千年了，是谁放我出来的#18？",{"少废话，开打","青山不转，绿水长留，我们后会有期"},{名称,模型,编号})
	end
end
function 引擎.活动战斗(活动,名称,模型,编号)
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	平均等级 = floor(平均等级 / 数量)
	local 等级 = 平均等级+10
	local 技能模板 = {}
	local 最终列表 = {}
	if 活动 == 1 then -- 远古
		local fgs = djg(min(tp:取进制等级(random(1,tp.队伍[1].等级)),160))
		local 体力资质 = 4000
		local 防御资质 = 1500
		local 攻击资质 = 1500
		local 速度资质 = 1000
		local 法力资质 = 3500
		local 属性表 = {}
		属性表[1] = ceil(平均等级*体力资质/100)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+2*2*1.2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+2)*2*1.5)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+2*1.6))
		local 门派 = {"大唐官府","龙宫","狮驼岭"}
		门派 = 门派[random(1,3)]
		if 门派 == "大唐官府" then
			技能模板 = {"横扫千军","高级反震","高级防御","高级神迹"}
		elseif 门派 == "狮驼岭" then
			技能模板 = {"变身","狮搏","鹰击","高级反震","高级防御","高级神迹"}
		elseif 门派 == "龙宫" then
			技能模板 = {"龙卷雨击","龙腾","龙吟","高级反震","高级防御","高级神迹"}
		end
		最终列表[1] = {名称,模型,等级-10,2,0,0,0,0,0,0,-1,nil,nil,技能模板,true,nil,10000,属性表,2,门派}
		体力资质 = 1500
		防御资质 = 1200
		攻击资质 = 1300
		速度资质 = 1000
		法力资质 = 3000
		属性表 = {}
		属性表[1] = ceil(平均等级*体力资质/100)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+2*2*1.2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+2)*2*1.2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+2))
		for i=2,5 do
			local s = fgs[random(1,#fgs)]
			local mx = drs(s)
			最终列表[i] = {"远古"..mx[2].."喽啰",mx[2],等级-10,2,0,0,0,0,0,0,-1,nil,nil,mx[14],true,nil,10000,属性表,2}
		end
	end
	tp.场景.战斗:进入战斗(最终列表,{[1]="远古",[2]=名称,[3]=模型,[4]=编号})
end