--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2018-11-13 19:47:31
--======================================================================--
local tp = 引擎.场景
local floor = math.floor
local ceil =  math.ceil
local random = 引擎.取随机整数

function 引擎.门派大闯关战斗(事件,名称,模型,武器,染色组,门派)
	if 门派 == "盘丝岭" then
		门派 = "盘丝洞"
	end
	local 攻击资质;
	local 防御资质;
	local 体力资质;
	local 法力资质;
	local 速度资质;
	local 躲闪资质;
	local 属性表 = {}
	local 平均等级 = 0
	local 数量 = 0
	for n=1,#tp.队伍 do
		数量 = 数量 + 1
	    平均等级 = 平均等级 + tp.队伍[n].等级
	end
	平均等级 = floor(平均等级 / 数量)
	local 等级 = 平均等级+10
	local 技能模板 = {}
	local 小怪模板 = {}
	体力资质 = 2500
	防御资质 = 1000
	攻击资质 = 1500
	速度资质 = 1000
	法力资质 = 2000
	local 小怪属性表 = {}
	小怪属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6))
	小怪属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
	小怪属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
	小怪属性表[4] = ceil(平均等级+等级)
	小怪属性表[5] = ceil(速度资质*等级/800)
	小怪属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级))
	local 最终列表 = {}
	if 门派 == "化生寺" or 门派 == "阴曹地府" or 门派 == "普陀山" or 门派 == "无底洞" then
		体力资质 = 4500
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 1500
		法力资质 = 3000
		属性表 = {}
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级))
		if 门派 == "化生寺" then
			技能模板 = {"唧唧歪歪","推拿","活血","金刚护法","韦陀护法","金刚护体","一苇渡江","推气过宫"}
			小怪模型 = {"古代瑞兽","大力金刚","雨师"}
			for n=2,10 do
				local cb = {"泰山压顶","力劈华山","迟钝"}
				local ab = {"化生寺护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "阴曹地府" then
			技能模板 = {"还阳术","阎罗令","判官令"}
			小怪模型 = {"鬼将","马面","吸血鬼","野鬼","牛头","骷髅怪"}
			for n=2,10 do
				local cb = {"地狱烈火","惊心一剑","鬼魂术"}
				local ab = {"阴曹地府护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,true,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "普陀山" then
			技能模板 = {"杨柳甘露","日光华","紧箍咒","颠倒五行","靛沧海","地裂火","巨岩破","普渡众生","苍茫树"}
			小怪模型 = {"黑熊精","雾中仙","灵鹤"}
			for n=2,10 do
				local cb = {"水漫金山","善恶有报","法术暴击"}
				local ab = {"普陀山护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "无底洞" then
			技能模板 = {"移魂化骨","夺魄令","煞气诀","惊魂掌","摧心术","夺命咒","明光宝烛","地涌金莲"}
			小怪模型 = {"曼珠沙华","猫灵兽形","修罗傀儡鬼","蜃气妖"}
			for n=2,10 do
				local cb = {"奔雷咒","壁垒击破","强力","魔之心"}
				local ab = {"无底洞护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		end
	elseif 门派 == "大唐官府" or 门派 == "凌波城" or 门派 == "狮驼岭" or 门派 == "天宫"  then
		体力资质 = 5000
		防御资质 = 1000
		攻击资质 = 2000
		速度资质 = 1500
		法力资质 = 2000
		属性表 = {}
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级+等级))
		if 门派 == "大唐官府" then
			技能模板 = {"横扫千军","后发制人","破釜沉舟","杀气决","高级敏捷"}
			小怪模型 = {"天将","护卫"}
			for n=2,10 do
				local cb = {"连击","剑荡四方","嗜血追击"}
				local ab = {"大唐官府护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "凌波城" then
			技能模板 = {"翻江搅海","惊涛怒","浪涌","裂石","断岳势","天崩地裂","碎星决"}
			小怪模型 = {"狂豹人形","修罗傀儡鬼","巨力神猿"}
			for n=2,10 do
				local cb = {"强力","必杀"}
				local ab = {"凌波城护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "狮驼岭" then
			技能模板 = {"鹰击","象形","连环击","狮搏","变身"}
			小怪模型 = {"噬天虎","炎魔神","黑山老妖","雷鸟人"}
			for n=2,10 do
				local cb = {"连击","必杀"}
				local ab = {"狮驼岭护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "天宫" then
			技能模板 = {"五雷轰顶","天雷斩","百万神兵","镇妖","错乱","雷霆万钧","天神护体","天神护法"}
			小怪模型 = {"天将","雾中仙","天兵"}
			for n=2,10 do
				local cb = {"夜舞倾城","奔雷咒"}
				local ab = {"天宫护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		end
	elseif 门派 == "魔王寨" or 门派 == "神木林" or 门派 == "龙宫" then
		体力资质 = 5000
		防御资质 = 1000
		攻击资质 = 1000
		速度资质 = 1500
		法力资质 = 3500
		属性表 = {}
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+等级*2)
		属性表[3] = ceil(平均等级*攻击资质*(2+1.4)/750+(平均等级*2+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*4+等级*1.6))
		if 门派 == "魔王寨" then
			技能模板 = {"飞砂走石","三昧真火","牛劲"}
			小怪模型 = {"炎魔神","牛妖","蛤蟆精","噬天虎"}
			for n=2,10 do
				local cb = {"法术连击","地狱烈火"}
				local ab = {"魔王寨护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "神木林" then
			技能模板 = {"落叶萧萧","荆棘舞","尘土刃","冰川怒","雾杀","血雨","星月之惠","星月之惠"}
			小怪模型 = {"金身罗汉","混沌兽","长眉灵猴","蔓藤妖花"}
			for n=2,10 do
				local cb = {"法术波动","泰山压顶"}
				local a = 小怪模型[random(1,#小怪模型)]
				local c = nil
				if a == "金身罗汉" then
					c = true
				end
				local ab = {"神木林护卫",a,等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,c,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "龙宫" then
			技能模板 = {"龙卷雨击","龙腾","龙吟","双龙戏珠"}
			小怪模型 = {"虾兵","蟹将","龟丞相"}
			for n=2,10 do
				local cb = {"法术暴击","水漫金山"}
				local ab = {"龙宫护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		end
	elseif 门派 == "五庄观"or 门派 == "盘丝洞" or 门派 == "女儿村" or 门派 == "方寸山" then
		体力资质 = 5000
		防御资质 = 1000
		攻击资质 = 1500
		速度资质 = 2500
		法力资质 = 3000
		属性表 = {}
		属性表[1] = ceil((平均等级*体力资质/100+(平均等级+等级)*2*6)*2)
		属性表[2] = ceil(平均等级*防御资质*(2+1.4)/1143+(平均等级+等级)*2)
		属性表[3] = ceil(平均等级*防御资质*(2+1.4)/750+(平均等级+等级)*2)
		属性表[4] = ceil(平均等级+等级)
		属性表[5] = ceil(速度资质*等级/800)
		属性表[6] = ceil(平均等级*(法力资质+1666)/3333+(平均等级*2+等级))
		if 门派 == "五庄观" then
			技能模板 = {"飘渺式","日月乾坤","烟雨剑法","生命之泉"}
			小怪模型 = {"灵鹤","风伯","巡游天神"}
			for n=2,10 do
				local cb = {"力劈华山","地狱烈火"}
				local ab = {"五庄观护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "盘丝洞" then
			技能模板 = {"天罗地网","含情脉脉","勾魂","摄魄"}
			小怪模型 = {"狐狸精","花妖","蜘蛛精"}
			for n=2,10 do
				local cb = {"夜舞倾城","奔雷咒"}
				local ab = {"盘丝岭护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "女儿村" then
			技能模板 = {"红袖添香","楚楚可怜","满天花雨","雨落寒沙","莲步轻舞","如花解语"}
			小怪模型 = {"如意仙子","星灵仙子","雾中仙"}
			for n=2,10 do
				local cb = {"水漫金山","泰山压顶","地狱烈火"}
				local ab = {"女儿村护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		elseif 门派 == "方寸山" then
			技能模板 = {"五雷咒","催眠符","落魄符","追魂符","定身符","落雷符"}
			小怪模型 = {"净瓶女娲","灵符女娲","律法女娲"}
			for n=2,10 do
				local cb = {"善恶有报","上古灵符","须弥真言"}
				local ab = {"方寸山护卫",小怪模型[random(1,#小怪模型)],等级-20,2,0,0,0,0,0,0,-1,nil,nil,cb,nil,nil,8000,小怪属性表,1}
				最终列表[n] = ab
			end
		end
	end
	最终列表[1] =  {名称,模型,等级,2,0,0,0,0,0,0,-1,nil,nil,技能模板,true,武器,10000,属性表,2,门派}
	tp.场景.战斗:进入战斗(最终列表,{[1]="门派大闯关",[2]=名称})
end
