local 商城类 = class()
local mousea = 引擎.鼠标弹起
local tos = 引擎.取金钱颜色
local insert = table.insert
local remove = table.remove
local floor = math.floor
local move = table.move
local min = math.min
local max = math.max
local ceil = math.ceil
local tx = 引擎.取头像
local qmxs = 引擎.取模型
local ani = 引擎.取战斗模型
local qzdjy = 引擎.取锦衣模型
local qzdjys = 取锦衣身体模型
local zqj = 引擎.坐骑库
local 法宝经验={
	{469350,712000,2028000,4469000,8500000,14424000,22652000,33568000,47556000},
	{210268,472144,1082236,2237152,4133500,6967888,10936924,16237216,23065372,31618000,40000000,54683104},
	{199452,385616,790204,1544928,2781500,4631632,7227036,10699424,15180508,20802000,27695612,35993056,45826044,57326288,70625500},
	{1834389,2935112,4348503,6220896,8698625,11928024,16055427,21227168,27589581,35289000,44471759,55284192,67872633,82383416,98962875,117757344,138913157,1625976648},
}
local x类 = {"杂货","仙玉","金元宝2","折扣","宝宝","法宝","锦衣祥瑞","锦衣","足迹","祥瑞","足印","人物装备","宠物装备","杂货一类","杂货二类","金元宝宠物"}
local zts2,zts
local tp
local 临时资源包
local function 取灵气上限(等级)
  if 等级==1 then
    return 200
  elseif 等级==2 then
    return 300
  else
    return 500
  end
end

local function 取五行()
	local 五行_ = {"金","木","水","火","土"}
	return 五行_[取随机数(1,5)]
end

local function 商城取法宝(名称,等级)
  local 识别码=os.time().."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  随机序列=随机序列+1
  local 法宝数据={}
  local 道具 = 引擎.取物品(名称)
  法宝数据.名称=名称
  法宝数据.总类=1000
  法宝数据.分类=道具[3]
  法宝数据.使用=道具[5]
  法宝数据.特技=道具[6]
  法宝数据.气血=0
  法宝数据.魔法=取灵气上限(道具[3])
  法宝数据.角色限制=道具[7] or 0
  法宝数据.五行=取五行()
  法宝数据.伤害=道具[8] or 0
  法宝数据.当前经验=0
  法宝数据.升级经验=法宝经验[法宝数据.分类][1]
  法宝数据.识别码=识别码
  法宝数据.价格=1
  return 法宝数据
end
local 商品组 = {}
	商品组[18] = {杂货={},仙玉={},金元宝2={},折扣={},宝宝={},法宝={},金元宝宠物={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},人物装备={},宠物装备={},杂货一类={},杂货二类={}}

	商品组[18]["杂货"]={
	    {价格=1,可叠加=true,总类=9,名称="飞行符",分类=1,子类=1},
		{价格=1,可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=167,x=362},[6]={y=240,x=277},[8]={y=276,x=527}},地图=1001,子类=50,y=7,x=312,分类=2,次数=70,名称="红色合成旗"},
		{价格=1,可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}},地图=1092,子类=50,y=7,x=312,分类=2,次数=70,名称="黄色合成旗"},
		{价格=1,可叠加=false,总类=11,xy={[1]={y=203,x=141},[2]={y=183,x=33},[3]={y=74,x=52},[4]={y=14,x=107}},地图=1070,子类=50,y=7,x=312,分类=2,次数=70,名称="蓝色合成旗"},
		{价格=1,可叠加=false,名称="红色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="绿色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="蓝色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="白色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="黄色导标旗",总类=11,分类=1},
		{价格=1,可叠加=true,名称="一倍经验丹"},
		{价格=1,可叠加=true,名称="摄妖香"},
		{价格=1,可叠加=true,名称="洞冥草"},
		{价格=1,可叠加=true,名称="秘制红罗羹"},
		{价格=1,可叠加=true,名称="秘制绿罗羹"},
		{价格=1,可叠加=true,总类=4,名称="天眼通符",分类=2,子类=0},
		--{子类=1,总类=3,名称="超级金柳露",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","超级金柳露")+0,分类=2},
		{价格=1,子类=0,总类=3,名称="金柳露",分类=2},
		{价格=1,可叠加=true,名称="海马"},
		{价格=1,可叠加=true,名称="彩果"},
		{价格=1,可叠加=true,名称="金银锦盒"},
		{价格=1,可叠加=false,总类=13,子类="天覆阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="地载阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="风扬阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="云垂阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="龙飞阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="虎翼阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="鸟翔阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="蛇蟠阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="鹰啸阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		--{价格=1,可叠加=false,总类=13,子类="雷绝阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},

		--{可叠加=true,总类=9,名称="初级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","初级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="中级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","中级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="高级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","高级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="坐骑内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","坐骑内丹")+0,分类=1,子类=1},
	}

	商品组[18]["仙玉"]={
	    {价格=1,可叠加=true,子类=1,总类=5,名称="青龙石",分类=4},
		{价格=1,可叠加=true,子类=2,总类=5,名称="白虎石",分类=4},
		{价格=1,可叠加=true,子类=3,总类=5,名称="朱雀石",分类=4},
		{价格=1,可叠加=true,子类=4,总类=5,名称="玄武石",分类=4},
		{价格=1,可叠加=false,名称="附魔宝珠"},
		{价格=1,可叠加=false,名称="含沙射影",耐久=500,分类=60,总类=2000},
		{价格=1,可叠加=false,名称="回龙摄魂标",耐久=5000,分类=70,总类=2000},
		{价格=1,可叠加=false,名称="寸阴若梦",耐久=5000,分类=80,总类=2000},
		{价格=1,可叠加=false,名称="魔睛子",耐久=5000,分类=90,总类=2000},
		{价格=1,可叠加=false,名称="顺逆神针",耐久=5000,分类=100,总类=2000},

		{价格=1,可叠加=false,名称="太阳石礼包"},
		{价格=1,可叠加=false,名称="红玛瑙礼包"},
		{价格=1,可叠加=false,名称="舍利子礼包"},
		{价格=1,可叠加=false,名称="光芒石礼包"},
		{价格=1,可叠加=false,名称="黑宝石礼包"},
		{价格=1,可叠加=false,名称="月亮石礼包"},
		{价格=1,可叠加=false,名称="神秘石礼包"},
		{价格=1,可叠加=false,名称="星辉石礼包"},

		-- {可叠加=false,名称="90级装备礼包",价格=1},
		-- {可叠加=false,名称="100级装备礼包",价格=1},
		-- {可叠加=false,名称="120级装备礼包",价格=1},
		-- {可叠加=false,名称="130级装备礼包",价格=1},
		-- {可叠加=false,名称="140级装备礼包",价格=1},
		-- {可叠加=false,名称="150级装备礼包",价格=1},
		{价格=1,可叠加=false,名称="160级装备礼包"},
		--{可叠加=false,名称="160级高级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","160级高级装备礼包")+0},
		--{可叠加=false,名称="跨服专属礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","跨服专属礼包")+0},
		--{可叠加=false,名称="120级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级随机灵饰指南书")+0},
		--{可叠加=false,名称="140级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机灵饰指南书")+0},
		--{价格=1,特效="耳饰",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="戒指",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="手镯",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="佩饰",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="耳饰",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="戒指",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="手镯",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="佩饰",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{可叠加=false,名称="120级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级元灵晶石")+0},
		--{可叠加=false,名称="140级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级元灵晶石")+0},
		{价格=1,可叠加=false,名称="160级元灵晶石"},
		-- {可叠加=false,名称="摇钱树苗",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","小额银票")+0},
		{价格=1,可叠加=false,名称="碎星锤"},
		{价格=1,可叠加=false,名称="超级碎星锤"},
		{价格=1,可叠加=false,名称="珍珠",总类=5,分类=6,级别限制=160},
		{价格=1,可叠加=false,名称="融合石",总类=5,分类=6,子类=9},
		--{可叠加=false,名称="制造指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机指南书")+0},
		{价格=1,可叠加=false,名称="随机制造指南书"},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=60},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=70},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=80},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=90},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=100},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=110},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=120},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=130},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=140},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=150},
		--{可叠加=false,名称="140级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机指南书")+0},
		--{可叠加=false,名称="150级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","150级随机指南书")+0},

		{价格=1,可叠加=false,名称="神兵图鉴",总类=4,分类=2,子类=180},
		{价格=1,可叠加=false,名称="灵宝图鉴",总类=4,分类=2,子类=180},
		{价格=1,可叠加=true,名称="空白强化符"},
		{价格=0,总类=55,识别码="4_1598948961_552_21000010086",耐久度=150,等级=1,颜色="红色",子类=1,法术防御=1,名称="电符石",分类=1},
        {价格=0,总类=55,耐久度=150,等级=1,颜色="红色",子类=1,识别码="4_1598948945_416_21000010086",名称="冰符石",分类=1,体质=1},
        {价格=0,总类=55,耐久度=150,名称="雷符石",等级=1,颜色="红色",子类=1,识别码="4_1598948957_841_21000010086",敏捷=1,分类=1},
        {价格=0,总类=55,耐久度=150,等级=1,颜色="红色",子类=1,识别码="4_1598948953_828_21000010086",耐力=1,名称="土符石",分类=1},
        {价格=0,魔力=1,总类=55,耐久度=150,等级=1,颜色="黄色",子类=1,识别码="4_1598948965_60_21000010086",名称="风符石",分类=2},
        {价格=0,总类=55,耐久度=150,力量=1,等级=1,颜色="黄色",子类=1,识别码="4_1598948969_364_21000010086",名称="炎符石",分类=2},
        {价格=0,总类=55,法术伤害=1,耐久度=150,等级=1,颜色="黄色",子类=1,识别码="4_1598948973_871_21000010086",名称="火符石",分类=2},

        {价格=0,防御=3,总类=55,耐久度=150,等级=2,颜色="红色",子类=1,识别码="4_1598949148_771_21000010086",名称="碧玉符石",分类=1},
        {价格=0,总类=55,命中=4,耐久度=150,等级=2,颜色="蓝色",子类=1,识别码="4_1598949151_914_21000010086",名称="金光符石",分类=3},
        {价格=0,总类=55,耐久度=150,等级=2,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598949156_63_21000010086",名称="天神符石",分类=3},
        {价格=0,总类=55,耐久度=150,灵力=1.5,等级=2,颜色="绿色",子类=1,识别码="4_1598949160_549_21000010086",名称="飘渺符石",分类=4},
        {价格=0,总类=55,识别码="4_1598949185_405_21000010086",耐久度=150,等级=2,颜色="绿色",子类=1,魔法=6,名称="天仙符石",分类=4},
        {价格=0,总类=55,耐久度=150,速度=1.5,等级=2,颜色="绿色",子类=1,识别码="4_1598949189_582_21000010086",名称="霞光符石",分类=4},
        {价格=0,总类=55,耐久度=150,躲避=3,等级=2,颜色="绿色",子类=1,识别码="4_1598949194_627_21000010086",名称="逍遥符石",分类=4},

	    {价格=0,总类=55,识别码="4_1598947678_143_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,魔法=6,名称="虹珀符石",分类=3,体质=1},
	    {价格=0,总类=55,命中=4,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947783_254_21000010086",名称="陌影符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598947789_800_21000010086",名称="北冥符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,等级=3,颜色="蓝色",防御=3,子类=1,识别码="4_1598947793_900_21000010086",名称="灵月符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,速度=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947798_795_21000010086",名称="锦瑟符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,躲避=3,等级=3,颜色="蓝色",子类=1,识别码="4_1598947802_347_21000010086",名称="银光符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,灵力=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947807_608_21000010086",名称="清心符石",分类=3,体质=1},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947811_343_21000010086",名称="星辰符石",分类=3,体质=1},
	    {价格=0,总类=55,识别码="4_1598947816_785_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,法术防御=2,名称="雪月符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="蓝色",子类=1,识别码="4_1598947820_642_21000010086",名称="玄魂符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,名称="乾坤符石",等级=3,颜色="蓝色",子类=1,识别码="4_1598947824_811_21000010086",耐力=1,气血=10,分类=3},
	    {价格=0,总类=55,识别码="4_1598947829_604_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,魔法=6,耐力=1,名称="珍珀符石",分类=3},
	    {价格=0,总类=55,命中=4,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947846_143_21000010086",耐力=1,名称="银竹符石",分类=3},
	    {价格=0,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598947851_666_21000010086",耐力=1,名称="神川符石",分类=3},
	    {价格=0,总类=55,耐久度=150,速度=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947860_279_21000010086",耐力=1,名称="玲珑符石",分类=3},
	    {价格=0,总类=55,耐久度=150,躲避=3,等级=3,颜色="蓝色",子类=1,识别码="4_1598947864_793_21000010086",耐力=1,名称="暮影符石",分类=3},
	    {价格=0,总类=55,耐久度=150,灵力=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947874_858_21000010086",耐力=1,名称="天珍符石",分类=3},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947884_460_21000010086",耐力=1,名称="九影符石",分类=3},
	    {价格=0,总类=55,识别码="4_1598947889_494_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,法术防御=2,耐力=1,名称="百冥符石",分类=3},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="蓝色",子类=1,识别码="4_1598947898_389_21000010086",耐力=1,名称="莫念符石",分类=3},

	   	{价格=0,魔力=1,总类=55,命中=4,耐久度=150,等级=3,颜色="白色",子类=1,识别码="4_1598948373_851_21000010086",名称="玄羽符石",分类=5},
	   	{价格=0,魔力=1,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="白色",子类=1,识别码="4_1598948409_179_21000010086",名称="流风符石",分类=5},
	    {价格=0,魔力=1,总类=55,识别码="4_1598948405_406_21000010086",耐久度=150,等级=3,颜色="白色",子类=1,法术防御=2,名称="子蚀符石",分类=5},
	    {价格=0,魔力=1,总类=55,识别码="4_1598948401_771_21000010086",耐久度=150,等级=3,颜色="白色",子类=1,魔法=6,名称="昔光符石",分类=5},
	   	{价格=0,魔力=1,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="白色",子类=1,识别码="4_1598948397_569_21000010086",名称="圣火符石",分类=5},
	    {价格=0,魔力=1,总类=55,耐久度=150,名称="醉魂符石",等级=3,颜色="白色",子类=1,识别码="4_1598948368_86_21000010086",气血=10,分类=5},
	    {价格=0,魔力=1,总类=55,耐久度=150,躲避=3,等级=3,颜色="白色",子类=1,识别码="4_1598948392_762_21000010086",名称="紫晶符石",分类=5},
	  	{价格=0,魔力=1,总类=55,耐久度=150,速度=1.5,等级=3,颜色="白色",子类=1,识别码="4_1598948388_371_21000010086",名称="无极符石",分类=5},
	    {价格=0,总类=55,识别码="4_1598948440_792_21000010086",耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,法术防御=2,名称="九凤符石",分类=6},
	    {价格=0,魔力=1,总类=55,耐久度=150,防御=3,等级=3,颜色="白色",子类=1,识别码="4_1598948383_860_21000010086",名称="无相符石",分类=5},
	   	{价格=0,魔力=1,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="白色",子类=1,识别码="4_1598948377_546_21000010086",名称="霸风符石",分类=5},

	    {价格=0,总类=55,耐久度=150,灵力=1.5,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948435_325_21000010086",名称="流魂符石",分类=6},
	    {价格=0,总类=55,耐久度=150,躲避=3,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948431_628_21000010086",名称="苍玉符石",分类=6},
	    {价格=0,总类=55,耐久度=150,速度=1.5,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948427_537_21000010086",名称="降龙符石",分类=6},
	    {价格=0,总类=55,识别码="4_1598948417_334_21000010086",耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,魔法=6,名称="素影符石",分类=6},
	    {价格=0,总类=55,耐久度=150,名称="地炎符石",力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948413_644_21000010086",气血=10,分类=6},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948454_360_21000010086",名称="南夕符石",分类=6},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948444_856_21000010086",名称="墨陀符石",分类=6},
	    {价格=0,防御=3,总类=55,耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948422_632_21000010086",名称="燕灵符石",分类=6},

	    {价格=0,耐久度=150,总类=55,气血=10,名称="引幽符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948463_150_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,命中=4,名称="铃星符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948768_310_21000010086",敏捷=1,分类=7},
	    {价格=0,防御=3,总类=55,耐久度=150,名称="召影符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948793_83_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,固定伤害=2,名称="七情符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948789_489_21000010086",敏捷=1,分类=7},
	    {价格=0,识别码="4_1598948762_592_21000010086",总类=55,耐久度=150,名称="波涛符石",等级=3,颜色="紫色",子类=1,魔法=6,敏捷=1,分类=7},
	    {价格=0,识别码="4_1598948785_206_21000010086",总类=55,耐久度=150,名称="两仪符石",等级=3,颜色="紫色",子类=1,法术防御=2,敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,法术伤害=2,名称="幽月符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948780_427_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,灵力=1.5,名称="乱花符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948776_653_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,等级=3,名称="狂念符石",伤害=1.5,颜色="紫色",子类=1,识别码="4_1598948772_116_21000010086",敏捷=1,分类=7},




		-- {可叠加=false,名称="内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","内丹",价)+0,总类=1001},
		-- {可叠加=false,名称="天蚕丝",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天蚕丝")+0,总类=1001},
		-- {可叠加=false,名称="玄龟板",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","玄龟板")+0,总类=1001},
		-- {可叠加=false,名称="阴沉木",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","阴沉木")+0,总类=1001},
		-- {可叠加=false,名称="麒麟血",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","麒麟血")+0,总类=1001},
		-- {可叠加=false,名称="金凤羽",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","金凤羽")+0,总类=1001},
		-- {可叠加=false,名称="补天石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","补天石")+0,总类=1001},
		-- {可叠加=false,名称="龙筋",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","龙筋")+0,总类=1001},
	}
	商品组[18]["折扣"]={
		{价格=1,可叠加=true,名称="月华露",阶品=5000},
		{价格=1,可叠加=true,名称="易经丹"},
		{价格=1,可叠加=true,名称="玉葫灵髓"},
		{价格=1,可叠加=true,名称="清灵净瓶"},
		{价格=1,可叠加=true,名称="元宵",食材="芝麻沁香"},
		{价格=1,可叠加=true,名称="元宵",食材="桂花酒酿"},
		{价格=1,可叠加=true,名称="元宵",食材="细磨豆沙"},
		{价格=1,可叠加=true,名称="元宵",食材="蜜糖腰果"},
		{价格=1,可叠加=true,名称="元宵",食材="山楂拔丝"},
		{价格=1,可叠加=true,名称="元宵",食材="滑玉莲蓉"},
		{价格=1,可叠加=true,名称="炼兽真经"},
		{价格=1,可叠加=false,名称="高级召唤兽内丹"},
		{价格=1,可叠加=false,名称="召唤兽内丹"},
		--{价格=1,可叠加=false,名称="炼妖石",分类=3,级别限制=140},
		{价格=1,可叠加=false,名称="天眼珠",总类=3,分类=11,灵气=100,级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="项圈",级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="护腕",级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="铠甲",级别限制=160},
		{价格=1,可叠加=false,名称="点化石",技能="力劈华山"},
		{价格=1,可叠加=false,名称="点化石",技能="善恶有报"},
		{价格=1,可叠加=false,名称="点化石",技能="地狱烈火"},
		{价格=1,可叠加=false,名称="点化石",技能="水漫金山"},
		{价格=1,可叠加=false,名称="点化石",技能="奔雷咒"},
		{价格=1,可叠加=false,名称="点化石",技能="泰山压顶"},
		{价格=1,可叠加=false,名称="魔兽要诀"},
		{价格=1,可叠加=false,名称="高级魔兽要诀"},
		--{价格=1,可叠加=true,名称="魔兽残卷"},
		{价格=0,附带技能="迅敏",总类=3,子类=0,识别码="4_1598949402_73_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="狂怒",总类=3,子类=0,识别码="4_1598949414_220_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="阴伤",总类=3,子类=0,识别码="4_1598949418_339_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="静岳",总类=3,子类=0,识别码="4_1598949422_974_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="擅咒",总类=3,子类=0,识别码="4_1598949425_430_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="灵身",总类=3,子类=0,识别码="4_1598949430_710_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="矫健",总类=3,子类=0,识别码="4_1598949434_614_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="深思",总类=3,子类=0,识别码="4_1598949438_844_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="钢化",总类=3,子类=0,识别码="4_1598949442_563_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="坚甲",总类=3,子类=0,识别码="4_1598949448_734_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="慧心",总类=3,子类=0,识别码="4_1598949453_562_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="撞击",总类=3,子类=0,识别码="4_1598949457_725_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="无畏",总类=3,子类=0,识别码="4_1598949461_351_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="愤恨",总类=3,子类=0,识别码="4_1598949465_46_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="淬毒",总类=3,子类=0,识别码="4_1598949470_706_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="狙刺",总类=3,子类=0,识别码="4_1598949474_948_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="连环",总类=3,子类=0,识别码="4_1598949483_646_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="圣洁",总类=3,子类=0,识别码="4_1598949488_219_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="灵光",总类=3,子类=0,识别码="4_1598949493_364_31000010086",名称="召唤兽内丹",分类=3},

		{价格=0,附带技能="隐匿击",总类=3,子类=0,识别码="4_1598949699_693_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="腾挪劲",总类=3,子类=0,识别码="4_1598949649_734_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="双星爆",总类=3,子类=0,识别码="4_1598949691_152_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="通灵法",总类=3,子类=0,识别码="4_1598949687_613_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="电魂闪",总类=3,子类=0,识别码="4_1598949682_547_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="舍身击",总类=3,子类=0,识别码="4_1598949678_284_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="凛冽气",总类=3,子类=0,识别码="4_1598949674_152_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="阴阳护",总类=3,子类=0,识别码="4_1598949669_825_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="神机步",总类=3,子类=0,识别码="4_1598949645_906_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="碎甲刃",总类=3,子类=0,识别码="4_1598949665_626_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="玉砥柱",总类=3,子类=0,识别码="4_1598949662_47_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="龙胄铠",总类=3,子类=0,识别码="4_1598949657_911_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="玄武躯",总类=3,子类=0,识别码="4_1598949653_249_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="血债偿",总类=3,子类=0,识别码="4_1598949709_558_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="生死决",总类=3,子类=0,识别码="4_1598949703_265_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="催心浪",总类=3,子类=0,识别码="4_1598949695_967_31000010086",名称="高级召唤兽内丹",分类=3},

	}
	商品组[18]["金元宝2"]={

	}
	商品组[18]["金元宝宠物"]={
        {价格=800,模型="进阶琴仙",名称="进阶琴仙",类型="神兽"},
        {价格=800,模型="飞天",名称="飞天",类型="神兽"},

        {价格=800,模型="神狗",名称="神狗",类型="神兽"},
        {价格=800,模型="超级神狗",名称="超级神狗",类型="神兽"},
        {价格=800,模型="神鼠",名称="神鼠",类型="神兽"},
        {价格=800,模型="超级神鼠",名称="超级神鼠",类型="神兽"},

         {价格=800,模型="神猪",名称="神猪",类型="神兽"},
         {价格=800,模型="超级神猪",名称="超级神猪",类型="神兽"},
         {价格=800,模型="小白龙",名称="小白龙",类型="神兽"},
         {价格=800,模型="超级小白龙",名称="超级小白龙",类型="神兽"},
         {价格=800,模型="猪小戒",名称="猪小戒",类型="神兽"},
         {价格=800,模型="超级猪小戒",名称="超级猪小戒",类型="神兽"},
         {价格=800,模型="谛听",名称="谛听",类型="神兽"},
         {价格=800,模型="进阶谛听",名称="进阶谛听",类型="神兽"},

         {价格=800,模型="狐不归",名称="狐不归",类型="神兽"},
         {价格=800,模型="进阶狐不归",名称="进阶狐不归",类型="神兽"},
         {价格=800,模型="花灵",名称="花灵",类型="神兽"},
         {价格=800,模型="进阶花灵",名称="进阶花灵",类型="神兽"},
         {价格=800,模型="涂山雪",名称="涂山雪",类型="神兽"},
         {价格=800,模型="进阶涂山雪",名称="进阶涂山雪",类型="神兽"},
         {价格=800,模型="月魅",名称="月魅",类型="神兽"},
         {价格=800,模型="进阶月魅",名称="进阶月魅",类型="神兽"},
         {价格=800,模型="月影仙",名称="月影仙",类型="神兽"},
         {价格=800,模型="进阶月影仙",名称="进阶月影仙",类型="神兽"},
         {价格=800,模型="云游火",名称="云游火",类型="神兽"},
         {价格=800,模型="进阶云游火",名称="进阶云游火",类型="神兽"},
	}
	商品组[18]["人物装备"]={

		{价格=200,体质=100,力量=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,体质=100,魔力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,体质=100,耐力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,体质=100,敏捷=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,敏捷=100,力量=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,敏捷=100,魔力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,敏捷=100,耐力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},

	    {价格=200,体质=100,力量=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,体质=100,魔力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,体质=100,耐力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,体质=100,敏捷=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,敏捷=100,力量=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,敏捷=100,魔力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,敏捷=100,耐力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},

	    {价格=200,防御=300,魔法=500,特效="无级别限制",特技="魔兽之印",名称="浑天玄火盔",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=1,子类=1,识别码="6_1598869982_3033943_430"},
	    {价格=200,防御=300,气血=1000,特效="无级别限制",特技="晶清诀",名称="紫霄云芒带",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=5,子类=1,识别码="6_1598869982_1261519_444"},
	    {价格=200,防御=300,敏捷=300,特效="无级别限制",特技="圣灵之甲",名称="辟尘分光履",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=6,子类=1,识别码="6_1598869982_1363505_452"},
	    {价格=200,灵力=800,特效="无级别限制",特技="四海升平",名称="落霞陨星坠",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=2,子类=1,识别码="6_1598869982_3041294_436"},

        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="法术暴击等级",强化=0,数值=80},[2]={类型="法术暴击等级",强化=0,数值=80},[3]={类型="法术暴击等级",强化=0,数值=80},[4]={类型="法术暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="法术伤害",强化=0,数值=100},[2]={类型="法术伤害",强化=0,数值=100},[3]={类型="法术伤害",强化=0,数值=100},[4]={类型="法术伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="物理暴击等级",强化=0,数值=80},[2]={类型="物理暴击等级",强化=0,数值=80},[3]={类型="物理暴击等级",强化=0,数值=80},[4]={类型="物理暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="伤害",强化=0,数值=100},[2]={类型="伤害",强化=0,数值=100},[3]={类型="伤害",强化=0,数值=100},[4]={类型="伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="治疗能力",强化=0,数值=80},[2]={类型="治疗能力",强化=0,数值=80},[3]={类型="治疗能力",强化=0,数值=80},[4]={类型="治疗能力",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="封印命中等级",强化=0,数值=80},[2]={类型="封印命中等级",强化=0,数值=80},[3]={类型="封印命中等级",强化=0,数值=80},[4]={类型="封印命中等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="法术暴击等级",强化=0,数值=80},[2]={类型="法术暴击等级",强化=0,数值=80},[3]={类型="法术暴击等级",强化=0,数值=80},[4]={类型="法术暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="法术伤害",强化=0,数值=100},[2]={类型="法术伤害",强化=0,数值=100},[3]={类型="法术伤害",强化=0,数值=100},[4]={类型="法术伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="物理暴击等级",强化=0,数值=80},[2]={类型="物理暴击等级",强化=0,数值=80},[3]={类型="物理暴击等级",强化=0,数值=80},[4]={类型="物理暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="伤害",强化=0,数值=100},[2]={类型="伤害",强化=0,数值=100},[3]={类型="伤害",强化=0,数值=100},[4]={类型="伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="治疗能力",强化=0,数值=80},[2]={类型="治疗能力",强化=0,数值=80},[3]={类型="治疗能力",强化=0,数值=80},[4]={类型="治疗能力",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="封印命中等级",强化=0,数值=80},[2]={类型="封印命中等级",强化=0,数值=80},[3]={类型="封印命中等级",强化=0,数值=80},[4]={类型="封印命中等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,部位类型="手镯",名称="浮雪幻音",特效="无级别限制",幻化属性={基础={类型="抵抗封印等级",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="手镯",名称="浮雪幻音",特效="无级别限制",幻化属性={基础={类型="封印命中等级",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,部位类型="佩饰",名称="碧海青天",特效="无级别限制",幻化属性={基础={类型="速度",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,部位类型="佩饰",名称="碧海青天",特效="无级别限制",幻化属性={基础={类型="速度",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},



	}
	商品组[18]["宠物装备"]={
		{价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕丝带",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕丝带",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},

        {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕丝圈",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕丝圈",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},

        {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕织甲",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,名称="冰蚕织甲",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
	}
	商品组[18]["杂货一类"]={
		{价格=50,可叠加=false,总类=5,附加特性="心源",级别限制=30,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="狂浪滔天",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="固若金汤",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="锐不可当",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="通真达灵",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="血气方刚",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="健步如飞",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},

	    {价格=10,可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,级别限制=25},
		{价格=10,可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,级别限制=30},
		{价格=10,可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,级别限制=30},
		{价格=10,可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,级别限制=30},
		{价格=10,可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,级别限制=30},
		{价格=10,可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,级别限制=30},
		{价格=10,可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,级别限制=30},
		{价格=10,可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,级别限制=30},

		{价格=1,可叠加=true,总类=9,名称="初级神魂丹",分类=1,子类=1},
		{价格=2,可叠加=true,总类=9,名称="中级神魂丹",分类=1,子类=1},
		{价格=3,可叠加=true,总类=9,名称="高级神魂丹",分类=1,子类=1},
		{价格=50,可叠加=true,总类=9,名称="坐骑内丹",分类=1,子类=1},
		{价格=50,技能="高级夜战",类型="速度",造型="幽灵",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级偷袭",类型="速度",造型="吸血鬼",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级必杀",类型="伤害",造型="鬼将",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级连击",类型="伤害",造型="律法女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="气血",造型="灵符女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="灵力",造型="大力金刚",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级敏捷",类型="防御",造型="雾中仙",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级法术暴击",类型="灵力",造型="灵鹤",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="气血",造型="炎魔神",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级夜战",类型="速度",造型="夜罗刹",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级强力",类型="速度",造型="噬天虎",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},

	}
	商品组[18]["杂货二类"]={
	    {价格=20,可叠加=true,名称="双倍经验丹"},
		{价格=10,可叠加=false,名称="小额银票"},
		{价格=100,可叠加=false,名称="大额银票"},
		{价格=50,可叠加=false,名称="储灵袋"},
		{价格=10,可叠加=true,名称="九转金丹",阶品=500},
		{价格=10,可叠加=true,名称="修炼果",阶品=500},
		{价格=100,可叠加=false,总类=13,子类="雷绝阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=300,可叠加=false,名称="点化石",技能="横扫千军"},
		{价格=300,可叠加=false,名称="点化石",技能="鹰击"},
		{价格=300,可叠加=false,名称="点化石",技能="龙卷雨击"},
		{价格=300,可叠加=false,名称="点化石",技能="雷霆万钧"},
		{价格=300,可叠加=false,名称="点化石",技能="飞砂走石"},
		{价格=300,可叠加=false,名称="点化石",技能="落叶萧萧"},
		{价格=10,子类=1,总类=3,名称="超级金柳露",分类=2},
	}


	商品组[18]["锦衣"]={
		--{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","碧华锦凝雪")+0,锦衣=true,子类=1},
		--{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夜影")+0,锦衣=true,子类=1},
		--{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夏日清凉")+0,锦衣=true,子类=1},
		--{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","华风汉雅")+0,锦衣=true,子类=1},
		--{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","萌萌小厨")+0,锦衣=true,子类=1},
		{价格=1,名称="冰灵蝶翼·月笼沙",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="冰雪玉兔",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="锦绣幻梦",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="浪淘纱",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="浪淘纱·月白",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="铃儿叮当",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="萌狮闹春",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="蜜蜂嗡嗡",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="齐天大圣",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="顽皮小恶魔",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="尖叫男爵",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夏日清凉",总类=2,分类=15,锦衣=true,子类=1},
	    {价格=1,名称="纤云纱·墨黑",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="雁翎银钩·月笼沙",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夜影",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夜之孤煞",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="萤雪轻裘",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="驭龙猎手",总类=2,分类=15,锦衣=true,子类=1},
	    {价格=1,名称="重溟软甲",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="竹林熊猫",总类=2,分类=15,锦衣=true,子类=1},

	}
	商品组[18]["祥瑞"]={
	    --{价格=1,名称="汗血宝马",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="欢喜羊羊",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="魔力斗兽",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="披甲战狼",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="闲云野鹤",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="云魅仙鹿",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="神气小龟",总类="祥瑞",分类=16,子类=2},


		{价格=1,名称="瑞彩祥云",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="落英纷飞",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="七彩祥云",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="齐天小轿",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="风火飞轮",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="凤舞灵蝶",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="流云玉佩",总类="祥瑞",分类=16,子类=2},
		-- {可叠加=false,名称="展翅高飞",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","展翅高飞")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="旗开得胜",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","旗开得胜")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="霸王雄风",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霸王雄风")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="独眼观天",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","独眼观天")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="威武不屈",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威武不屈")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="深藏不露",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","深藏不露")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="异域浓情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域浓情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="流星天马",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","流星天马")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="威猛将军",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威猛将军")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="知情达理",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","知情达理")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="气宇轩昂",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","气宇轩昂")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="如花似玉",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","如花似玉")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="傲视天下",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","傲视天下")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="铁血豪情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","铁血豪情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="唯我独尊",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","唯我独尊")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="叱咤风云",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","叱咤风云")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="异域风情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域风情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="假面勇者",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","假面勇者")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="霓裳魅影",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霓裳魅影")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="披星戴月",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","披星戴月")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="烈焰燃情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","烈焰燃情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="天雨流芳",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天雨流芳")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="灵光再现",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","灵光再现")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="倾国倾城",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","倾国倾城")+0,总类="坐骑饰品"},
	}
	商品组[18]["足迹"]={
		{价格=1,名称="龙卷风足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="皮球足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="雀屏足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="旋律足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="枫叶足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="飞天足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="两心相悦足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="心花怒放",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="雷电足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="寒冰足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="星星祈愿",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="地狱焰火",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="元宝足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="光剑足迹",总类=2,分类=17,锦衣=true,子类=3},
		{价格=1,名称="雪花足迹",总类=2,分类=17,锦衣=true,子类=3},
	}
	商品组[18]["足印"]={
		{价格=1,名称="浩瀚星河",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="烈焰澜翻",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="水墨游龙",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="星光熠熠",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="双鲤寄情",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="凌波微步",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="荷塘涟漪",总类=2,分类=16,锦衣=true,子类=2},

		{价格=1,名称="雪花飘落",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="月影婆娑",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="祥云瑞气",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="花的海洋",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="爱的光影",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="珠落玉盘",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="红叶随风",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="白色精灵",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="黑色精灵",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="蓝色精灵",总类=2,分类=16,锦衣=true,子类=2},
		{价格=1,名称="海豚精灵",总类=2,分类=16,锦衣=true,子类=2},
	}


	商品组[18]["宝宝"]={
		{价格=1,模型="超级神龙",名称="超级神龙",类型="神兽"},
		{价格=1,模型="超级土地公公",名称="超级土地公公",类型="神兽"},
		{价格=1,模型="超级六耳猕猴",名称="超级六耳猕猴",类型="神兽"},
		{价格=1,模型="超级神鸡",名称="超级神鸡",类型="神兽"},
		{价格=1,模型="超级玉兔",名称="超级玉兔",类型="神兽",饰品=true},
		{价格=1,模型="超级神猴",名称="超级神猴",类型="神兽"},
		{价格=1,模型="超级神马",名称="超级神马",类型="神兽"},
		{价格=1,模型="超级神羊",名称="超级神羊",类型="神兽"},
		{价格=1,模型="超级孔雀",名称="超级孔雀",类型="神兽"},
		{价格=1,模型="超级灵狐",名称="超级灵狐",类型="神兽"},
		{价格=1,模型="超级筋斗云",名称="超级筋斗云",类型="神兽"},
		{价格=1,模型="超级麒麟",名称="超级麒麟",类型="神兽"},
		{价格=1,模型="超级大鹏",名称="超级大鹏",类型="神兽"},
		{价格=1,模型="超级赤焰兽",名称="超级赤焰兽",类型="神兽"},
		{价格=1,模型="超级白泽",名称="超级白泽",类型="神兽"},
		{价格=1,模型="超级灵鹿",名称="超级灵鹿",类型="神兽"},
		{价格=1,模型="超级大象",名称="超级大象",类型="神兽"},
		{价格=1,模型="超级金猴",名称="超级金猴",类型="神兽"},
		{价格=1,模型="超级大熊猫",名称="超级大熊猫",类型="神兽"},
		{价格=1,模型="超级泡泡",名称="超级泡泡",类型="神兽"},
		{价格=1,模型="超级神兔",名称="超级神兔",类型="神兽"},
		{价格=1,模型="超级神虎",名称="超级神虎",类型="神兽"},
		{价格=1,模型="超级神牛",名称="超级神牛",类型="神兽"},
		-- {模型="超级海豚",名称="超级海豚",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级海豚")+0},
		{价格=1,模型="超级人参娃娃",名称="超级人参娃娃",类型="神兽"},
		{价格=1,模型="超级青鸾",名称="超级青鸾",类型="神兽"},
		{价格=1,模型="超级腾蛇",名称="超级腾蛇",类型="神兽"},
		{价格=1,模型="超级神蛇",名称="超级神蛇",类型="神兽"},
		--{模型="贪狼",名称="贪狼",类型="神兽",价格=1},
	}

	商品组[18]["法宝"]={}
	 local 名称={"碧玉葫芦","五色旗盒","飞剑","拭剑石","金甲仙衣","惊魂铃","嗜血幡","风袋","清心咒","九黎战鼓","盘龙壁","神行飞剑","汇灵盏","天师符","织女扇"}
	 for i=1,#名称 do
	 	table.insert(商品组[18]["法宝"], 商城取法宝(名称[i],1))
	 end
	 名称={"发瘟匣","断线木偶","五彩娃娃","七杀","金刚杵","兽王令","摄魂","附灵玉"}
	 for i=1,#名称 do
	 	table.insert(商品组[18]["法宝"], 商城取法宝(名称[i],2))
	 end
	 名称={"失心钹","五火神焰印","九幽","普渡","鬼泣","月光宝盒","混元伞","无魂傀儡","苍白纸人","聚宝盆","乾坤玄火塔","无尘扇","无字经","干将莫邪","慈悲","救命毫毛","伏魔天书","镇海珠","奇门五行令","月影"}
	 for i=1,#名称 do
	 	table.insert(商品组[18]["法宝"], 商城取法宝(名称[i],3))
	 end
	 名称={"流影云笛","宿幕星河","蟠龙玉璧","落星飞鸿","归元圣印","千斗金樽"}
	 for i=1,#名称 do
	 	table.insert(商品组[18]["法宝"], 商城取法宝(名称[i],4))
	 end



function 商城类:初始化(根)
	tp=根
	self.ID = 47
	self.x = -20
	self.y = 20
	self.xx = 0
	self.yy = 0
	self.注释 = "商  城"
	self.可视 = false
	self.鼠标 = false
	self.焦点 = false
	self.可移动 = true
	self.本类开关 = false
	self.选中编号4=0
	self.选中编号3 = 0
	self.选中编号2 = 0
	self.选中编号 = 0
	self.银两数额 = 0
	self.加入 = 0
	self.分类="杂货"
	self.子类="锦衣"
	self.控件类 = require("ggeui/加载类")()
	local 总控件 = self.控件类:创建控件('给予总控件')
	总控件:置可视(true,true)
	self.输入框 = 总控件:创建输入("银两输入",0,0,100,14)
	self.输入框:置可视(false,false)
	self.输入框:置限制字数(8)
	self.输入框:置数字模式()
	self.输入框:屏蔽快捷键(true)
	self.输入框:置光标颜色(-16777216)
	self.输入框:置文字颜色(-16777216)
	zts2 = require("gge文字类").创建(nil,16,false,false,true)
	zts = require("gge文字类").创建(nil,20,false,false,true)
	zts2:置描边颜色(-16777216)
	zts:置描边颜色(-16777216)
	zts:置颜色(4294967295)
	zts2:置颜色(4294967295)
end

function 商城类:检查点(x,y)
	if self.可视 and self.背景 ~= nil and self.背景:是否选中(x,y) then
		return true
	else
		return false
	end
end

function 商城类:打开(数据)
	if self.选中编号 ~=0 then
	   return false
	end
	if self.可视 then
		self.变量 = {}
		self.可视 = false
		self.选中ID=0
		self.选中编号2 = 0
		self.选中编号3 = 0
		self.选中编号4 = 0
		self.选中编号 = 0
		self.物品数据={杂货={},仙玉={},金元宝2={},折扣={},宝宝={},法宝={},金元宝宠物={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},人物装备={},宠物装备={},杂货一类={},杂货二类={}}
		self.输入框:置可视(false,false)
		self.背景 = nil
		self.背景2 =  nil
		self.选中显示 =  nil
		self.选中显示2 =  nil
		self.银两文字 =  nil
		self.银两文字1 =  nil
		self.银两文字2 =  nil
		self.银两文字3 =  nil
		self.调用文字 = nil
		self.调用文字2 = nil
		self.购买 = nil
		self.充值 = nil
		self.资源组 = nil
		return
	else
		insert(tp.窗口_,self)
		local 资源 = tp.资源
		local 按钮 = tp._按钮
		local 自适应 = tp._自适应
		self.背景 = pwd("10")
		self.背景2 = 自适应.创建(37,1,478,250,3,9)
		self.选中显示 = 资源:载入('wzife.wdf',"网易WDF动画",0x6F88F494)
		self.选中显示2 = 资源:载入('wzife.wdf',"网易WDF动画",0x10921CA7)
		self.银两文字 = tp.文字类.创建(wdf配置.."/font/simsun.ttc", 15)
		self.银两文字1 = tp.文字类.创建(wdf配置.."/font/simsun.ttc", 15)
		self.银两文字2 = tp.文字类.创建(wdf配置.."/font/simsun.ttc", 15)
		self.银两文字3 = tp.文字类.创建(wdf配置.."/font/simsun.ttc", 15)
		self.银两文字3:置颜色(黑色)
		self.调用文字 = tp.文字类(wdf配置.."/font/simsun.ttc", 16)
		self.调用文字:置颜色(白色)
		self.调用文字2 = tp.文字类(wdf配置.."/font/simsun.ttc", 16)
		self.调用文字2:置颜色(黑色)
		self.购买 = 按钮.创建(pwd("11"),0,0,2,true,true," 购  买")
		self.充值 = 按钮.创建(pwd("11"),0,0,2,true,true," 充  值")
		self.购买:绑定窗口_(47)
		self.充值:绑定窗口_(47)
		self.资源组 = {
			[1] = 按钮.创建(pwd("1"),0,0,4,true,true,"			杂 货 仙 玉"),--三是左右长度四是上下长度
			[2] = 按钮.创建(pwd("1"),0,0,4,true,true,"			人 物 仙 玉"),
			[3] = 按钮.创建(pwd("1"),0,0,4,true,true,"			元 宝 商 城"),
			[5] = 按钮.创建(pwd("1"),0,0,4,true,true,"			宝 宝 仙 玉"),
			[4] = 按钮.创建(pwd("1"),0,0,4,true,true,"			宠 物 仙 玉"),
			[6] = 按钮.创建(pwd("1"),0,0,4,true,true,"			法 宝 仙 玉"),
			[8] = 按钮.创建(pwd("1"),0,0,4,true,true,"			锦 骑 仙 玉"),
			[7] = 按钮.创建(pwd("1"),0,0,4,true,true,"  查看召唤兽属性"),
			[25] = 自适应.创建(3,1,130,19,1,3),
			[26] = 自适应.创建(2,1,158,153,3,9),
			[27] = 按钮.创建(自适应.创建(20,4,18,19,4,3),0,0,4,true,true),--上滚动
			[28] = 按钮.创建(自适应.创建(21,4,18,19,4,3),0,0,4,true,true),--下滚动
			[35] =  tp._滑块.创建(自适应.创建(11,4,15,40,2,3,nil),4,14,264,2),
			[36] = 按钮.创建(自适应.创建(18,4,16,16,4,3),0,0,4,true,true),
			[38] = 按钮.创建(自适应.创建(12,4,43,22,1,3),0,0,4,true,true,"锦衣"),
			[39] = pwd("12"),
			[40] = 按钮.创建(pwd("11"),0,0,4,true,true,"锦衣商城"),
			[41] = 按钮.创建(pwd("11"),0,0,4,true,true,"坐骑商城"),
			[42] = 按钮.创建(pwd("11"),0,0,4,true,true,"足迹商城"),
			[43] = 按钮.创建(pwd("11"),0,0,4,true,true,"足印商城"),
			[44] = 按钮.创建(pwd("11"),0,0,4,true,true,"人物装备"),
			[45] = 按钮.创建(pwd("11"),0,0,4,true,true,"宠物装备"),
			[46] = 按钮.创建(pwd("11"),0,0,4,true,true,"杂货一类"),
			[47] = 按钮.创建(pwd("11"),0,0,4,true,true,"杂货二类"),
			[48] = pwd("13"),
			[49] = 按钮.创建(pwd("14"),0,0,4,true,true),
			[50] = 按钮.创建(pwd("1"),0,0,4,true,true,"			元 宝 宠 物"),
		}
		for i=1,5 do
			self.资源组[i]:绑定窗口_(47)
		end
		self.资源组[35]:绑定窗口_(47)
		self.资源组[36]:绑定窗口_(47)
		self.资源组[50]:绑定窗口_(47)
		if 数据==nil then
		    return 0
		end
		if 数据.序列==1 then
		    self.分类="杂货"
		--elseif 数据.序列==2 then
		--	self.分类="金元宝2"
		end
		self.本类开关 = true
		self.数据 = 数据
		self.数据 = 商品组[数据.组号]
		self.组号 = 数据.组号
		self.数据.仙灵玉 = 数据.仙灵玉
		self.数据.元宝 = 数据.元宝
		self.数据.银子 = 数据.银子
		self.数据.积分数 = 数据.积分数
		self.数据.组号 = 数据.组号
		self.数据.序列 = 数据.序列
		self.物品数据 = {杂货={},仙玉={},金元宝2={},折扣={},宝宝={},法宝={},金元宝宠物={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},人物装备={},宠物装备={},杂货一类={},杂货二类={}}
		self.商品编号 = 0
		for n = 1,#x类 do
			if x类[n]=="宝宝" or x类[n]=="金元宝宠物" then
				for i=1,#self.数据[x类[n]] do
					local xn = tx(self.数据[x类[n]][i].模型)
					self.物品数据[x类[n]][i] = tp.资源:载入(xn[7],"网易WDF动画",xn[1])
					-- print(xn[7])
					self.物品数据[x类[n]].数量的=#self.数据[x类[n]]
					self.物品数据[x类[n]][i].编号 = n
					self.物品数据[x类[n]][i].价格=self.数据[x类[n]][i].价格
					--self.数据[x类[n]][i].价格=0
				end
			else
				for i=1,#self.数据[x类[n]] do
					self.物品数据[x类[n]][i] = tp._物品格子.创建(0,0,i,"给予_物品")
					self.物品数据[x类[n]][i]:置物品(self.数据[x类[n]][i])
					self.物品数据[x类[n]].数量的=#self.数据[x类[n]]
					self.物品数据[x类[n]][i].编号 = n
					self.物品数据[x类[n]][i].价格=self.数据[x类[n]][i].价格
				end
			end
		end
		self.资源组[23] = nil
	    self.资源组[29] = nil
	    self.资源组[33] = nil
	    self.资源组[32] = nil
	    self.资源组[30] = nil
	    self.资源组[31] = nil
	    self.显示足印 = nil
	    self.显示足迹 = nil
		self.坐骑显示 = nil
		self.显示锦衣 = nil
		self.数量 = 1
		self.价格 = 0
		self.仙玉 = 数据.仙灵玉
		self.元宝 = 数据.元宝
		self.银子 = 数据.银子
		self.积分 = 数据.积分数
		self.总额 = 0
		tp.运行时间 = tp.运行时间 + 1
		self.窗口时间 = tp.运行时间
		self.可视 = true
		self.选中编号2 = 0
		self.选中编号3 = 0
		self.选中编号4 = 0
	    self.输入框:置可视(true,true)
	    self.输入框:置文本("")
	    if self.分类 == "杂货" or self.分类 == "仙玉" or self.分类 == "法宝"  or self.分类 == "折扣" then
			self.翻页数据 = math.floor(self.物品数据[self.分类].数量的/55)
		else
		    self.翻页数据 = math.floor(self.物品数据[self.分类].数量的/40)
		end
	end
	self.资源组[35]:置起始点(0)
end

function 商城类:初始系统(dt,x,y,l)
	zts2:显示(self.x+350,self.y+ 430, "")
	if l~=nil and l==2 then
		self.商品编号=0
		self.数量 = 1
		self.价格 = 0
		self.总额 = 0
		self.选中编号=0
		self.选中编号2=0
		self.选中编号3 = 0
		self.选中编号4 = 0
		bbsa=0
		self.资源组[35]:置起始点(0)
	else
		self.商品编号=0
		self.数量 = 1
		self.价格 = 0
		self.总额 = 0
		self.选中编号=0
		self.选中编号2=0
		self.选中编号3 = 0
		self.选中编号4 = 0
	end
	if self.分类 == "杂货" or self.分类 == "仙玉" or self.分类 == "法宝" or self.分类 == "折扣" then
		self.翻页数据 = math.floor(self.物品数据[self.分类].数量的/55)
	elseif  self.分类 == "金元宝2" or self.分类 == "锦衣祥瑞" then
	    self.翻页数据 = math.floor(self.物品数据[self.子类].数量的/40)
	else
		self.翻页数据 = math.floor(self.物品数据[self.分类].数量的/40)
	end
end

function 商城类:显示(dt,x,y)
	if self.输入框:取文本() ~= "" and self.数量 ~= (self.输入框:取文本()+0) then
		self.数量 = 到整数(self.输入框:取文本())
		self.总额 = self.数量 * self.价格
	end
	self.焦点=false
	self.资源组[1]:更新(x,y,self.分类~="杂货")
	self.资源组[2]:更新(x,y,self.分类~="仙玉")
	self.资源组[3]:更新(x,y,self.分类~="金元宝2")
	self.资源组[4]:更新(x,y,self.分类~="折扣")
	self.资源组[5]:更新(x,y,self.分类~="宝宝")
	self.资源组[6]:更新(x,y,self.分类~="法宝")
	self.资源组[8]:更新(x,y,self.分类~="锦衣祥瑞")
	-- self.资源组[9]:更新(x,y,self.分类~="坐骑")
	-- self.资源组[38]:更新(x,y,self.分类~="锦衣")
	self.资源组[7]:更新(x,y,self.选中编号3~=0)
	self.资源组[36]:更新(x,y)
	self.资源组[49]:更新(x,y)
	self.资源组[50]:更新(x,y,self.分类~="金元宝宠物")
	self.购买:更新(x,y,self.商品编号 ~= 0)
	self.充值:更新(x,y)
	if self.购买:事件判断() then
		if self.商品编号 == 0 then
			tp.提示:写入("#y/请先选择一件商品")
		else
			if self.商品编号~=0 then
				if self.分类=="杂货" then
				    if self.仙玉< self.物品数据[self.分类][self.商品编号].价格 then
					    tp.提示:写入("#y/仙玉不够购买商品!")
					    return
					end
				elseif self.分类=="金元宝2" then
				    if self.元宝< self.物品数据[self.子类][self.商品编号].价格 then
					    tp.提示:写入("#y/元宝不够购买商品!")
					    return
					end
				else
					if self.分类=="锦衣祥瑞" and self.仙玉< self.物品数据[self.子类][self.商品编号].价格 then
					    tp.提示:写入("#y/仙玉不够购买商品!")
					    return
					end
					if self.分类=="仙玉" and self.仙玉< self.物品数据[self.分类][self.商品编号].价格 then
					    tp.提示:写入("#y/仙玉不够购买商品!")
					    return
					end
					if self.分类=="金元宝宠物" then
					   if #tp.队伍[1].宝宝列表>=7 then
					       tp.提示:写入( "#y/您当前无法携带更多的召唤兽了")
					       return
					   end
					end
					if self.分类=="宝宝" then
					   if #tp.队伍[1].宝宝列表>=7 then
					       tp.提示:写入( "#y/您当前无法携带更多的召唤兽了")
					       return
					   end
					end
				end
				if self.分类=="杂货" then
				    self.仙玉=self.仙玉-self.物品数据[self.分类][self.商品编号].价格*self.数量
				elseif self.元宝=="金元宝2" then
					self.元宝=self.元宝-self.物品数据[self.子类][self.商品编号].价格*self.数量
				elseif self.分类 == "仙玉" then
					self.仙玉=self.仙玉-self.物品数据[self.分类][self.商品编号].价格*self.数量
				elseif self.分类 == "锦衣祥瑞" then
					self.仙玉=self.仙玉-self.物品数据[self.子类][self.商品编号].价格*self.数量
				--elseif self.分类 == "金元宝" then
				--	self.元宝=self.元宝-self.物品数据[self.分类][self.商品编号].价格*self.数量
				end
				if self.分类 == "宝宝" or self.分类 == "金元宝宠物" then
					tp.窗口.对话栏:文本("普陀_接引仙女","神兽乐园","请选择您要购买的神兽类型",{"购买法系神兽","购买物理神兽"})
				else
					self.发送信息 = {
						编号 = self.商品编号,--self.物品数据[self.分类][self.商品编号].编号,
						位置 =self.商品编号,
						数量 = self.数量,
						组号 = self.组号,
						分类 = self.分类
					}
					if self.分类=="锦衣祥瑞" or self.分类=="金元宝2" then
						self.发送信息.分类=self.子类
					end
					发送数据(30,self.发送信息)
				end
				if tp.窗口.召唤兽属性栏.可视 then
	                tp.窗口.召唤兽属性栏:打开()
	            end
				if tp.窗口.道具行囊.可视 then
					tp.窗口.道具行囊:打开()
				end
			end
		end
	elseif self.资源组[49]:事件判断() then
		self:打开()
		return
	elseif self.充值:事件判断() then
		发送数据(47)
		self:打开()
		return
	elseif self.资源组[36]:事件判断() then
		self:打开()
		self.本类开关 = false
		self.输入框:置可视(false,false)
		return false
	end

	if self.资源组[1]:事件判断() then
		self.分类="杂货"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[2]:事件判断() then
		self.分类="仙玉"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[3]:事件判断() then
		self.分类="金元宝2"
		self.子类="人物装备"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[4]:事件判断() then
		self.分类="折扣"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[5]:事件判断() then
		self.分类="宝宝"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[6]:事件判断() then
	 	self.分类="法宝"
	 	self:初始系统(dt,x,y,2)
	 	self.加入=0
	elseif self.资源组[8]:事件判断() then
		self.分类="锦衣祥瑞"
		self.子类="锦衣"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[50]:事件判断() then
		self.分类="金元宝宠物"
		self:初始系统(dt,x,y,2)
		self.加入=0
	end
	self.背景:显示(self.x+115, self.y+40)
	zts:置颜色(白色)
	zts:显示(self.x+430,self.y+ 40, self.注释)
	zts2:置颜色(白色)
	zts2:显示(self.x+155+110,self.y+ 404+30, "单 价")
	zts2:显示(self.x+350+110,self.y+ 404+30, "数 量")
	zts2:显示(self.x+155+110,self.y+ 429+30, "总 额")
	self.资源组[49]:显示(self.x+635+120,self.y+40)
	if self.分类 == "杂货" then
	    zts2:显示(self.x+350+110,self.y+ 429+30, "仙 玉")
	elseif self.分类 == "金元宝2" or self.分类 == "金元宝宠物" then
	 	zts2:显示(self.x+350+110,self.y+ 429+30, "元 宝")
	--elseif self.分类 == "金元宝" then
	-- 	zts2:显示(self.x+350+110,self.y+ 429+30, "元 宝")
	else
		zts2:显示(self.x+350+110,self.y+ 429+30, "仙 玉")
	end
	self.资源组[25]:显示(self.x+200+110,self.y+ 403+30)
	self.资源组[25]:显示(self.x+200+110,self.y+ 428+30)
	self.资源组[25]:显示(self.x+395+110,self.y+ 403+30)
	self.资源组[25]:显示(self.x+395+110,self.y+ 428+30)
	self.资源组[1]:显示(self.x+150+30, self.y+70,true,nil,nil,self.分类 == "杂货",2)
	self.资源组[2]:显示(self.x+290+30, self.y+70,true,nil,nil,self.分类 == "仙玉",2)
	self.资源组[8]:显示(self.x+290+30, self.y+100,true,nil,nil,self.分类 == "锦衣祥瑞",2)
	self.资源组[6]:显示(self.x+150+30, self.y+100,true,nil,nil,self.分类 == "法宝",2)
	self.资源组[5]:显示(self.x+430+30, self.y+100,true,nil,nil,self.分类 == "宝宝",2)
	self.资源组[3]:显示(self.x+570+30, self.y+70,true,nil,nil,self.分类 == "金元宝2",2)
	self.资源组[4]:显示(self.x+430+30, self.y+70,true,nil,nil,self.分类 == "折扣",2)
	self.资源组[50]:显示(self.x+570+30, self.y+100,true,nil,nil,self.分类 == "金元宝宠物",2)
	self.输入框:置坐标(self.x+400+110,self.y+406+30)
	self.控件类:更新(dt,x,y)
	self.控件类:显示(x,y)
	self.购买:显示(self.x+540+110, self.y+403+30)
	self.充值:显示(self.x+540+110, self.y+430+28)
	if self.分类=="宝宝" or self.分类=="金元宝宠物" then
		self:召唤兽类(dt,x,y)
	elseif self.分类=="锦衣祥瑞" or (self.分类=="锦衣祥瑞" and self.子类=="锦衣") or (self.分类=="锦衣祥瑞" and self.子类=="祥瑞") or (self.分类=="锦衣祥瑞" and self.子类=="足迹") or (self.分类=="锦衣祥瑞" and self.子类=="足印") then
		self:锦衣类(dt,x,y)
	elseif self.分类=="金元宝2" or (self.分类=="金元宝2" and self.子类=="人物装备") or (self.分类=="金元宝2" and self.子类=="宠物装备") or (self.分类=="金元宝2" and self.子类=="杂货一类") or (self.分类=="金元宝2" and self.子类=="杂货二类") then
		self:积分类(dt,x,y)
	else
		self:物品类(dt,x,y)
	end
	if self.资源组[35].接触 then
		self.焦点 = true
		self:初始系统(dt,x,y,0)
		self.加入=0
	end
end

function 商城类:物品类(dt,x,y)
	self.输入框:置可视(true,true)
	local bbsa = self.物品数据[self.分类].数量的
	if self.资源组[27]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,55,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 >0 then
			self.加入 = self.加入 - 1
		end
	elseif self.资源组[28]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,55,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 <self.翻页数据 then
			self.加入 = self.加入 + 1
		end
	-- elseif (self.资源组[27]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==1 and self.加入 > 0 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,55,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	-- elseif (self.资源组[28]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==-1 and self.加入 < bbsa - 44 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,55,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	end
	-- if bbsa > 55 then
	-- 	self.资源组[35]:置高度(min(floor(264/(bbsa-55)),50))
	-- 	self.加入 = min(ceil((bbsa-55)*self.资源组[35]:取百分比()),bbsa-55)
	-- end
	self.资源组[27]:更新(x,y,self.加入 > 0)
	self.资源组[28]:更新(x,y,self.加入 < self.翻页数据)
	self.焦点 = false
	if self.分类 == "杂货" then
	    银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
	--elseif self.分类 == "积分" then
	--	银两显示(self.银两文字, self.积分[self.子类], self.x+400+110,self.y+ 431+30)

	elseif self.分类 == "仙玉" or self.分类 == "锦衣祥瑞" or self.分类 == "法宝"or self.分类 == "折扣" or self.分类 == "宝宝" then
		银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
	elseif self.分类 == "金元宝宠物" or self.分类 == "金元宝2" then
		银两显示(self.银两文字, self.元宝, self.x+400+110,self.y+ 431+30)

	end
	银两显示(self.银两文字1, self.价格,self.x+205+110,self.y+ 406+30)
	银两显示(self.银两文字2, self.总额,self.x+205+110,self.y+ 431+30)
	self.选中编号 = 0
	local x横,x竖 = 1,1
	for n = 1, 55 do
		if self.物品数据[self.分类][n+self.加入*55]~=nil then
			if self.物品数据[self.分类][n+self.加入*55].焦点 then
				self.选中编号 = n+self.加入*55
				if 引擎.鼠标弹起(左键) then
				    self.选中编号2=n
				    self.选中编号3 = n+self.加入*55
				end
			end
			self.物品数据[self.分类][n+self.加入*55]:置坐标(self.x+125+x横*51, self.y+79+x竖*51)
			self.物品数据[self.分类][n+self.加入*55]:显示(dt,x,y,self.鼠标)
			if self.选中编号2 ~= 0 and self.选中编号2 == n then
				self.选中显示2:显示(self.x+125+x横*51, self.y+80+x竖*51)
			end
		end
		if x横 == 11  then
			x横 = 1
			x竖=x竖+1
		else
			x横 = x横+1
		end
	end
	if self.选中编号 ~= 0 then
		tp.提示:道具行囊(x,y,self.物品数据[self.分类][self.选中编号].物品)
		if 引擎.鼠标弹起(左键) then
			self.价格 = self.数据[self.分类][self.选中编号].价格
			if self.商品编号 == self.选中编号 then
				self.数量 = self.数量 + 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
				return 0
			else
				self.数量 = 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
			end
			self.商品编号 = self.选中编号
		elseif 引擎.鼠标弹起(右键) and self.商品编号 == self.选中编号 and self.数量 > 1 then
			self.数量 = self.数量 - 1
			self.总额 = self.数量 * self.价格
			self.输入框:置文本(self.数量)
		end
	end
	if self.输入框._已碰撞 then
		self.焦点 = true
	end
	-- tp.画线:置区域(0,0,15,280)--滑块虚线
	-- tp.画线:显示(self.x+611-23,self.y+100+51)
	self.资源组[27]:显示(self.x+735,self.y+128)
	self.资源组[28]:显示(self.x+735,self.y+368)
	-- if bbsa > 55 then
	-- 	self.资源组[35]:显示(self.x+608-23,self.y+147+14,x,y,self.鼠标)
	-- end
end

function 商城类:积分类(dt,x,y)
	self.输入框:置可视(true,true)
	self.资源组[44]:更新(x,y,self.子类~="人物装备")
	self.资源组[45]:更新(x,y,self.子类~="宠物装备")
	self.资源组[46]:更新(x,y,self.子类~="杂货一类")
	self.资源组[47]:更新(x,y,self.子类~="杂货二类")
	local bbsa = self.物品数据[self.子类].数量的
	if self.资源组[27]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 >0 then
			self.加入 = self.加入 - 1
		end
	elseif self.资源组[28]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 <self.翻页数据 then
			self.加入 = self.加入 + 1
		end
	-- elseif (self.资源组[27]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==1 and self.加入 > 0 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	-- elseif (self.资源组[28]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==-1 and self.加入 < bbsa - 32 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	elseif self.资源组[44]:事件判断() then
		self.子类="人物装备"
		self.分类="金元宝2"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[45]:事件判断() then
		self.子类="宠物装备"
		self.分类="金元宝2"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[46]:事件判断() then
		self.子类="杂货一类"
		self.分类="金元宝2"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[47]:事件判断() then
	 	self.子类="杂货二类"
	 	self.分类="金元宝2"
	 	self:初始系统(dt,x,y,2)
	 	self.加入=0
	end
	-- if bbsa > 40 then
	-- 	self.资源组[35]:置高度(min(floor(264/(bbsa-40)),50))
	-- 	self.加入 = min(ceil((bbsa-40)*self.资源组[35]:取百分比()),bbsa-40)
	-- end
	self.资源组[27]:更新(x,y,self.加入 > 0)
	self.资源组[28]:更新(x,y,self.加入 < self.翻页数据)
	self.资源组[48]:显示(self.x+567,self.y+125)
	self.资源组[44]:显示(self.x+567+35,self.y+125+192-175,true,nil,nil,self.子类 == "人物装备",2)
	self.资源组[45]:显示(self.x+567+25+82,self.y+125+192-175,true,nil,nil,self.子类 == "宠物装备",2)
	self.资源组[46]:显示(self.x+567+35,self.y+125+192+25-155,true,nil,nil,self.子类 == "杂货一类",2)
	self.资源组[47]:显示(self.x+567+82+25,self.y+125+25+192-155,true,nil,nil,self.子类 == "杂货二类",2)
	self.焦点 = false
	if self.分类 == "杂货" then
	    银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
	--elseif self.分类 == "积分" then
	--	银两显示(self.银两文字, self.积分[self.子类], self.x+400+110,self.y+ 431+30)
	elseif self.分类 == "仙玉" or self.分类 == "锦衣祥瑞" or self.分类 == "法宝"or self.分类 == "折扣" or self.分类 == "宝宝" then
		银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
	elseif self.分类 == "金元宝宠物"or self.分类 == "金元宝2" then
		银两显示(self.银两文字, self.元宝, self.x+400+110,self.y+ 431+30)
	end
	银两显示(self.银两文字1, self.价格,self.x+205+110,self.y+ 406+30)
	银两显示(self.银两文字2, self.总额,self.x+205+110,self.y+ 431+30)
	self.选中编号 = 0
	local x横,x竖 = 1,1
	for n = 1, 40 do
		if self.物品数据[self.子类][n+self.加入*40]~=nil then
			if self.物品数据[self.子类][n+self.加入*40].焦点 then
				self.选中编号 = n+self.加入*40
				if 引擎.鼠标弹起(左键) then
				    self.选中编号2=n
				    self.选中编号3 = n+self.加入*40
				end
			end
			self.物品数据[self.子类][n+self.加入*40]:置坐标(self.x+125+x横*51, self.y+79+x竖*51)
			self.物品数据[self.子类][n+self.加入*40]:显示(dt,x,y,self.鼠标)
			if self.选中编号2 ~= 0 and self.选中编号2 == n then
				self.选中显示2:显示(self.x+125+x横*51, self.y+80+x竖*51)
			end
		end
		if x横 == 8  then
			x横 = 1
			x竖=x竖+1
		else
			x横 = x横+1
		end
	end

	if self.选中编号 ~= 0 then
		tp.提示:道具行囊(x,y,self.物品数据[self.子类][self.选中编号].物品)
		if 引擎.鼠标弹起(左键) then
			self.价格 = self.数据[self.子类][self.选中编号].价格
			if self.商品编号 == self.选中编号 then
				self.数量 = self.数量 + 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
				return 0
			else
				self.数量 = 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
			end
			self.商品编号 = self.选中编号
		elseif 引擎.鼠标弹起(右键) and self.商品编号 == self.选中编号 and self.数量 > 1 then
			self.数量 = self.数量 - 1
			self.总额 = self.数量 * self.价格
			self.输入框:置文本(self.数量)
		end
	end
	if self.输入框._已碰撞 then
		self.焦点 = true
	end
	-- tp.画线:置区域(0,0,15,280)--滑块虚线
	-- tp.画线:显示(self.x+611-23,self.y+100+51)
	self.资源组[27]:显示(self.x+735-154,self.y+127)
	self.资源组[28]:显示(self.x+735-154,self.y+369)
	-- if bbsa > 55 then
	-- 	self.资源组[35]:显示(self.x+608-23,self.y+147+14,x,y,self.鼠标)
	-- end
end

function 商城类:锦衣类(dt,x,y)
	self.输入框:置可视(true,true)
	self.资源组[40]:更新(x,y,self.子类~="锦衣")
	self.资源组[41]:更新(x,y,self.子类~="祥瑞")
	self.资源组[42]:更新(x,y,self.子类~="足迹")
	self.资源组[43]:更新(x,y,self.子类~="足印")
	local bbsa = self.物品数据[self.子类].数量的
	if self.资源组[27]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 >0 then
			self.加入 = self.加入 - 1
		end
	elseif self.资源组[28]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 <self.翻页数据 then
			self.加入 = self.加入 + 1
		end
	-- elseif (self.资源组[27]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==1 and self.加入 > 0 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	-- elseif (self.资源组[28]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==-1 and self.加入 < bbsa - 32 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	elseif self.资源组[40]:事件判断() then
		self.子类="锦衣"
		self.分类="锦衣祥瑞"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[41]:事件判断() then
		self.子类="祥瑞"
		self.分类="锦衣祥瑞"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[42]:事件判断() then
		self.子类="足迹"
		self.分类="锦衣祥瑞"
		self:初始系统(dt,x,y,2)
		self.加入=0
	elseif self.资源组[43]:事件判断() then
	 	self.子类="足印"
	 	self.分类="锦衣祥瑞"
	 	self:初始系统(dt,x,y,2)
	 	self.加入=0
	end
	-- if bbsa > 40 then
	-- 	self.资源组[35]:置高度(min(floor(264/(bbsa-40)),50))
	-- 	self.加入 = min(ceil((bbsa-40)*self.资源组[35]:取百分比()),bbsa-40)
	-- end
	self.资源组[27]:更新(x,y,self.加入 > 0)
	self.资源组[28]:更新(x,y,self.加入 < self.翻页数据)
	self.焦点 = false
	银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
	银两显示(self.银两文字1, self.价格,self.x+205+110,self.y+ 406+30)
	银两显示(self.银两文字2, self.总额,self.x+205+110,self.y+ 431+30)
	self.资源组[39]:显示(self.x+567,self.y+125)
	self.资源组[40]:显示(self.x+567+35,self.y+125+192,true,nil,nil,self.子类 == "锦衣",2)
	self.资源组[41]:显示(self.x+567+25+82,self.y+125+192,true,nil,nil,self.子类 == "祥瑞",2)
	self.资源组[42]:显示(self.x+567+35,self.y+125+192+25,true,nil,nil,self.子类 == "足迹",2)
	self.资源组[43]:显示(self.x+567+82+25,self.y+125+25+192,true,nil,nil,self.子类 == "足印",2)
	self.选中编号 = 0
	local x横,x竖 = 1,1
	for n = 1, 40 do
		if self.物品数据[self.子类][n+self.加入*40]~=nil then
			if self.物品数据[self.子类][n+self.加入*40].焦点 then
				self.选中编号 = n+self.加入*40
				if 引擎.鼠标弹起(左键) then
				    self.选中编号2=n+self.加入*40
				    self.选中编号3 = n+self.加入*40
				end
			end
			self.物品数据[self.子类][n+self.加入*40]:置坐标(self.x+125+x横*51, self.y+80+x竖*50)
			self.物品数据[self.子类][n+self.加入*40]:显示(dt,x,y,self.鼠标)
			if self.选中编号2 ~= 0 and self.选中编号2 == n then
				self.选中显示2:显示(self.x+125+x横*51, self.y+80+x竖*51)
			end
		end
		if x横 == 8  then
			x横 = 1
			x竖=x竖+1
		else
			x横 = x横+1
		end
	end

	if self.选中编号 ~= 0 then
		tp.提示:道具行囊(x,y,self.物品数据[self.子类][self.选中编号].物品)
		if 引擎.鼠标弹起(左键) then
			self.价格 = self.数据[self.子类][self.选中编号].价格
			if self.商品编号 == self.选中编号 then
				self.数量 = self.数量 + 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
				return 0
			else
				self.数量 = 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
			end
			self.商品编号 = self.选中编号
		elseif 引擎.鼠标弹起(右键) and self.商品编号 == self.选中编号 and self.数量 > 1 then
			self.数量 = self.数量 - 1
			self.总额 = self.数量 * self.价格
			self.输入框:置文本(self.数量)
		end

	end
	if self.选中编号2 ~= 0 then
	    if self.数据[self.子类][self.选中编号2].分类 == 15 and (self.资源组[23] == nil or self.资源组[23].名称 ~= self.数据[self.子类][self.选中编号2].名称) then
	    	local n
	    	if self.数据[self.子类][self.选中编号2].名称 == "夜影" or self.数据[self.子类][self.选中编号2].名称 == "夏日清凉" or self.数据[self.子类][self.选中编号2].名称 == "华风汉雅" or self.数据[self.子类][self.选中编号2].名称 == "萌萌小厨" then
				临时资源包 = "shape0.npk"
				if self.数据[self.子类][self.选中编号2].名称 == "华风汉雅" or self.数据[self.子类][self.选中编号2].名称 == "萌萌小厨" then
					临时资源包 = "shape2.npk"
				end
				self.资源组[23] = tp.资源:载入(临时资源包,"网易锦衣动画",qzdjy(tp.队伍[1].模型.."_静立_"..self.数据[self.子类][self.选中编号2].名称))
				self.资源组[23]:置方向(0)
				if self.数据[self.子类][self.选中编号2].名称 == "夏日清凉" or self.数据[self.子类][self.选中编号2].名称 == "华风汉雅" or self.数据[self.子类][self.选中编号2].名称 == "萌萌小厨" then
					self.资源组[32] = tp.资源:载入("shape0.npk","网易锦衣动画",qzdjys(tp.队伍[1].模型.."_静立_"..self.数据[self.子类][self.选中编号2].名称.."_头"))
					self.资源组[32]:置方向(0)
				else
					self.资源组[32] = nil
				end
	        else
	        	n = qmxs(self.数据[self.子类][self.选中编号2].名称.."_"..tp.队伍[1].模型)
				self.资源组[23] = tp.资源:载入(n[3],"网易WDF动画",n[1])
				self.资源组[23]:置方向(0)
			end
			self.显示锦衣 = self.数据[self.子类][self.选中编号2].名称
			self.资源组[23].名称 = self.数据[self.子类][self.选中编号2].名称
			self.资源组[30] = nil
			self.资源组[31] = nil
		elseif self.数据[self.子类][self.选中编号2].分类 == 16 and self.数据[self.子类][self.选中编号2].子类 == 2 and self.数据[self.子类][self.选中编号2].总类 ~= "祥瑞" and (self.资源组[29] == nil or self.资源组[29].名称 ~= self.数据[self.子类][self.选中编号2].名称)then
			local n = 引擎.取光环(self.数据[self.子类][self.选中编号2].名称)
			self.资源组[29]=tp.资源:载入(n[4],"网易WDF动画",n[1])
			self.资源组[29]:置方向(0)
			self.显示足印 = self.数据[self.子类][self.选中编号2].名称
			self.资源组[29].名称 = self.数据[self.子类][self.选中编号2].名称
		elseif self.数据[self.子类][self.选中编号2].分类 == 17 and self.数据[self.子类][self.选中编号2].子类 == 3 and self.数据[self.子类][self.选中编号2].总类 ~= "祥瑞" and (self.资源组[33] == nil or self.资源组[33].名称 ~= self.数据[self.子类][self.选中编号2].名称)then
			local n = 引擎.取足迹(self.数据[self.子类][self.选中编号2].名称)
			self.资源组[33]=tp.资源:载入(n[4],"网易WDF动画",n[1])
			self.资源组[33]:置方向(0)
			self.显示足印 = self.数据[self.子类][self.选中编号2].名称
			self.资源组[33].名称 = self.数据[self.子类][self.选中编号2].名称
	    elseif self.数据[self.子类][self.选中编号2].总类 == "祥瑞" and (self.资源组[30] == nil or self.资源组[30].名称 ~= self.数据[self.子类][self.选中编号2].名称 ) then
	        local 坐骑资源 = zqj(tp.队伍[1].模型,self.数据[self.子类][self.选中编号2].名称,self.数据[self.子类][self.选中编号2].饰品 or "空")
			--self.资源组[31] = tp.资源:载入(坐骑资源.人物资源,"网易WDF动画",坐骑资源.人物站立)
			self.资源组[30] = tp.资源:载入(坐骑资源.坐骑资源,"网易WDF动画",坐骑资源.坐骑站立)
			--self.资源组[31]:置染色(tp.队伍[1].染色方案,tp.队伍[1].染色组[1],tp.队伍[1].染色组[2],tp.队伍[1].染色组[3])
			self.资源组[23] = nil
			self.资源组[32] = nil
			self.坐骑显示 = self.数据[self.子类][self.选中编号2].名称
			self.资源组[30].名称 = self.坐骑显示
			--local 坐骑补差x,坐骑补差y=0,0
			--坐骑补差x,坐骑补差y=引擎.补差(self.数据[self.子类][self.选中编号2].名称,tp.队伍[1].模型)
	    end
	end
	if self.资源组[33]~=nil then
	    self.资源组[33]:更新(dt)
	    self.资源组[33]:显示(self.x+518+155,self.y+265)
	end
	if self.资源组[29]~=nil then
	    self.资源组[29]:更新(dt)
	    self.资源组[29]:显示(self.x+518+155,self.y+265)
	end
	if self.资源组[30]~=nil then
	    self.资源组[30]:更新(dt)
	    self.资源组[30]:显示(self.x+518+155,self.y+265)
	end
	if self.资源组[31]~=nil then
	    self.资源组[31]:更新(dt)
	    self.资源组[31]:显示(self.x+518+155,self.y+265)
	end
	if self.资源组[23]~=nil then
		if self.资源组[32]~=nil then
		    self.资源组[32]:更新(dt)
		    self.资源组[32]:显示(self.x+518+155,self.y+265)
		end
	    self.资源组[23]:更新(dt)
	    tp.影子:显示(self.x+518+155,self.y+265)
	    self.资源组[23]:显示(self.x+518+155,self.y+265)
	end
	if self.输入框._已碰撞 then
		self.焦点 = true
	end
	self.资源组[27]:显示(self.x+735-154,self.y+127)
	self.资源组[28]:显示(self.x+735-154,self.y+369)
end

function 商城类:召唤兽类(dt,x,y)
	self.输入框:置可视(false,false)
	local bbsa = self.物品数据[self.分类].数量的
	if self.资源组[27]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 >0 then
			self.加入 = self.加入 - 1
		end
	elseif self.资源组[28]:事件判断() then
		-- self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
		self:初始系统(dt,x,y,0)
		if self.加入 <self.翻页数据 then
			self.加入 = self.加入 + 1
		end
	-- elseif (self.资源组[27]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==1 and self.加入 > 0 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入-1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	-- elseif (self.资源组[28]:是否选中(x,y) or self.资源组[35]:是否选中(x,y)) and 引擎.取鼠标滚轮() ==-1 and self.加入 < bbsa - 40 then
	-- 	self.资源组[35]:置起始点(self.资源组[35]:取百分比转换(self.加入+1,40,bbsa))
	-- 	self:初始系统(dt,x,y,0)
	end
	-- if bbsa > 40 then
	-- 	self.资源组[35]:置高度(min(floor(264/(bbsa-40)),104))
	-- 	self.加入 = min(ceil((bbsa-40)*self.资源组[35]:取百分比()),bbsa-40)
	-- end
	self.资源组[27]:更新(x,y,self.加入 > 0)
	self.资源组[28]:更新(x,y,self.加入 < self.翻页数据)
	self.焦点 = false
	-- self.资源组[26]:显示(self.x+457,self.y+130)

	if self.分类 == "金元宝宠物" then
	   银两显示(self.银两文字, self.元宝, self.x+400+110,self.y+ 431+30)
	else
	   银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
    end
	银两显示(self.银两文字1, self.价格,self.x+205+110,self.y+ 406+30)
	银两显示(self.银两文字2, self.总额,self.x+205+110,self.y+ 431+30)
	self.资源组[39]:显示(self.x+567,self.y+125)
	self.资源组[7]:显示(self.x+518+155-63,self.y+265+15+50)
	if self.选中编号4 ~= 0 then
		self.资源组[24] = nil
		self.资源组[37] = nil
		local n = ani(self.数据[self.分类][self.选中编号4].模型)
		self.资源组[24] = tp.资源:载入(n[10],"网易WDF动画",n[6])

		if ani(self.数据[self.分类][self.选中编号4].模型.."_饰品") ~= nil and #ani(self.数据[self.分类][self.选中编号4].模型.."_饰品") >0 then
			n = ani(self.数据[self.分类][self.选中编号4].模型.."_饰品")
			self.资源组[37] = tp.资源:载入(n[10],"网易WDF动画",n[6])
		end
		if self.数据[self.分类][self.选中编号4].染色方案 ~= nil then
			if self.数据[self.分类][self.选中编号4].染色方案 == "黑白" then
				self.资源组[24]:置染色("黑白",ARGB(255,235,235,235))
				if self.数据[self.分类][self.选中编号4].饰品 ~= nil then
					self.资源组[37]:置染色("黑白",ARGB(255,185,185,185))
				end
			else
				self.资源组[24]:置染色(self.数据[self.分类][self.选中编号4].染色方案,self.数据[self.分类][self.选中编号4].染色组[1],self.数据[self.分类][self.选中编号4].染色组[2],self.数据[self.分类][self.选中编号4].染色组[3])
			end
		end
		if self.资源组[37]~=nil then
		    self.资源组[37]:置方向(0)
		end
		self.选中编号4=0
		self.资源组[24]:置方向(0)
	end
	if self.资源组[24]~=nil then
	    self.资源组[24]:更新(dt)
	    tp.影子:显示(self.x+518+155,self.y+265+15)
	    self.资源组[24]:显示(self.x+518+155,self.y+265+15)
		if self.资源组[37] ~= nil then
			self.资源组[37]:更新(dt)
			self.资源组[37]:显示(self.x+518+155,self.y+265+15)
		end
	end
	self.选中编号 = 0
	local x横,x竖 = 1,1
	for n = 1, 40 do
		if self.物品数据[self.分类][n+self.加入*40]~=nil then
			if self.物品数据[self.分类][n+self.加入*40]:是否选中(x,y) then
				self.选中编号 = n+self.加入*40
				tp.提示:自定义(x-42,y+27,self.数据[self.分类][n+self.加入*40].名称)
				if 引擎.鼠标弹起(左键) then
				    self.选中编号2=n
				    self.选中编号3 = n+self.加入*40
				    self.选中编号4 = n+self.加入*40
				end
			end
			self.物品数据[self.分类][n+self.加入*40]:显示(self.x+130+x横*51, self.y+90+x竖*50)
			if self.选中编号 ~= 0 and self.选中编号 == n+self.加入*40 then
				self.选中显示:显示(self.x+125+x横*51, self.y+80+x竖*51)
			end
			if self.选中编号2 ~= 0 and self.选中编号2 == n then
				if self.选中编号3 ~= 0 and self.资源组[7]:事件判断() or (引擎.鼠标弹起(右键) and self.物品数据[self.分类][n+self.加入*40]:是否选中(x,y)) then
					tp.窗口.对话栏:文本("普陀_接引仙女","神兽乐园","请选择您要查看的神兽类型",{"法系神兽","物理神兽"})

				end
				--if self.分类 == "金元宝宠物" then
	            --   银两显示(self.银两文字, self.元宝, self.x+400+110,self.y+ 431+30)
	            --else
	            --   银两显示(self.银两文字, self.仙玉, self.x+400+110,self.y+ 431+30)
                --end
				self.选中显示2:显示(self.x+125+x横*51, self.y+80+x竖*51)
				zts2:置颜色(红色)
				zts2:显示(self.x+425+200,self.y+145, self.数据[self.分类][self.选中编号3].名称)
				zts2:置颜色(红色)
			end
		end
		if x横 == 8  then
			x横 = 1
			x竖=x竖+1
		else
			x横 = x横+1
		end
	end
	if self.选中编号 ~= 0 then
		-- self.物品数据[self.分类][self.选中编号]:显示事件()
		if 引擎.鼠标弹起(左键) and self.选中编号3~=0 then
			self.价格 = self.物品数据[self.分类][self.选中编号3].价格--self.数据[self.分类][self.选中编号3].价格
			if self.商品编号 == self.选中编号 then
				self.数量 = 1--self.数量 + 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
				return 0
			else
				self.数量 = 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
			end
			self.商品编号 = self.选中编号
		elseif 引擎.鼠标弹起(右键) and self.商品编号 == self.选中编号 and self.数量 > 1 then
			self.数量 = self.数量 - 1
			self.总额 = self.数量 * self.价格
			self.输入框:置文本(self.数量)
		end
	end
	-- tp.画线:置区域(0,0,15,280)--滑块虚线
	-- tp.画线:显示(self.x+611-23,self.y+100+51)
	self.资源组[27]:显示(self.x+735-154,self.y+127)
	self.资源组[28]:显示(self.x+735-154,self.y+369)
	-- if bbsa > 35 then
	-- 	self.资源组[35]:显示(self.x+608-23,self.y+147+24,x,y,self.鼠标)
	-- end
end

function 商城类:初始移动(x,y)
	tp.运行时间 = tp.运行时间 + 1
	if not tp.消息栏焦点 then
  		self.窗口时间 = tp.运行时间
 	end
	if not self.焦点 then
		tp.移动窗口 = true
	end
	if self.可视 and self.鼠标 and  not self.焦点 then
		self.xx = x - self.x
		self.yy = y - self.y
	end
end

function 商城类:开始移动(x,y)
	if self.可视 and self.鼠标 then
		self.x = x - self.xx
		self.y = y - self.yy
	end
end

return 商城类
