--======================================================================--

--======================================================================--
local 系统类_活跃商城 = class()
local floor = math.floor
local tp,zts,zt
local format = string.format
local insert = table.insert
local 商品组 = {}
商品组[19] = {活跃兑换={}}
商品组[19]["活跃兑换"]={
        {价格=300,可叠加=true,名称="双倍经验丹"},
        --{价格=200,可叠加=false,名称="小额银票"},
		--{价格=2000,可叠加=false,名称="大额银票"},
	    {价格=1,可叠加=true,总类=9,名称="初级神魂丹",分类=1,子类=1},
		{价格=5,可叠加=true,总类=9,名称="中级神魂丹",分类=1,子类=1},
		{价格=30,可叠加=true,总类=9,名称="高级神魂丹",分类=1,子类=1},
		{价格=500,可叠加=true,总类=9,名称="坐骑内丹",分类=1,子类=1},

	    {价格=30,可叠加=false,总类=5,附加特性="心源",级别限制=15,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="狂浪滔天",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="固若金汤",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="锐不可当",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="通真达灵",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="血气方刚",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="健步如飞",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},

	    {价格=20,可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,级别限制=15},
		{价格=20,可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,级别限制=15},
		{价格=20,可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,级别限制=15},
		{价格=20,可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,级别限制=15},
		{价格=20,可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,级别限制=15},
		{价格=20,可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,级别限制=15},
		{价格=20,可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,级别限制=15},
		{价格=20,可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,级别限制=15},
		{价格=300,技能="高级夜战",类型="速度",造型="幽灵",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级偷袭",类型="速度",造型="吸血鬼",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级必杀",类型="伤害",造型="鬼将",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级连击",类型="伤害",造型="律法女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="气血",造型="灵符女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="灵力",造型="大力金刚",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级敏捷",类型="防御",造型="雾中仙",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级法术暴击",类型="灵力",造型="灵鹤",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="气血",造型="炎魔神",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级夜战",类型="速度",造型="夜罗刹",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级强力",类型="速度",造型="噬天虎",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},

        {价格=100,附带技能="观照万象",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="净台妙谛",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="理直气壮",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="叱咤风云",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="天降灵葫",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="千钧一怒",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="龙魂",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="灵山禅语",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="浮云神马",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="大快朵颐",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="从天而降",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="八凶法阵",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="灵能激发",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="法术防御",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="死亡召唤",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="苍鸾怒击",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="夜舞倾城",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="壁垒击破",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="月光",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="剑荡四方",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="嗜血追击",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="上古灵符",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="惊心一剑",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="驱怪",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="力劈华山",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="须弥真言",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="善恶有报",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},

		{价格=100,体质=50,力量=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,魔力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,耐力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,敏捷=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,力量=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,魔力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,耐力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},

	    {价格=100,体质=50,力量=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,魔力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,耐力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,敏捷=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,力量=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,魔力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,耐力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},

	    {价格=80,防御=200,魔法=300,特效="无级别限制",特技="魔兽之印",名称="浑天玄火盔",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=1,子类=1,识别码="6_1598869982_3033943_430"},
	    {价格=80,防御=200,气血=600,特效="无级别限制",特技="晶清诀",名称="紫霄云芒带",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=5,子类=1,识别码="6_1598869982_1261519_444"},
	    {价格=80,防御=200,敏捷=200,特效="无级别限制",特技="圣灵之甲",名称="辟尘分光履",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=6,子类=1,识别码="6_1598869982_1363505_452"},
	    {价格=100,灵力=500,特效="无级别限制",特技="四海升平",名称="落霞陨星坠",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=2,子类=1,识别码="6_1598869982_3041294_436"},

        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="法术暴击等级",强化=0,数值=10},[2]={类型="法术暴击等级",强化=0,数值=10},[3]={类型="法术暴击等级",强化=0,数值=10},[4]={类型="法术暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="法术伤害",强化=0,数值=20},[2]={类型="法术伤害",强化=0,数值=20},[3]={类型="法术伤害",强化=0,数值=20},[4]={类型="法术伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="物理暴击等级",强化=0,数值=10},[2]={类型="物理暴击等级",强化=0,数值=10},[3]={类型="物理暴击等级",强化=0,数值=10},[4]={类型="物理暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="伤害",强化=0,数值=20},[2]={类型="伤害",强化=0,数值=20},[3]={类型="伤害",强化=0,数值=20},[4]={类型="伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="治疗能力",强化=0,数值=20},[2]={类型="治疗能力",强化=0,数值=20},[3]={类型="治疗能力",强化=0,数值=20},[4]={类型="治疗能力",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="封印命中等级",强化=0,数值=10},[2]={类型="封印命中等级",强化=0,数值=10},[3]={类型="封印命中等级",强化=0,数值=10},[4]={类型="封印命中等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="法术暴击等级",强化=0,数值=10},[2]={类型="法术暴击等级",强化=0,数值=10},[3]={类型="法术暴击等级",强化=0,数值=10},[4]={类型="法术暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="法术伤害",强化=0,数值=20},[2]={类型="法术伤害",强化=0,数值=20},[3]={类型="法术伤害",强化=0,数值=20},[4]={类型="法术伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="物理暴击等级",强化=0,数值=10},[2]={类型="物理暴击等级",强化=0,数值=10},[3]={类型="物理暴击等级",强化=0,数值=10},[4]={类型="物理暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="伤害",强化=0,数值=20},[2]={类型="伤害",强化=0,数值=20},[3]={类型="伤害",强化=0,数值=20},[4]={类型="伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="治疗能力",强化=0,数值=20},[2]={类型="治疗能力",强化=0,数值=20},[3]={类型="治疗能力",强化=0,数值=20},[4]={类型="治疗能力",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="封印命中等级",强化=0,数值=10},[2]={类型="封印命中等级",强化=0,数值=10},[3]={类型="封印命中等级",强化=0,数值=10},[4]={类型="封印命中等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="手镯",特效="无级别限制",名称="浮雪幻音",幻化属性={基础={类型="抵抗封印等级",强化=0,数值=20},附加={[1]={类型="气血",强化=0,数值=50},[2]={类型="气血",强化=0,数值=50},[3]={类型="气血",强化=0,数值=50},[4]={类型="气血",强化=0,数值=50}}},制造者="活跃度兑换",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="手镯",特效="无级别限制",名称="浮雪幻音",幻化属性={基础={类型="封印命中等级",强化=0,数值=20},附加={[1]={类型="气血",强化=0,数值=50},[2]={类型="气血",强化=0,数值=50},[3]={类型="气血",强化=0,数值=50},[4]={类型="气血",强化=0,数值=50}}},制造者="活跃度兑换",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="佩饰",特效="无级别限制",名称="碧海青天",幻化属性={基础={类型="速度",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},

	    {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝带",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝带",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},

        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝圈",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝圈",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},

        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕织甲",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕织甲",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},

   	}
function 系统类_活跃商城:初始化(根)
	self.x = 230
	self.y = 110
	self.xx = 0
	self.yy = 0
	self.ID = 101
	self.注释 = "活跃商城"
	self.可视 = false
	self.鼠标 = false
	self.焦点 = false
	self.可移动 = true
	tp = 根
	self.银两文字 = tp.文字类.创建(wdf配置.."/font/simsun.ttc", 15)
	self.银两文字:置颜色(黄色)
	self.窗口时间 = 0
	self.选中编号 = 0
	self.选中编号2 = 0
	self.选中编号3 = 0
	self.加入 = 0
	self.控件类 = require("ggeui/加载类")()
	local 总控件 = self.控件类:创建控件('给予总控件')
	总控件:置可视(true,true)
	self.输入框 = 总控件:创建输入("银两输入",0,0,100,14)
	self.输入框:置可视(false,false)
	self.输入框:置限制字数(8)
	self.输入框:置数字模式()
	self.输入框:屏蔽快捷键(true)
	self.输入框:置光标颜色(-16777216)
	self.输入框:置文字颜色(-16777216)
	zts = tp.字体表.道具字体
	zt = tp.字体表.描边字体
end

function 系统类_活跃商城:打开(数据)
	if self.可视 then
		self.可视 = false
		self.选中编号 = 0
		self.选中编号2 = 0
		self.选中编号3 = 0
		self.物品数据={}
		self.输入框:置可视(false,false)
		self.资源组 = nil
		self.选中显示 = nil
		self.选中显示2 = nil
		self.购买 = nil
		self.上滚动 = nil
	    self.下滚动 = nil
        --self.翻页数据 = math.floor(self.物品数据/48)

		return
	else
		insert(tp.窗口_,self)
		local 资源 = tp.资源
		local 按钮 = tp._按钮
		local 自适应 = tp._自适应
		self.资源组 = {
			[1] = pwd("3"),
		}
		self.选中显示 = 资源:载入('wzife.wdf',"网易WDF动画",0x6F88F494)
		self.选中显示2 = 资源:载入('wzife.wdf',"网易WDF动画",0x10921CA7)
		self.购买 = 按钮.创建(pwd("11"),0,0,2,true,true," 购  买")
		self.上滚动 = 按钮.创建(pwd("11"),0,0,2,true,true," 上一页")
		self.下滚动 = 按钮.创建(pwd("11"),0,0,2,true,true," 下一页")
		--self.数据=数据["活跃兑换"]

		self.数据=商品组[数据.组号]["活跃兑换"]
		self.组号 = 数据.组号
		self.数据.仙灵玉 = 数据.仙灵玉
		self.数据.元宝 = 数据.元宝
		self.数据.银子 = 数据.银子
		self.数据.积分数 = 数据.积分数
		self.数据.组号 = 数据.组号
		self.数据.序列 = 数据.序列
		self.物品数据={}
		self.商品编号 = 0
		for i=1,#商品组[数据.组号]["活跃兑换"] do
			self.物品数据[i] = tp._物品格子.创建(0,0,i,"活跃商品")
			self.物品数据[i]:置物品(商品组[数据.组号]["活跃兑换"][i])
			self.物品数据.数量的=#商品组[数据.组号]["活跃兑换"]
			self.物品数据[i].编号 = n
			self.物品数据[i].价格=商品组[数据.组号]["活跃兑换"][i].价格
		end
		self.可用活跃=数据.积分数.当前活跃
		self.总积分=数据.积分数.累积活跃
		self.数量 = 1
		self.价格 = 0
		self.总额 = 0
		self.输入框:置可视(true,true)
	    self.输入框:置文本("")
		tp.运行时间 = tp.运行时间 + 1
	    self.窗口时间 = tp.运行时间
	    self.可视 = true
	end
end

function 系统类_活跃商城:显示(dt,x,y)
	self.购买:更新(x,y,self.商品编号 ~= 0)
	if self.输入框:取文本() ~= "" and self.数量 ~= (self.输入框:取文本()+0) then
		self.数量 = 到整数(self.输入框:取文本())
		self.总额 = self.数量 * self.价格
	end
	self.焦点 = false
	self.资源组[1]:显示(self.x,self.y)
	self.输入框:置可视(true,true)
	self.输入框:置坐标(self.x+255,self.y+375)
	self.控件类:更新(dt,x,y)
	self.控件类:显示(x,y)
	银两显示(self.银两文字, self.可用活跃, self.x+20,self.y+ 375)
	银两显示(self.银两文字, self.总额,self.x+150,self.y+ 375)
	self.购买:显示(self.x+340, self.y+367)
	self.上滚动:更新(x,y)
	self.下滚动:更新(x,y)
	self.选中编号 = 0
	if self.购买:事件判断() then
	    if self.商品编号 == 0 then
			tp.提示:写入("#y/请先选择一件商品")
		else
			if self.商品编号~=0 then
				if self.可用活跃< self.物品数据[self.商品编号].价格 then
				    tp.提示:写入("#y/当前可用活跃不够兑换商品!")
				    return
				end
				self.可用活跃=self.可用活跃-self.物品数据[self.商品编号].价格*self.数量
				self.发送信息 = {
					编号 = self.商品编号,--self.物品数据[self.商品编号].编号,
					位置 =self.商品编号,
					数量 = self.数量,
					组号 = self.组号,
					分类 = "活跃兑换"
				}
				发送数据(30,self.发送信息)
			end
		end
	end
	if self.上滚动:事件判断() then
		if self.加入 >0 then
			self.加入 = self.加入 -1
		end
	elseif self.下滚动:事件判断() then
        --if self.加入 < self.翻页数据 then
			self.加入 = self.加入 + 1
		--end
	end
	local bbsa = self.物品数据.数量的
	local x横,x竖 = 0,0
	for n = 1, 48 do
		if self.物品数据[n+self.加入*48]~=nil then
			if self.物品数据[n+self.加入*48].焦点 then
				self.选中编号 = n+self.加入*48
				if 引擎.鼠标弹起(左键) then
				    self.选中编号2=n
				    self.选中编号3 = n+self.加入*48
				end
			end
			self.物品数据[n+self.加入*48]:置坐标(self.x+15+x横*51, self.y+35+x竖*51)
			self.物品数据[n+self.加入*48]:显示(dt,x,y,self.鼠标)
			if self.选中编号2 ~= 0 and self.选中编号2 == n then
				self.选中显示2:显示(self.x+15+x横*51, self.y+36+x竖*51)
			end
		end
		if x横 == 7 then
			x横 = 0
			x竖=x竖+1
		else
			x横 = x横+1
		end
	end
	self.上滚动:显示(self.x+257, self.y+342)
	self.下滚动:显示(self.x+340, self.y+342)
	if self.选中编号 ~= 0 then
		if self.物品数据[self.选中编号].焦点 then
		    tp.提示:道具行囊(x,y,self.物品数据[self.选中编号].物品)
		end
		if 引擎.鼠标弹起(左键)  then
			self.价格 = self.数据[self.选中编号].价格
			if self.商品编号 == self.选中编号 then
				self.数量 = self.数量
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
				return 0
			else
				--self.商品编号 = self.选中编号
				self.数量 = 1
				self.总额 = self.数量 * self.价格
				self.输入框:置文本(self.数量)
			end
			self.商品编号 = self.选中编号
		elseif 引擎.鼠标弹起(右键) and self.商品编号 == self.选中编号 and self.数量 > 1 then
			self.数量 = self.数量 - 1
			self.总额 = self.数量 * self.价格
			self.输入框:置文本(self.数量)
		end
	end
	if self.输入框._已碰撞 then
		self.焦点 = true
	end
end

function 系统类_活跃商城:检查点(x,y)
	if self.资源组 ~= nil and self.资源组[1]:是否选中(x,y)  then
		return true
	end
end

function 系统类_活跃商城:初始移动(x,y)
	tp.运行时间 = tp.运行时间 + 1
	if not tp.消息栏焦点 then
  		self.窗口时间 = tp.运行时间
 	end
	if not self.焦点 then
		tp.移动窗口 = true
	end
	if self.鼠标 and  not self.焦点 then
		self.xx = x - self.x
		self.yy = y - self.y
	end
end

function 系统类_活跃商城:开始移动(x,y)
	if self.鼠标 then
		self.x = x - self.xx
		self.y = y - self.yy
	end
end

return 系统类_活跃商城