--======================================================================--

--======================================================================--
local 商城处理类 = class()

function 商城处理类:初始化()
	self.购买组号=nil
	self.购买编号=nil
	self.购买数量=nil
	self.购买分类=nil
end

function 商城处理类:加载商品()
	self.商品组 = {}
	self.商品组[18] = {杂货={},仙玉={},金元宝2={},折扣={},宝宝={},法宝={},金元宝宠物={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},人物装备={},宠物装备={},杂货一类={},杂货二类={}}
	self.商品组[19] = {活跃兑换={}}
	self.商品组[18]["杂货"]={
	    {价格=1,可叠加=true,总类=9,名称="飞行符",分类=1,子类=1},
		{价格=1,可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=167,x=362},[6]={y=240,x=277},[8]={y=276,x=527}},地图=1001,子类=50,y=7,x=312,分类=2,次数=70,名称="红色合成旗"},
		{价格=1,可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}},地图=1092,子类=50,y=7,x=312,分类=2,次数=70,名称="黄色合成旗"},
		{价格=1,可叠加=false,总类=11,xy={[1]={y=203,x=141},[2]={y=183,x=33},[3]={y=74,x=52},[4]={y=14,x=107}},地图=1070,子类=50,y=7,x=312,分类=2,次数=70,名称="蓝色合成旗"},
		{价格=1,可叠加=false,名称="红色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="绿色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="蓝色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="白色导标旗",总类=11,分类=1},
		{价格=1,可叠加=false,名称="黄色导标旗",总类=11,分类=1},
		{价格=1,可叠加=true,名称="一倍经验丹"},
		{价格=1,可叠加=true,名称="摄妖香"},
		{价格=1,可叠加=true,名称="洞冥草"},
		{价格=1,可叠加=true,名称="秘制红罗羹"},
		{价格=1,可叠加=true,名称="秘制绿罗羹"},
		{价格=1,可叠加=true,总类=4,名称="天眼通符",分类=2,子类=0},
		--{子类=1,总类=3,名称="超级金柳露",价格=f函数.读配置(程序目录.."Shopping.ini","银子商城","超级金柳露")+0,分类=2},
		{价格=1,子类=0,总类=3,名称="金柳露",分类=2},
		{价格=1,可叠加=true,名称="海马"},
		{价格=1,可叠加=true,名称="彩果"},
		{价格=1,可叠加=true,名称="金银锦盒"},
		{价格=1,可叠加=false,总类=13,子类="天覆阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="地载阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="风扬阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="云垂阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="龙飞阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="虎翼阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="鸟翔阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="蛇蟠阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=1,可叠加=false,总类=13,子类="鹰啸阵",识别码="2_1599892287_174_61000010086",名称="鬼谷子",分类=3},
		--{价格=1,可叠加=false,总类=13,子类="雷绝阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},

		--{可叠加=true,总类=9,名称="初级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","初级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="中级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","中级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="高级神魂丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","高级神魂丹")+0,分类=1,子类=1},
		--{可叠加=true,总类=9,名称="坐骑内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","坐骑内丹")+0,分类=1,子类=1},
	}

	self.商品组[18]["仙玉"]={
	    {价格=1,可叠加=true,子类=1,总类=5,名称="青龙石",分类=4},
		{价格=1,可叠加=true,子类=2,总类=5,名称="白虎石",分类=4},
		{价格=1,可叠加=true,子类=3,总类=5,名称="朱雀石",分类=4},
		{价格=1,可叠加=true,子类=4,总类=5,名称="玄武石",分类=4},
		{价格=1,可叠加=false,名称="附魔宝珠"},
		{价格=1,可叠加=false,名称="含沙射影",耐久=5000,分类=60,总类=2000},
		{价格=1,可叠加=false,名称="回龙摄魂标",耐久=5000,分类=70,总类=2000},
		{价格=1,可叠加=false,名称="寸阴若梦",耐久=5000,分类=80,总类=2000},
		{价格=1,可叠加=false,名称="魔睛子",耐久=5000,分类=90,总类=2000},
		{价格=1,可叠加=false,名称="顺逆神针",耐久=5000,分类=100,总类=2000},

		{价格=1,可叠加=false,名称="太阳石礼包"},
		{价格=1,可叠加=false,名称="红玛瑙礼包"},
		{价格=1,可叠加=false,名称="舍利子礼包"},
		{价格=1,可叠加=false,名称="光芒石礼包"},
		{价格=1,可叠加=false,名称="黑宝石礼包"},
		{价格=1,可叠加=false,名称="月亮石礼包"},
		{价格=1,可叠加=false,名称="神秘石礼包"},
		{价格=1,可叠加=false,名称="星辉石礼包"},

		-- {可叠加=false,名称="90级装备礼包",价格=1},
		-- {可叠加=false,名称="100级装备礼包",价格=1},
		-- {可叠加=false,名称="120级装备礼包",价格=1},
		-- {可叠加=false,名称="130级装备礼包",价格=1},
		-- {可叠加=false,名称="140级装备礼包",价格=1},
		-- {可叠加=false,名称="150级装备礼包",价格=1},
		{价格=1,可叠加=false,名称="160级装备礼包"},
		--{可叠加=false,名称="160级高级装备礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","160级高级装备礼包")+0},
		--{可叠加=false,名称="跨服专属礼包",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","跨服专属礼包")+0},
		--{可叠加=false,名称="120级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级随机灵饰指南书")+0},
		--{可叠加=false,名称="140级随机灵饰指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机灵饰指南书")+0},
		--{价格=1,特效="耳饰",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="戒指",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="手镯",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{价格=1,特效="佩饰",子类=140,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="耳饰",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="戒指",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="手镯",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		{价格=1,特效="佩饰",子类=160,名称="灵饰指南书",可叠加=false,总类=5,识别码="3_1598620317_8097885_96",分类=20},
		--{可叠加=false,名称="120级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","120级元灵晶石")+0},
		--{可叠加=false,名称="140级元灵晶石",价格=f函数.读配置(程序目录.."Shopping.ini","积分商城","140级元灵晶石")+0},
		{价格=1,可叠加=false,名称="160级元灵晶石"},
		-- {可叠加=false,名称="摇钱树苗",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","小额银票")+0},
		{价格=1,可叠加=false,名称="碎星锤"},
		{价格=1,可叠加=false,名称="超级碎星锤"},
		{价格=1,可叠加=false,名称="珍珠",总类=5,分类=6,级别限制=160},
		{价格=1,可叠加=false,名称="融合石",总类=5,分类=6,子类=9},
		--{可叠加=false,名称="制造指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机指南书")+0},
		{价格=1,可叠加=false,名称="随机制造指南书"},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=60},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=70},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=80},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=90},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=100},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=110},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=120},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=130},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=140},
		{价格=1,可叠加=false,名称="百炼精铁",总类=5,分类=2,子类=150},
		--{可叠加=false,名称="140级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","140级随机指南书")+0},
		--{可叠加=false,名称="150级随机指南书",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","150级随机指南书")+0},

		{价格=1,可叠加=false,名称="神兵图鉴",总类=4,分类=2,子类=180},
		{价格=1,可叠加=false,名称="灵宝图鉴",总类=4,分类=2,子类=180},
		{价格=1,可叠加=true,名称="空白强化符"},
		{价格=0,总类=55,识别码="4_1598948961_552_21000010086",耐久度=150,等级=1,颜色="红色",子类=1,法术防御=1,名称="电符石",分类=1},
        {价格=0,总类=55,耐久度=150,等级=1,颜色="红色",子类=1,识别码="4_1598948945_416_21000010086",名称="冰符石",分类=1,体质=1},
        {价格=0,总类=55,耐久度=150,名称="雷符石",等级=1,颜色="红色",子类=1,识别码="4_1598948957_841_21000010086",敏捷=1,分类=1},
        {价格=0,总类=55,耐久度=150,等级=1,颜色="红色",子类=1,识别码="4_1598948953_828_21000010086",耐力=1,名称="土符石",分类=1},
        {价格=0,魔力=1,总类=55,耐久度=150,等级=1,颜色="黄色",子类=1,识别码="4_1598948965_60_21000010086",名称="风符石",分类=2},
        {价格=0,总类=55,耐久度=150,力量=1,等级=1,颜色="黄色",子类=1,识别码="4_1598948969_364_21000010086",名称="炎符石",分类=2},
        {价格=0,总类=55,法术伤害=1,耐久度=150,等级=1,颜色="黄色",子类=1,识别码="4_1598948973_871_21000010086",名称="火符石",分类=2},

        {价格=0,防御=3,总类=55,耐久度=150,等级=2,颜色="红色",子类=1,识别码="4_1598949148_771_21000010086",名称="碧玉符石",分类=1},
        {价格=0,总类=55,命中=4,耐久度=150,等级=2,颜色="蓝色",子类=1,识别码="4_1598949151_914_21000010086",名称="金光符石",分类=3},
        {价格=0,总类=55,耐久度=150,等级=2,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598949156_63_21000010086",名称="天神符石",分类=3},
        {价格=0,总类=55,耐久度=150,灵力=1.5,等级=2,颜色="绿色",子类=1,识别码="4_1598949160_549_21000010086",名称="飘渺符石",分类=4},
        {价格=0,总类=55,识别码="4_1598949185_405_21000010086",耐久度=150,等级=2,颜色="绿色",子类=1,魔法=6,名称="天仙符石",分类=4},
        {价格=0,总类=55,耐久度=150,速度=1.5,等级=2,颜色="绿色",子类=1,识别码="4_1598949189_582_21000010086",名称="霞光符石",分类=4},
        {价格=0,总类=55,耐久度=150,躲避=3,等级=2,颜色="绿色",子类=1,识别码="4_1598949194_627_21000010086",名称="逍遥符石",分类=4},

	    {价格=0,总类=55,识别码="4_1598947678_143_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,魔法=6,名称="虹珀符石",分类=3,体质=1},
	    {价格=0,总类=55,命中=4,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947783_254_21000010086",名称="陌影符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598947789_800_21000010086",名称="北冥符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,等级=3,颜色="蓝色",防御=3,子类=1,识别码="4_1598947793_900_21000010086",名称="灵月符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,速度=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947798_795_21000010086",名称="锦瑟符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,躲避=3,等级=3,颜色="蓝色",子类=1,识别码="4_1598947802_347_21000010086",名称="银光符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,灵力=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947807_608_21000010086",名称="清心符石",分类=3,体质=1},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947811_343_21000010086",名称="星辰符石",分类=3,体质=1},
	    {价格=0,总类=55,识别码="4_1598947816_785_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,法术防御=2,名称="雪月符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="蓝色",子类=1,识别码="4_1598947820_642_21000010086",名称="玄魂符石",分类=3,体质=1},
	    {价格=0,总类=55,耐久度=150,名称="乾坤符石",等级=3,颜色="蓝色",子类=1,识别码="4_1598947824_811_21000010086",耐力=1,气血=10,分类=3},
	    {价格=0,总类=55,识别码="4_1598947829_604_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,魔法=6,耐力=1,名称="珍珀符石",分类=3},
	    {价格=0,总类=55,命中=4,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947846_143_21000010086",耐力=1,名称="银竹符石",分类=3},
	    {价格=0,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="蓝色",子类=1,识别码="4_1598947851_666_21000010086",耐力=1,名称="神川符石",分类=3},
	    {价格=0,总类=55,耐久度=150,速度=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947860_279_21000010086",耐力=1,名称="玲珑符石",分类=3},
	    {价格=0,总类=55,耐久度=150,躲避=3,等级=3,颜色="蓝色",子类=1,识别码="4_1598947864_793_21000010086",耐力=1,名称="暮影符石",分类=3},
	    {价格=0,总类=55,耐久度=150,灵力=1.5,等级=3,颜色="蓝色",子类=1,识别码="4_1598947874_858_21000010086",耐力=1,名称="天珍符石",分类=3},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="蓝色",子类=1,识别码="4_1598947884_460_21000010086",耐力=1,名称="九影符石",分类=3},
	    {价格=0,总类=55,识别码="4_1598947889_494_21000010086",耐久度=150,等级=3,颜色="蓝色",子类=1,法术防御=2,耐力=1,名称="百冥符石",分类=3},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="蓝色",子类=1,识别码="4_1598947898_389_21000010086",耐力=1,名称="莫念符石",分类=3},

	   	{价格=0,魔力=1,总类=55,命中=4,耐久度=150,等级=3,颜色="白色",子类=1,识别码="4_1598948373_851_21000010086",名称="玄羽符石",分类=5},
	   	{价格=0,魔力=1,总类=55,法术伤害=2,耐久度=150,等级=3,颜色="白色",子类=1,识别码="4_1598948409_179_21000010086",名称="流风符石",分类=5},
	    {价格=0,魔力=1,总类=55,识别码="4_1598948405_406_21000010086",耐久度=150,等级=3,颜色="白色",子类=1,法术防御=2,名称="子蚀符石",分类=5},
	    {价格=0,魔力=1,总类=55,识别码="4_1598948401_771_21000010086",耐久度=150,等级=3,颜色="白色",子类=1,魔法=6,名称="昔光符石",分类=5},
	   	{价格=0,魔力=1,总类=55,耐久度=150,固定伤害=2,等级=3,颜色="白色",子类=1,识别码="4_1598948397_569_21000010086",名称="圣火符石",分类=5},
	    {价格=0,魔力=1,总类=55,耐久度=150,名称="醉魂符石",等级=3,颜色="白色",子类=1,识别码="4_1598948368_86_21000010086",气血=10,分类=5},
	    {价格=0,魔力=1,总类=55,耐久度=150,躲避=3,等级=3,颜色="白色",子类=1,识别码="4_1598948392_762_21000010086",名称="紫晶符石",分类=5},
	  	{价格=0,魔力=1,总类=55,耐久度=150,速度=1.5,等级=3,颜色="白色",子类=1,识别码="4_1598948388_371_21000010086",名称="无极符石",分类=5},
	    {价格=0,总类=55,识别码="4_1598948440_792_21000010086",耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,法术防御=2,名称="九凤符石",分类=6},
	    {价格=0,魔力=1,总类=55,耐久度=150,防御=3,等级=3,颜色="白色",子类=1,识别码="4_1598948383_860_21000010086",名称="无相符石",分类=5},
	   	{价格=0,魔力=1,总类=55,耐久度=150,等级=3,伤害=1.5,颜色="白色",子类=1,识别码="4_1598948377_546_21000010086",名称="霸风符石",分类=5},

	    {价格=0,总类=55,耐久度=150,灵力=1.5,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948435_325_21000010086",名称="流魂符石",分类=6},
	    {价格=0,总类=55,耐久度=150,躲避=3,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948431_628_21000010086",名称="苍玉符石",分类=6},
	    {价格=0,总类=55,耐久度=150,速度=1.5,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948427_537_21000010086",名称="降龙符石",分类=6},
	    {价格=0,总类=55,识别码="4_1598948417_334_21000010086",耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,魔法=6,名称="素影符石",分类=6},
	    {价格=0,总类=55,耐久度=150,名称="地炎符石",力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948413_644_21000010086",气血=10,分类=6},
	    {价格=0,总类=55,耐久度=150,固定伤害=2,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948454_360_21000010086",名称="南夕符石",分类=6},
	    {价格=0,总类=55,法术伤害=2,耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948444_856_21000010086",名称="墨陀符石",分类=6},
	    {价格=0,防御=3,总类=55,耐久度=150,力量=1,等级=3,颜色="黑色",子类=1,识别码="4_1598948422_632_21000010086",名称="燕灵符石",分类=6},

	    {价格=0,耐久度=150,总类=55,气血=10,名称="引幽符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948463_150_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,命中=4,名称="铃星符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948768_310_21000010086",敏捷=1,分类=7},
	    {价格=0,防御=3,总类=55,耐久度=150,名称="召影符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948793_83_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,固定伤害=2,名称="七情符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948789_489_21000010086",敏捷=1,分类=7},
	    {价格=0,识别码="4_1598948762_592_21000010086",总类=55,耐久度=150,名称="波涛符石",等级=3,颜色="紫色",子类=1,魔法=6,敏捷=1,分类=7},
	    {价格=0,识别码="4_1598948785_206_21000010086",总类=55,耐久度=150,名称="两仪符石",等级=3,颜色="紫色",子类=1,法术防御=2,敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,法术伤害=2,名称="幽月符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948780_427_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,灵力=1.5,名称="乱花符石",等级=3,颜色="紫色",子类=1,识别码="4_1598948776_653_21000010086",敏捷=1,分类=7},
	    {价格=0,耐久度=150,总类=55,等级=3,名称="狂念符石",伤害=1.5,颜色="紫色",子类=1,识别码="4_1598948772_116_21000010086",敏捷=1,分类=7},




		-- {可叠加=false,名称="内丹",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","内丹",价)+0,总类=1001},
		-- {可叠加=false,名称="天蚕丝",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天蚕丝")+0,总类=1001},
		-- {可叠加=false,名称="玄龟板",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","玄龟板")+0,总类=1001},
		-- {可叠加=false,名称="阴沉木",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","阴沉木")+0,总类=1001},
		-- {可叠加=false,名称="麒麟血",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","麒麟血")+0,总类=1001},
		-- {可叠加=false,名称="金凤羽",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","金凤羽")+0,总类=1001},
		-- {可叠加=false,名称="补天石",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","补天石")+0,总类=1001},
		-- {可叠加=false,名称="龙筋",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","龙筋")+0,总类=1001},
	}
	self.商品组[18]["折扣"]={
		{价格=1,可叠加=true,名称="月华露",阶品=5000},
		{价格=1,可叠加=true,名称="易经丹"},
		{价格=1,可叠加=true,名称="玉葫灵髓"},
		{价格=1,可叠加=true,名称="清灵净瓶"},
		{价格=1,可叠加=true,名称="元宵",食材="芝麻沁香"},
		{价格=1,可叠加=true,名称="元宵",食材="桂花酒酿"},
		{价格=1,可叠加=true,名称="元宵",食材="细磨豆沙"},
		{价格=1,可叠加=true,名称="元宵",食材="蜜糖腰果"},
		{价格=1,可叠加=true,名称="元宵",食材="山楂拔丝"},
		{价格=1,可叠加=true,名称="元宵",食材="滑玉莲蓉"},
		{价格=1,可叠加=true,名称="炼兽真经"},
		{价格=1,可叠加=false,名称="高级召唤兽内丹"},
		{价格=1,可叠加=false,名称="召唤兽内丹"},
		--{价格=1,可叠加=false,名称="炼妖石",分类=3,级别限制=140},
		{价格=1,可叠加=false,名称="天眼珠",总类=3,分类=11,灵气=100,级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="项圈",级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="护腕",级别限制=160},
		{价格=1,可叠加=false,名称="上古锻造图策",总类=3,分类=10,种类="铠甲",级别限制=160},
		{价格=1,可叠加=false,名称="点化石",技能="力劈华山"},
		{价格=1,可叠加=false,名称="点化石",技能="善恶有报"},
		{价格=1,可叠加=false,名称="点化石",技能="地狱烈火"},
		{价格=1,可叠加=false,名称="点化石",技能="水漫金山"},
		{价格=1,可叠加=false,名称="点化石",技能="奔雷咒"},
		{价格=1,可叠加=false,名称="点化石",技能="泰山压顶"},
		{价格=1,可叠加=false,名称="魔兽要诀"},
		{价格=1,可叠加=false,名称="高级魔兽要诀"},
		--{价格=1,可叠加=true,名称="魔兽残卷"},
		{价格=0,附带技能="迅敏",总类=3,子类=0,识别码="4_1598949402_73_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="狂怒",总类=3,子类=0,识别码="4_1598949414_220_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="阴伤",总类=3,子类=0,识别码="4_1598949418_339_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="静岳",总类=3,子类=0,识别码="4_1598949422_974_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="擅咒",总类=3,子类=0,识别码="4_1598949425_430_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="灵身",总类=3,子类=0,识别码="4_1598949430_710_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="矫健",总类=3,子类=0,识别码="4_1598949434_614_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="深思",总类=3,子类=0,识别码="4_1598949438_844_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="钢化",总类=3,子类=0,识别码="4_1598949442_563_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="坚甲",总类=3,子类=0,识别码="4_1598949448_734_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="慧心",总类=3,子类=0,识别码="4_1598949453_562_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="撞击",总类=3,子类=0,识别码="4_1598949457_725_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="无畏",总类=3,子类=0,识别码="4_1598949461_351_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="愤恨",总类=3,子类=0,识别码="4_1598949465_46_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="淬毒",总类=3,子类=0,识别码="4_1598949470_706_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="狙刺",总类=3,子类=0,识别码="4_1598949474_948_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="连环",总类=3,子类=0,识别码="4_1598949483_646_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="圣洁",总类=3,子类=0,识别码="4_1598949488_219_31000010086",名称="召唤兽内丹",分类=3},
		{价格=0,附带技能="灵光",总类=3,子类=0,识别码="4_1598949493_364_31000010086",名称="召唤兽内丹",分类=3},

		{价格=0,附带技能="隐匿击",总类=3,子类=0,识别码="4_1598949699_693_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="腾挪劲",总类=3,子类=0,识别码="4_1598949649_734_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="双星爆",总类=3,子类=0,识别码="4_1598949691_152_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="通灵法",总类=3,子类=0,识别码="4_1598949687_613_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="电魂闪",总类=3,子类=0,识别码="4_1598949682_547_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="舍身击",总类=3,子类=0,识别码="4_1598949678_284_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="凛冽气",总类=3,子类=0,识别码="4_1598949674_152_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="阴阳护",总类=3,子类=0,识别码="4_1598949669_825_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="神机步",总类=3,子类=0,识别码="4_1598949645_906_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="碎甲刃",总类=3,子类=0,识别码="4_1598949665_626_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="玉砥柱",总类=3,子类=0,识别码="4_1598949662_47_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="龙胄铠",总类=3,子类=0,识别码="4_1598949657_911_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="玄武躯",总类=3,子类=0,识别码="4_1598949653_249_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="血债偿",总类=3,子类=0,识别码="4_1598949709_558_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="生死决",总类=3,子类=0,识别码="4_1598949703_265_31000010086",名称="高级召唤兽内丹",分类=3},
		{价格=0,附带技能="催心浪",总类=3,子类=0,识别码="4_1598949695_967_31000010086",名称="高级召唤兽内丹",分类=3},
	}
	self.商品组[18]["金元宝2"]={

	}
	self.商品组[18]["金元宝宠物"]={
        {价格=800,模型="进阶琴仙",名称="进阶琴仙",类型="神兽"},
        {价格=800,模型="飞天",名称="飞天",类型="神兽"},
        {价格=800,模型="神狗",名称="神狗",类型="神兽"},
        {价格=800,模型="超级神狗",名称="超级神狗",类型="神兽"},
        {价格=800,模型="神鼠",名称="神鼠",类型="神兽"},
        {价格=800,模型="超级神鼠",名称="超级神鼠",类型="神兽"},

         {价格=800,模型="神猪",名称="神猪",类型="神兽"},
         {价格=800,模型="超级神猪",名称="超级神猪",类型="神兽"},
         {价格=800,模型="小白龙",名称="小白龙",类型="神兽"},
         {价格=800,模型="超级小白龙",名称="超级小白龙",类型="神兽"},
         {价格=800,模型="猪小戒",名称="猪小戒",类型="神兽"},
         {价格=800,模型="超级猪小戒",名称="超级猪小戒",类型="神兽"},
         {价格=800,模型="谛听",名称="谛听",类型="神兽"},
         {价格=800,模型="进阶谛听",名称="进阶谛听",类型="神兽"},

         {价格=800,模型="狐不归",名称="狐不归",类型="神兽"},
         {价格=800,模型="进阶狐不归",名称="进阶狐不归",类型="神兽"},
         {价格=800,模型="花灵",名称="花灵",类型="神兽"},
         {价格=800,模型="进阶花灵",名称="进阶花灵",类型="神兽"},
         {价格=800,模型="涂山雪",名称="涂山雪",类型="神兽"},
         {价格=800,模型="进阶涂山雪",名称="进阶涂山雪",类型="神兽"},
         {价格=800,模型="月魅",名称="月魅",类型="神兽"},
         {价格=800,模型="进阶月魅",名称="进阶月魅",类型="神兽"},
         {价格=800,模型="月影仙",名称="月影仙",类型="神兽"},
         {价格=800,模型="进阶月影仙",名称="进阶月影仙",类型="神兽"},
         {价格=800,模型="云游火",名称="云游火",类型="神兽"},
         {价格=800,模型="进阶云游火",名称="进阶云游火",类型="神兽"},
	}
	self.商品组[18]["人物装备"]={

		{价格=200,不可交易=true,专用=true,体质=100,力量=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,体质=100,魔力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,体质=100,耐力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,体质=100,敏捷=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,敏捷=100,力量=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,敏捷=100,魔力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=200,不可交易=true,专用=true,敏捷=100,耐力=100,伤害=1500,命中=1500,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},

	    {价格=200,不可交易=true,专用=true,体质=100,力量=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,体质=100,魔力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,体质=100,耐力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,体质=100,敏捷=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,敏捷=100,力量=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,敏捷=100,魔力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=200,不可交易=true,专用=true,敏捷=100,耐力=100,防御=800,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},

	    {价格=200,不可交易=true,专用=true,防御=300,魔法=500,特效="无级别限制",特技="魔兽之印",名称="浑天玄火盔",性别限制="男",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=1,子类=1,识别码="6_1598869982_3033943_430"},
	    {价格=200,不可交易=true,专用=true,防御=300,气血=1000,特效="无级别限制",特技="晶清诀",名称="紫霄云芒带",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=5,子类=1,识别码="6_1598869982_1261519_444"},
	    {价格=200,不可交易=true,专用=true,防御=300,敏捷=300,特效="无级别限制",特技="圣灵之甲",名称="辟尘分光履",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=6,子类=1,识别码="6_1598869982_1363505_452"},
	    {价格=200,不可交易=true,专用=true,灵力=800,特效="无级别限制",特技="四海升平",名称="落霞陨星坠",制造者="元宝购买",级别限制=160,耐久=800,总类=2,分类=2,子类=1,识别码="6_1598869982_3041294_436"},

        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="法术暴击等级",强化=0,数值=80},[2]={类型="法术暴击等级",强化=0,数值=80},[3]={类型="法术暴击等级",强化=0,数值=80},[4]={类型="法术暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="法术伤害",强化=0,数值=100},[2]={类型="法术伤害",强化=0,数值=100},[3]={类型="法术伤害",强化=0,数值=100},[4]={类型="法术伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="物理暴击等级",强化=0,数值=80},[2]={类型="物理暴击等级",强化=0,数值=80},[3]={类型="物理暴击等级",强化=0,数值=80},[4]={类型="物理暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="伤害",强化=0,数值=100},[2]={类型="伤害",强化=0,数值=100},[3]={类型="伤害",强化=0,数值=100},[4]={类型="伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="治疗能力",强化=0,数值=80},[2]={类型="治疗能力",强化=0,数值=80},[3]={类型="治疗能力",强化=0,数值=80},[4]={类型="治疗能力",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="封印命中等级",强化=0,数值=80},[2]={类型="封印命中等级",强化=0,数值=80},[3]={类型="封印命中等级",强化=0,数值=80},[4]={类型="封印命中等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="伤害",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="戒指",名称="太虚渺云",特效="无级别限制",幻化属性={基础={类型="防御",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="法术暴击等级",强化=0,数值=80},[2]={类型="法术暴击等级",强化=0,数值=80},[3]={类型="法术暴击等级",强化=0,数值=80},[4]={类型="法术暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="法术伤害",强化=0,数值=100},[2]={类型="法术伤害",强化=0,数值=100},[3]={类型="法术伤害",强化=0,数值=100},[4]={类型="法术伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="物理暴击等级",强化=0,数值=80},[2]={类型="物理暴击等级",强化=0,数值=80},[3]={类型="物理暴击等级",强化=0,数值=80},[4]={类型="物理暴击等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="伤害",强化=0,数值=100},[2]={类型="伤害",强化=0,数值=100},[3]={类型="伤害",强化=0,数值=100},[4]={类型="伤害",强化=0,数值=100}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="治疗能力",强化=0,数值=80},[2]={类型="治疗能力",强化=0,数值=80},[3]={类型="治疗能力",强化=0,数值=80},[4]={类型="治疗能力",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="封印命中等级",强化=0,数值=80},[2]={类型="封印命中等级",强化=0,数值=80},[3]={类型="封印命中等级",强化=0,数值=80},[4]={类型="封印命中等级",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术伤害",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="耳饰",名称="焰云霞珠",特效="无级别限制",幻化属性={基础={类型="法术防御",强化=0,数值=50},附加={[1]={类型="固定伤害",强化=0,数值=80},[2]={类型="固定伤害",强化=0,数值=80},[3]={类型="固定伤害",强化=0,数值=80},[4]={类型="固定伤害",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,不可交易=true,专用=true,部位类型="手镯",名称="浮雪幻音",特效="无级别限制",幻化属性={基础={类型="抵抗封印等级",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="手镯",名称="浮雪幻音",特效="无级别限制",幻化属性={基础={类型="封印命中等级",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},

        {价格=200,不可交易=true,专用=true,部位类型="佩饰",名称="碧海青天",特效="无级别限制",幻化属性={基础={类型="速度",强化=0,数值=50},附加={[1]={类型="气血",强化=0,数值=200},[2]={类型="气血",强化=0,数值=200},[3]={类型="气血",强化=0,数值=200},[4]={类型="气血",强化=0,数值=200}}},制造者="元宝购买",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},
        {价格=200,不可交易=true,专用=true,部位类型="佩饰",名称="碧海青天",特效="无级别限制",幻化属性={基础={类型="速度",强化=0,数值=50},附加={[1]={类型="速度",强化=0,数值=80},[2]={类型="速度",强化=0,数值=80},[3]={类型="速度",强化=0,数值=80},[4]={类型="速度",强化=0,数值=80}}},制造者="元宝购买",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},


	}
	self.商品组[18]["宠物装备"]={
		{价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝带",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=7,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝带",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=7,子类=1,级别限制=160},

        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕丝圈",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=8,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕丝圈",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=8,子类=1,级别限制=160},

        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",速度=300,伤害=300,耐久=500,力量=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",速度=300,灵力=300,耐久=500,魔力=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,防御=300,耐久=500,体质=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=200,名称="冰蚕织甲",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,体质=100,总类=2,分类=9,子类=1,级别限制=160},
        {价格=200,不可交易=true,专用=true,名称="冰蚕织甲",特效="无级别限制",气血=300,速度=300,耐久=500,体质=100,敏捷=100,总类=2,分类=9,子类=1,级别限制=160},
	}
	self.商品组[18]["杂货一类"]={
		{价格=50,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="心源",级别限制=30,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="狂浪滔天",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="固若金汤",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="锐不可当",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="通真达灵",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="血气方刚",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,不可交易=true,专用=true,可叠加=false,总类=5,附加特性="健步如飞",级别限制=20,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},

	    {价格=10,可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,级别限制=25},
		{价格=10,可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,级别限制=30},
		{价格=10,可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,级别限制=30},
		{价格=10,可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,级别限制=30},
		{价格=10,可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,级别限制=30},
		{价格=10,可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,级别限制=30},
		{价格=10,可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,级别限制=30},
		{价格=10,可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,级别限制=30},

		{价格=1,可叠加=true,总类=9,名称="初级神魂丹",分类=1,子类=1},
		{价格=2,可叠加=true,总类=9,名称="中级神魂丹",分类=1,子类=1},
		{价格=3,可叠加=true,总类=9,名称="高级神魂丹",分类=1,子类=1},
		{价格=50,可叠加=true,总类=9,名称="坐骑内丹",分类=1,子类=1},
		{价格=50,技能="高级夜战",类型="速度",造型="幽灵",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级偷袭",类型="速度",造型="吸血鬼",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级必杀",类型="伤害",造型="鬼将",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级连击",类型="伤害",造型="律法女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="气血",造型="灵符女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="灵力",造型="大力金刚",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级敏捷",类型="防御",造型="雾中仙",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级法术暴击",类型="灵力",造型="灵鹤",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级魔之心",类型="气血",造型="炎魔神",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级夜战",类型="速度",造型="夜罗刹",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=50,技能="高级强力",类型="速度",造型="噬天虎",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},

	}
	self.商品组[18]["杂货二类"]={
	    {价格=20,可叠加=true,名称="双倍经验丹"},
		{价格=10,可叠加=false,名称="小额银票"},
		{价格=100,可叠加=false,名称="大额银票"},
		{价格=50,可叠加=false,名称="储灵袋"},
		{价格=10,可叠加=true,名称="九转金丹",阶品=500},
		{价格=10,可叠加=true,名称="修炼果",阶品=500},
		{价格=100,可叠加=false,总类=13,子类="雷绝阵",识别码="2_1599892574_954_31000010086",名称="鬼谷子",分类=3},
		{价格=300,可叠加=false,名称="点化石",技能="横扫千军"},
		{价格=300,可叠加=false,名称="点化石",技能="鹰击"},
		{价格=300,可叠加=false,名称="点化石",技能="龙卷雨击"},
		{价格=300,可叠加=false,名称="点化石",技能="雷霆万钧"},
		{价格=300,可叠加=false,名称="点化石",技能="飞砂走石"},
		{价格=300,可叠加=false,名称="点化石",技能="落叶萧萧"},
		{价格=10,子类=1,总类=3,名称="超级金柳露",分类=2},
	}


	self.商品组[18]["锦衣"]={
		--{名称="碧华锦凝雪",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","碧华锦凝雪")+0,锦衣=true,子类=1},
		--{名称="夜影",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夜影")+0,锦衣=true,子类=1},
		--{名称="夏日清凉",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","夏日清凉")+0,锦衣=true,子类=1},
		--{名称="华风汉雅",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","华风汉雅")+0,锦衣=true,子类=1},
		--{名称="萌萌小厨",总类=2,分类=15,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","萌萌小厨")+0,锦衣=true,子类=1},
		{价格=1,名称="冰灵蝶翼·月笼沙",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="冰雪玉兔",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="锦绣幻梦",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="浪淘纱",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="浪淘纱·月白",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="铃儿叮当",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="萌狮闹春",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="蜜蜂嗡嗡",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="齐天大圣",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="顽皮小恶魔",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="尖叫男爵",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夏日清凉",总类=2,分类=15,锦衣=true,子类=1},
	    {价格=1,名称="纤云纱·墨黑",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="雁翎银钩·月笼沙",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夜影",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="夜之孤煞",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="萤雪轻裘",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="驭龙猎手",总类=2,分类=15,锦衣=true,子类=1},
	    {价格=1,名称="重溟软甲",总类=2,分类=15,锦衣=true,子类=1},
		{价格=1,名称="竹林熊猫",总类=2,分类=15,锦衣=true,子类=1},

	}
	self.商品组[18]["祥瑞"]={
	    --{价格=1,名称="汗血宝马",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="欢喜羊羊",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="魔力斗兽",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="披甲战狼",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="闲云野鹤",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="云魅仙鹿",总类="祥瑞",分类=16,子类=2},
		--{价格=1,名称="神气小龟",总类="祥瑞",分类=16,子类=2},


		{价格=1,名称="瑞彩祥云",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="落英纷飞",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="七彩祥云",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="齐天小轿",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="风火飞轮",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="凤舞灵蝶",总类="祥瑞",分类=16,子类=2},
		{价格=1,名称="流云玉佩",总类="祥瑞",分类=16,子类=2},
		-- {可叠加=false,名称="展翅高飞",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","展翅高飞")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="旗开得胜",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","旗开得胜")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="霸王雄风",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霸王雄风")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="独眼观天",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","独眼观天")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="威武不屈",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威武不屈")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="深藏不露",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","深藏不露")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="异域浓情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域浓情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="流星天马",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","流星天马")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="威猛将军",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","威猛将军")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="知情达理",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","知情达理")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="气宇轩昂",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","气宇轩昂")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="如花似玉",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","如花似玉")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="傲视天下",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","傲视天下")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="铁血豪情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","铁血豪情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="唯我独尊",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","唯我独尊")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="叱咤风云",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","叱咤风云")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="异域风情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","异域风情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="假面勇者",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","假面勇者")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="霓裳魅影",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","霓裳魅影")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="披星戴月",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","披星戴月")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="烈焰燃情",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","烈焰燃情")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="天雨流芳",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","天雨流芳")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="灵光再现",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","灵光再现")+0,总类="坐骑饰品"},
		-- {可叠加=false,名称="倾国倾城",价格=f函数.读配置(程序目录.."Shopping.ini","仙玉商城","倾国倾城")+0,总类="坐骑饰品"},
	}
	self.商品组[18]["足迹"]={
		{名称="龙卷风足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","龙卷风足迹")+0,锦衣=true,子类=3},
		{名称="皮球足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","皮球足迹")+0,锦衣=true,子类=3},
		{名称="雀屏足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雀屏足迹")+0,锦衣=true,子类=3},
		{名称="旋律足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","旋律足迹")+0,锦衣=true,子类=3},
		{名称="枫叶足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","枫叶足迹")+0,锦衣=true,子类=3},
		{名称="飞天足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","飞天足迹")+0,锦衣=true,子类=3},
		{名称="两心相悦足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","两心相悦足迹")+0,锦衣=true,子类=3},
		{名称="心花怒放",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","心花怒放")+0,锦衣=true,子类=3},
		{名称="雷电足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雷电足迹")+0,锦衣=true,子类=3},
		{名称="寒冰足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","寒冰足迹")+0,锦衣=true,子类=3},
		{名称="星星祈愿",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","星星祈愿")+0,锦衣=true,子类=3},
		{名称="地狱焰火",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","地狱焰火")+0,锦衣=true,子类=3},
		{名称="元宝足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","元宝足迹")+0,锦衣=true,子类=3},
		{名称="光剑足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","光剑足迹")+0,锦衣=true,子类=3},
		{名称="雪花足迹",总类=2,分类=17,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雪花足迹")+0,锦衣=true,子类=3},
	}

	self.商品组[18]["足印"]={
		{名称="浩瀚星河",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","浩瀚星河")+0,锦衣=true,子类=2},
		{名称="烈焰澜翻",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","烈焰澜翻")+0,锦衣=true,子类=2},
		{名称="水墨游龙",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","水墨游龙")+0,锦衣=true,子类=2},
		{名称="星光熠熠",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","星光熠熠")+0,锦衣=true,子类=2},
		{名称="双鲤寄情",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","双鲤寄情")+0,锦衣=true,子类=2},
		{名称="凌波微步",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","凌波微步")+0,锦衣=true,子类=2},
		{名称="荷塘涟漪",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","荷塘涟漪")+0,锦衣=true,子类=2},

		{名称="雪花飘落",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","雪花飘落")+0,锦衣=true,子类=2},
		{名称="月影婆娑",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","月影婆娑")+0,锦衣=true,子类=2},
		{名称="祥云瑞气",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","祥云瑞气")+0,锦衣=true,子类=2},
		{名称="花的海洋",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","花的海洋")+0,锦衣=true,子类=2},
		{名称="爱的光影",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","爱的光影")+0,锦衣=true,子类=2},
		{名称="珠落玉盘",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","珠落玉盘")+0,锦衣=true,子类=2},
		{名称="红叶随风",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","红叶随风")+0,锦衣=true,子类=2},
		{名称="白色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","白色精灵")+0,锦衣=true,子类=2},
		{名称="黑色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","黑色精灵")+0,锦衣=true,子类=2},
		{名称="蓝色精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","蓝色精灵")+0,锦衣=true,子类=2},
		{名称="海豚精灵",总类=2,分类=16,价格=f函数.读配置(程序目录.."Shopping.ini","锦衣祥瑞","海豚精灵")+0,锦衣=true,子类=2},
	}


	self.商品组[18]["宝宝"]={
		{模型="超级神龙",名称="超级神龙",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神龙")+0},
		{模型="超级土地公公",名称="超级土地公公",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级土地公公")+0},
		{模型="超级六耳猕猴",名称="超级六耳猕猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级六耳猕猴")+0},
		{模型="超级神鸡",名称="超级神鸡",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神鸡")+0},
		{模型="超级玉兔",名称="超级玉兔",类型="神兽",饰品=true,价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级玉兔")+0},
		{模型="超级神猴",名称="超级神猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神猴")+0},
		{模型="超级神马",名称="超级神马",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神马")+0},
		{模型="超级神羊",名称="超级神羊",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神羊")+0},
		{模型="超级孔雀",名称="超级孔雀",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级孔雀")+0},
		{模型="超级灵狐",名称="超级灵狐",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级灵狐")+0},
		{模型="超级筋斗云",名称="超级筋斗云",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级筋斗云")+0},
		{模型="超级麒麟",名称="超级麒麟",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级麒麟")+0},
		{模型="超级大鹏",名称="超级大鹏",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大鹏")+0},
		{模型="超级赤焰兽",名称="超级赤焰兽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级赤焰兽")+0},
		{模型="超级白泽",名称="超级白泽",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级白泽")+0},
		{模型="超级灵鹿",名称="超级灵鹿",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级灵鹿")+0},
		{模型="超级大象",名称="超级大象",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大象")+0},
		{模型="超级金猴",名称="超级金猴",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级金猴")+0},
		{模型="超级大熊猫",名称="超级大熊猫",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级大熊猫")+0},
		{模型="超级泡泡",名称="超级泡泡",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级泡泡")+0},
		{模型="超级神兔",名称="超级神兔",类型="神兽",饰品=true,价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神兔")+0},
		{模型="超级神虎",名称="超级神虎",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神虎")+0},
		{模型="超级神牛",名称="超级神牛",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神牛")+0},
		-- {模型="超级海豚",名称="超级海豚",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级海豚")+0},
		{模型="超级人参娃娃",名称="超级人参娃娃",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级人参娃娃")+0},
		{模型="超级青鸾",名称="超级青鸾",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级青鸾")+0},
		{模型="超级腾蛇",名称="超级腾蛇",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级腾蛇")+0},
		{模型="超级神蛇",名称="超级神蛇",类型="神兽",价格=f函数.读配置(程序目录.."Shopping.ini","神兽","超级神蛇")+0},
		--{模型="贪狼",名称="贪狼",类型="神兽",价格=1},
	}

	self.商品组[18]["法宝"]={}
	local 名称={"碧玉葫芦","五色旗盒","飞剑","拭剑石","金甲仙衣","惊魂铃","嗜血幡","风袋","清心咒","九黎战鼓","盘龙壁","神行飞剑","汇灵盏","天师符","织女扇"}
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],1))
	end
	名称={"发瘟匣","断线木偶","五彩娃娃","七杀","金刚杵","兽王令","摄魂","附灵玉"}
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],2))
	end
	名称={"失心钹","五火神焰印","九幽","普渡","鬼泣","月光宝盒","混元伞","无魂傀儡","苍白纸人","聚宝盆","乾坤玄火塔","无尘扇","无字经","干将莫邪","慈悲","救命毫毛","伏魔天书","镇海珠","奇门五行令","月影"}
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],3))
	end
	名称={"流影云笛","宿幕星河","蟠龙玉璧","落星飞鸿","归元圣印","千斗金樽"}
	for i=1,#名称 do
		table.insert(self.商品组[18]["法宝"], self:商城取法宝(名称[i],4))
	end
	self.商品组[19]["活跃兑换"]={
	    {价格=300,可叠加=true,名称="双倍经验丹"},
        --{价格=200,可叠加=false,名称="小额银票"},
		--{价格=2000,可叠加=false,名称="大额银票"},
	    {价格=1,可叠加=true,总类=9,名称="初级神魂丹",分类=1,子类=1},
		{价格=5,可叠加=true,总类=9,名称="中级神魂丹",分类=1,子类=1},
		{价格=30,可叠加=true,总类=9,名称="高级神魂丹",分类=1,子类=1},
		{价格=500,可叠加=true,总类=9,名称="坐骑内丹",分类=1,子类=1},

	    {价格=30,可叠加=false,总类=5,附加特性="心源",级别限制=15,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="狂浪滔天",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="固若金汤",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="锐不可当",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="通真达灵",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="血气方刚",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978179_8375365_996",气血="提高20点躲避力",分类=6},
	    {价格=30,可叠加=false,总类=5,附加特性="健步如飞",级别限制=10,名称="钟灵石",子类=8,识别码="1_1598978173_2290325_994",气血="提高20点躲避力",分类=6},

	    {价格=20,可叠加=false,名称="星辉石",总类=5,分类=6,子类=8,级别限制=15},
		{价格=20,可叠加=false,名称="光芒石",总类=5,分类=6,子类=1,级别限制=15},
		{价格=20,可叠加=false,名称="月亮石",总类=5,分类=6,子类=2,级别限制=15},
		{价格=20,可叠加=false,名称="太阳石",总类=5,分类=6,子类=3,级别限制=15},
		{价格=20,可叠加=false,名称="舍利子",总类=5,分类=6,子类=4,级别限制=15},
		{价格=20,可叠加=false,名称="红玛瑙",总类=5,分类=6,子类=5,级别限制=15},
		{价格=20,可叠加=false,名称="黑宝石",总类=5,分类=6,子类=6,级别限制=15},
		{价格=20,可叠加=false,名称="神秘石",总类=5,分类=6,子类=7,级别限制=15},
		{价格=300,技能="高级夜战",类型="速度",造型="幽灵",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级偷袭",类型="速度",造型="吸血鬼",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级必杀",类型="伤害",造型="鬼将",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级连击",类型="伤害",造型="律法女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="气血",造型="灵符女娲",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="灵力",造型="大力金刚",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级敏捷",类型="防御",造型="雾中仙",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级法术暴击",类型="灵力",造型="灵鹤",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级魔之心",类型="气血",造型="炎魔神",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级夜战",类型="速度",造型="夜罗刹",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},
		{价格=300,技能="高级强力",类型="速度",造型="噬天虎",等级=8,正负=1,属性=10,次数=8,识别码="21_1600637579_145_21000010086",总类=30,分类=1,子类=1,名称="怪物卡片"},


        {价格=100,附带技能="观照万象",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="净台妙谛",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="理直气壮",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="叱咤风云",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="天降灵葫",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="千钧一怒",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="龙魂",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="灵山禅语",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="浮云神马",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="大快朵颐",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="从天而降",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="八凶法阵",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="灵能激发",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="法术防御",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="死亡召唤",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="苍鸾怒击",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="夜舞倾城",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="壁垒击破",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="月光",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="剑荡四方",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="嗜血追击",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="上古灵符",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="惊心一剑",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="驱怪",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="力劈华山",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="须弥真言",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},
		{价格=50,附带技能="善恶有报",名称="高级魔兽要诀",总类=3,分类=1,子类=0,识别码="8_1599044520_559_31000010086"},

		{价格=100,体质=50,力量=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,魔力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,耐力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,体质=50,敏捷=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,力量=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,魔力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},
        {价格=100,敏捷=50,耐力=50,伤害=1000,命中=1000,名称="擒龙",特效="无级别限制",特技="罗汉金钟",角色限制={[1]="逍遥生",[2]="剑侠客"},制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=3,子类=3,识别码="6_1598869982_5903921_407"},

	    {价格=100,体质=50,力量=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,魔力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,耐力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,体质=50,敏捷=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,力量=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,魔力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},
	    {价格=100,敏捷=50,耐力=50,防御=600,特效="无级别限制",特技="慈航普渡",名称="混元一气甲",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=4,子类=1,识别码="6_1598869982_8371303_420"},

	    {价格=80,防御=200,魔法=300,特效="无级别限制",特技="魔兽之印",名称="浑天玄火盔",性别限制="男",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=1,子类=1,识别码="6_1598869982_3033943_430"},
	    {价格=80,防御=200,气血=600,特效="无级别限制",特技="晶清诀",名称="紫霄云芒带",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=5,子类=1,识别码="6_1598869982_1261519_444"},
	    {价格=80,防御=200,敏捷=200,特效="无级别限制",特技="圣灵之甲",名称="辟尘分光履",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=6,子类=1,识别码="6_1598869982_1363505_452"},
	    {价格=100,灵力=500,特效="无级别限制",特技="四海升平",名称="落霞陨星坠",制造者="活跃度兑换",级别限制=160,耐久=800,总类=2,分类=2,子类=1,识别码="6_1598869982_3041294_436"},

        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="法术暴击等级",强化=0,数值=10},[2]={类型="法术暴击等级",强化=0,数值=10},[3]={类型="法术暴击等级",强化=0,数值=10},[4]={类型="法术暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="法术伤害",强化=0,数值=20},[2]={类型="法术伤害",强化=0,数值=20},[3]={类型="法术伤害",强化=0,数值=20},[4]={类型="法术伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="物理暴击等级",强化=0,数值=10},[2]={类型="物理暴击等级",强化=0,数值=10},[3]={类型="物理暴击等级",强化=0,数值=10},[4]={类型="物理暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="伤害",强化=0,数值=20},[2]={类型="伤害",强化=0,数值=20},[3]={类型="伤害",强化=0,数值=20},[4]={类型="伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="治疗能力",强化=0,数值=20},[2]={类型="治疗能力",强化=0,数值=20},[3]={类型="治疗能力",强化=0,数值=20},[4]={类型="治疗能力",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="封印命中等级",强化=0,数值=10},[2]={类型="封印命中等级",强化=0,数值=10},[3]={类型="封印命中等级",强化=0,数值=10},[4]={类型="封印命中等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="伤害",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="戒指",特效="无级别限制",名称="太虚渺云",幻化属性={基础={类型="防御",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=12,子类=3,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="法术暴击等级",强化=0,数值=10},[2]={类型="法术暴击等级",强化=0,数值=10},[3]={类型="法术暴击等级",强化=0,数值=10},[4]={类型="法术暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="法术伤害",强化=0,数值=20},[2]={类型="法术伤害",强化=0,数值=20},[3]={类型="法术伤害",强化=0,数值=20},[4]={类型="法术伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="物理暴击等级",强化=0,数值=10},[2]={类型="物理暴击等级",强化=0,数值=10},[3]={类型="物理暴击等级",强化=0,数值=10},[4]={类型="物理暴击等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="伤害",强化=0,数值=20},[2]={类型="伤害",强化=0,数值=20},[3]={类型="伤害",强化=0,数值=20},[4]={类型="伤害",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="治疗能力",强化=0,数值=20},[2]={类型="治疗能力",强化=0,数值=20},[3]={类型="治疗能力",强化=0,数值=20},[4]={类型="治疗能力",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="封印命中等级",强化=0,数值=10},[2]={类型="封印命中等级",强化=0,数值=10},[3]={类型="封印命中等级",强化=0,数值=10},[4]={类型="封印命中等级",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术伤害",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="耳饰",特效="无级别限制",名称="焰云霞珠",幻化属性={基础={类型="法术防御",强化=0,数值=20},附加={[1]={类型="固定伤害",强化=0,数值=10},[2]={类型="固定伤害",强化=0,数值=10},[3]={类型="固定伤害",强化=0,数值=10},[4]={类型="固定伤害",强化=0,数值=10}}},制造者="活跃度兑换",耐久=500,总类=2,分类=10,子类=1,识别码="4_1598960909_5714005_331",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="手镯",特效="无级别限制",名称="浮雪幻音",幻化属性={基础={类型="抵抗封印等级",强化=0,数值=20},附加={[1]={类型="气血",强化=0,数值=50},[2]={类型="气血",强化=0,数值=50},[3]={类型="气血",强化=0,数值=50},[4]={类型="气血",强化=0,数值=50}}},制造者="活跃度兑换",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},
        {价格=100,部位类型="手镯",特效="无级别限制",名称="浮雪幻音",幻化属性={基础={类型="封印命中等级",强化=0,数值=20},附加={[1]={类型="气血",强化=0,数值=50},[2]={类型="气血",强化=0,数值=50},[3]={类型="气血",强化=0,数值=50},[4]={类型="气血",强化=0,数值=50}}},制造者="活跃度兑换",耐久=500,总类=2,分类=13,子类=4,识别码="4_1598960261_2654573_19",幻化等级=0,级别限制=160,灵饰=true},

        {价格=100,部位类型="佩饰",特效="无级别限制",名称="碧海青天",幻化属性={基础={类型="速度",强化=0,数值=20},附加={[1]={类型="速度",强化=0,数值=20},[2]={类型="速度",强化=0,数值=20},[3]={类型="速度",强化=0,数值=20},[4]={类型="速度",强化=0,数值=20}}},制造者="活跃度兑换",耐久=500,总类=2,分类=11,子类=2,识别码="4_1598960479_3761229_237",幻化等级=0,级别限制=160,灵饰=true},

	    {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝带",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝带",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=7,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝带",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=7,子类=1,级别限制=160},

        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝圈",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕丝圈",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=8,子类=1,级别限制=160},
        {价格=100,名称="冰蚕丝圈",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=8,子类=1,级别限制=160},

        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
	    {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,伤害=150,耐久=500,力量=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",速度=150,灵力=150,耐久=500,魔力=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕织甲",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,防御=150,耐久=500,体质=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},
        --{价格=50,名称="冰蚕织甲",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,体质=20,总类=2,分类=9,子类=1,级别限制=160},
        {价格=100,名称="冰蚕织甲",特效="无级别限制",气血=150,速度=150,耐久=500,体质=20,敏捷=20,总类=2,分类=9,子类=1,级别限制=160},

   	}
   	self.商品组[18+5] = {杂货={},仙玉={},金元宝2={},折扣={},宝宝={},法宝={},金元宝宠物={},锦衣祥瑞={},锦衣={},祥瑞={},足迹={},足印={},人物装备={},宠物装备={},杂货一类={},杂货二类={}}
	self.商品组[19+5] = {活跃兑换={}}
end

function 商城处理类:商城取法宝(名称,等级)
  local 识别码=os.time().."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
  随机序列=随机序列+1
  local 法宝数据={}
  local 道具 = 取物品数据(名称)
  法宝数据.名称=名称
  法宝数据.总类=1000
  法宝数据.分类=道具[3]
  法宝数据.使用=道具[5]
  法宝数据.特技=道具[6]
  法宝数据.气血=0
  法宝数据.魔法=取灵气上限(道具[3])
  法宝数据.角色限制=道具[7] or 0
  法宝数据.五行=取五行()
  法宝数据.伤害=道具[8] or 0
  法宝数据.当前经验=0
  法宝数据.升级经验=法宝经验[法宝数据.分类][1]
  法宝数据.识别码=识别码
  法宝数据.价格=等级*(f函数.读配置(程序目录.."Shopping.ini","法宝","法宝")+0)
  return 法宝数据
end

function 商城处理类:数据处理(id,内容)
	self.允许购买 = true
	self.购买组号 = 内容.组号 + 0
	self.购买编号 = 内容.编号
	self.购买数量 = 内容.数量
	self.购买分类 = 内容.分类
	local 仙玉=f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉")+0
	local 银子=玩家数据[id].角色.数据.银子
	local 元宝=玩家数据[id].角色.数据.元宝.当前元宝
	local 积分=玩家数据[id].角色.数据.比武积分.当前积分
	local 当前活跃=玩家数据[id].角色.数据.累积活跃.当前积分
	if self.购买数量 > 99 then
		发送数据(玩家数据[id].连接id, 7, "#y/您的购买的数量超过99个!")
		return 0
	end
	if self.购买数量 ==0 then
		发送数据(玩家数据[id].连接id, 7, "#y/请输入正确的数量")
		return 0
	end
	if self.购买数量 == nil or self.购买分类== "宝宝" or self.购买分类== "金元宝宠物" then
		self.购买数量 = 1
	elseif self.购买数量 == nil or (self.购买数量 ~= nil and self.购买数量 < 1) then
		self.购买数量 = 1
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
		self.购买总量 = 内容.数量
		self.购买数量 = 1
	else
		self.购买数量 = self.购买数量 + 0
	end
	local 购买价格 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格
	local 购买总价 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格*内容.数量
	if self.购买分类== "宝宝" then
		if #玩家数据[id].召唤兽.数据 >= 7 then
			发送数据(玩家数据[id].连接id, 7, "#y/您当前无法携带更多的召唤兽了")
			self.允许购买 = false
			return 0
		elseif 仙玉 < 购买总价 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
			self.允许购买 = false
			return 0
		else
			self:扣除仙玉(仙玉,购买价格,id)
			玩家数据[id].召唤兽:添加召唤兽(self.商品组[self.购买组号][self.购买分类][self.购买编号].模型,nil,nil,true,0,内容.物法)
		    发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类== "金元宝宠物" then
		if #玩家数据[id].召唤兽.数据 >= 7 then
			发送数据(玩家数据[id].连接id, 7, "#y/您当前无法携带更多的召唤兽了")
			self.允许购买 = false
			return 0
		elseif 元宝 < 购买总价 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的元宝不足")
			self.允许购买 = false
			return 0
		else
			if self.商品组[self.购买组号][self.购买分类][self.购买编号].不可交易~=nil then
				self.商品组[self.购买组号][self.购买分类][self.购买编号].不可交易=true
		    end
			玩家数据[id].角色:扣除元宝(购买价格,"商城购买",id)
			玩家数据[id].召唤兽:添加召唤兽(self.商品组[self.购买组号][self.购买分类][self.购买编号].模型,nil,nil,true,0,内容.物法)
		    发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买价格 .. "#Y/点元宝购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类== "法宝" then
		if 仙玉 < 购买价格 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
			self.允许购买 = false
		end
		if self.允许购买 then
			self:扣除仙玉(仙玉,购买价格,id)
			玩家数据[id].道具:给予法宝(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
			发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end

	elseif self.购买分类 == "杂货" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if  仙玉 <= 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
				    self:扣除仙玉(仙玉,购买总价,id)
				else
					self:扣除仙玉(仙玉,购买总价,id)
				end
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{10})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{10})
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
					if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹()
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取内丹("高级")
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/两银子购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	elseif self.购买分类== "人物装备" or self.购买分类== "宠物装备" or self.购买分类== "杂货一类"or self.购买分类== "杂货二类"then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if  元宝 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的元宝不足")
				self.允许购买 = false
			end
			if self.商品组[self.购买组号][self.购买分类][self.购买编号].不可交易~=nil then
				self.商品组[self.购买组号][self.购买分类][self.购买编号].不可交易=true
		    end
			if self.商品组[self.购买组号][self.购买分类][self.购买编号].专用~=nil then
				self.商品组[self.购买组号][self.购买分类][self.购买编号].专用=id
		    end
			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
				    玩家数据[id].角色:扣除元宝(购买总价,"商城购买",id)
				else
					玩家数据[id].角色:扣除元宝(购买价格,"商城购买",id)
				end
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{10})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{6})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{8})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{10})
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
					if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=玩家数据[id].道具.数据[self.道具编号].附带技能
					elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
					 	玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点元宝购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	elseif self.购买分类=="活跃兑换" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if 当前活跃 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的活跃度不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				玩家数据[id].角色:扣除活跃(购买价格,"活跃商城",id)
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "小额银票" then
				    玩家数据[id].角色:添加银子(100000000,"商城购买",1)
				    常规提示(id,"#Y/恭喜你从商城购买了#R/一亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "大额银票" then
					玩家数据[id].角色:添加银子(1000000000,"商城购买",1)
					常规提示(id,"#Y/恭喜你从商城购买了#R/两亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "160级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{16})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "160级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{16})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{14,14},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{15,15},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "随机制造指南书" then
					玩家数据[id].道具:给予书铁(id,{6,15},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "制造指南书" then
					玩家数据[id].道具:给予书铁(id,{6,15},"指南书")
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))--复制物品(self.商品组[self.购买组号][self.购买分类][self.购买编号])--
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1001 then
						玩家数据[id].道具.数据[self.道具编号].不可交易=true
						玩家数据[id].道具.数据[self.道具编号].专用=true
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == "祥瑞" then
					    if 玩家数据[id].角色.数据.坐骑列表~= nil and #玩家数据[id].角色.数据.坐骑列表==7 then
					      常规提示(id,"#Y/购买[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑失败!携带坐骑数量已上限.")
					      return false
					    else
					      常规提示(id,"#Y/恭喜你购买了[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑!")
					      全局坐骑资料:获取坐骑(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
					      发送数据(玩家数据[id].连接id,61,玩家数据[id].角色.数据.坐骑列表)
					    end
					else
						玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
						if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
							玩家数据[id].道具.数据[self.道具编号].附带技能=玩家数据[id].道具.数据[self.道具编号].附带技能
						elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
							玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
						elseif 玩家数据[id].道具.数据[self.道具编号].总类 == "坐骑饰品" then
							local 坐骑饰品 = 取物品数据(玩家数据[id].道具.数据[self.道具编号].名称)
							玩家数据[id].道具.数据[self.道具编号].子类=坐骑饰品[4]
						end
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点活跃度购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	else
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				self.允许购买 = false
			end
			if 仙玉 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")
				self.允许购买 = false
			end
			if self.允许购买 then
				self:扣除仙玉(仙玉,购买总价,id)
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "小额银票" then
				    玩家数据[id].角色:添加银子(100000000,"商城购买",1)
				    常规提示(id,"#Y/恭喜你从商城购买了#R/一亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "大额银票" then
					玩家数据[id].角色:添加银子(1000000000,"商城购买",1)
					常规提示(id,"#Y/恭喜你从商城购买了#R/两亿两银子#Y/。")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "160级随机灵饰指南书" then
					玩家数据[id].道具:给予道具(id,"灵饰指南书",{16})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{12})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{14})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "160级元灵晶石" then
					玩家数据[id].道具:给予道具(id,"元灵晶石",{16})
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{14,14},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级随机指南书" then
					玩家数据[id].道具:给予书铁(id,{15,15},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "随机制造指南书" then
					玩家数据[id].道具:给予书铁(id,{6,15},"指南书")
				elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "制造指南书" then
					玩家数据[id].道具:给予书铁(id,{6,15},"指南书")
				else
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))--复制物品(self.商品组[self.购买组号][self.购买分类][self.购买编号])--
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=内容.数量
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1001 then
						玩家数据[id].道具.数据[self.道具编号].不可交易=true
						玩家数据[id].道具.数据[self.道具编号].专用=true
					end
					if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == "祥瑞" then
					    if 玩家数据[id].角色.数据.坐骑列表~= nil and #玩家数据[id].角色.数据.坐骑列表==7 then
					      常规提示(id,"#Y/购买[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑失败!携带坐骑数量已上限.")
					      return false
					    else
					      常规提示(id,"#Y/恭喜你购买了[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑!")
					      全局坐骑资料:获取坐骑(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
					      发送数据(玩家数据[id].连接id,61,玩家数据[id].角色.数据.坐骑列表)
					    end
					else
						玩家数据[id].角色.数据.道具[self.临时格子]=self.道具编号
						if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then--可以参考 道具处理类:给予道具 函数
							玩家数据[id].道具.数据[self.道具编号].附带技能=取高级要诀()
						elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
							玩家数据[id].道具.数据[self.道具编号].附带技能=取低级要诀()
						elseif 玩家数据[id].道具.数据[self.道具编号].总类 == "坐骑饰品" then
							local 坐骑饰品 = 取物品数据(玩家数据[id].道具.数据[self.道具编号].名称)
							玩家数据[id].道具.数据[self.道具编号].子类=坐骑饰品[4]
						end
					end
				end
			end
		end
		发送数据(玩家数据[id].连接id, 7, "#y/您花费了#R/" .. 购买总价 .. "#Y/点仙玉购买了#R/"..内容.数量.."个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	end
end

function 内存加密(内容)
	return 内容
end

function 商城处理类:扣除仙玉(仙玉,扣除价格,id)
   仙玉=仙玉-扣除价格
   f函数.写配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉",仙玉)
end

function 商城处理类:取商品组数据(id, 序号,积分商城)
	if  玩家数据[id].角色.数据.元宝==nil then
		玩家数据[id].角色.数据.元宝={}
	end
	if  玩家数据[id].角色.数据.元宝.当前元宝==nil then
		玩家数据[id].角色.数据.元宝={当前元宝=0,累积元宝=0}
	end
	self.发送消息 = {}
	序号 = 序号 + 0
	local 妖魔兑换积分=0
	local 副本积分=0
	local 种族积分=0
	local 累积活跃=0
	local 当前活跃=0
	if 玩家数据[id].角色.数据.副本积分~=nil then
	    副本积分=玩家数据[id].角色.数据.副本积分
	end
	if 妖魔积分~=nil and 妖魔积分[id]~=nil then
		妖魔兑换积分=妖魔积分[id].当前
	end
	if 玩家数据[id].角色.数据.累积活跃~=nil then
	    累积活跃=玩家数据[id].角色.数据.累积活跃.总积分
	    当前活跃=玩家数据[id].角色.数据.累积活跃.当前积分
	end

	self.商品组[序号].银子 = 玩家数据[id].角色.数据.银子
	self.商品组[序号].积分数 = {比武积分=玩家数据[id].角色.数据.比武积分.当前积分,种族积分=种族积分,副本积分=副本积分,妖魔积分=妖魔兑换积分,累积活跃=累积活跃,当前活跃=当前活跃}
	self.商品组[序号].组号 = 序号
	self.商品组[序号].仙灵玉 = f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉")+0
	self.商品组[序号].元宝 = 玩家数据[id].角色.数据.元宝.当前元宝
	self.商品组[序号+5].银子 = 玩家数据[id].角色.数据.银子
	self.商品组[序号+5].积分数 = {比武积分=玩家数据[id].角色.数据.比武积分.当前积分,种族积分=种族积分,副本积分=副本积分,妖魔积分=妖魔兑换积分,累积活跃=累积活跃,当前活跃=当前活跃}
	self.商品组[序号+5].组号 = 序号
	self.商品组[序号+5].仙灵玉 = f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","仙玉")+0
	self.商品组[序号+5].元宝 = 玩家数据[id].角色.数据.元宝.当前元宝
	if 积分商城~=nil then
	    self.商品组[序号].序列=2
	    self.商品组[序号+5].序列=2
	else
		self.商品组[序号].序列=1
		self.商品组[序号+5].序列=1
	end
	if 序号==18 then
		发送数据(玩家数据[id].连接id, 3700, self.商品组[序号+5])
	elseif 序号==19 then
		发送数据(玩家数据[id].连接id, 3701, self.商品组[序号+5])
	end

end
function 商城处理类:更新(dt) end
function 商城处理类:显示(x, y) end

return 商城处理类
